{
  "id": "1hg1dpt",
  "title": "Just because you have ADHD doesn't make you an expert on it.",
  "selftext": "I have ADHD and I am a healthcare practitioner. I work as a consultant for families of children with developmental issues. \n\nThe amount of nonsense suggestions, treatments, explanations, and \"strategies\" for ADHD and it's symptoms is driving me up the wall. \n\nJust because you have ADHD, doesn't make you an expert on explaining the disorder, it's symptoms, how to treat it, or how to manage it. You can speak from your personal experience but you should not be giving medical advice.\n\nBAD Advice: \"Dopamine Detox\"\n- Dopamine drives motivation, habit formation, learning, and many other things, it is a GOOD thing! \n- Dopamine does not function properly for people with ADHD.\n- Many medications prescribed for ADHD can help by signaling to your brain for dopamine & several other neurotransmitters to fire more often; this helps you get the happy feels other people get while doing stuff like laundry, work, etc. \n- What your psychiatrist didn't tell you is that you will get happy feels for completing any task, whether it's important or not, it's still up to you to decide to do what you need to do.\n\n***A \"dopamine detox\" is a 1-way ticket to depression & self-loathing. \n\nGOOD Advice: Establish routines and easy tiny goals!\n- Medication or not, routines are your friend, do it the same way every day and you will form a habit. \n- Be REALISTIC. Forget about \"I will wake up everyday at 6 AM and make my bed and become a billionaire by next Tuesday\". How about you start with \"I will put my pajamas in the hamper every morning when I get changed\". Yeah I know you've been dropping them on the floor.\n\nDopamine is good. Dopamine is your friend. Other people's brains give them little dopamine hits while they clean up, do their homework, etc. Their brain says \"good job! keep going!\" Our brain doesn't do that so instead we get addicted to video games that tell us \"good job! keep going!\"\n\nThoughts? Opinions? Open for discussion.",
  "score": 2140,
  "num_comments": 244,
  "subreddit": "ADHD",
  "author": "PeppermintBob",
  "created_utc": 1734405307,
  "url": "https://reddit.com/r/ADHD/comments/1hg1dpt",
  "is_text_post": true,
  "rank": 93
}