{
  "id": "1gawhg4",
  "title": "I lost everything because a woman from Facebook couldn’t sleep with my husband",
  "selftext": "I’m sorry if this post sounds like rambling but I just need somewhere to share this. I [22F] have spent the last 9 months being stalked by a woman from Facebook [26F] because I didn’t let her sleep with my husband [27M]. \n\nMy husband I meant through an online forum. There’s probably 2k people who know of it, but only 150 or so active participants at any given time, most of whom have been in it for at least 5 years. It ended up migrating to Facebook and Discord due to ease of use. A few years before I met my husband, I ended up becoming close with a woman I’m going to call May for this post. We were in one of the many smaller discords together and as this group tends to be male-dominated, we formed almost a sisterly bond. We spoke every day for 3 years and shared absolutely everything with each other, including very personal traumas. There was a point where I was even on her mom’s AT&T account despite never having hung out with her in person. I’m neurodivergent (I have autism) so our online friendship was the closest friendship I had.\n\nMay had been dating a guy who she’d meant in the same circle, Brian, for around two years. Brian, while a great guy in personality, struggled heavily with alcoholism and trouble keeping a job. As much as we loved him, May had been funding his entire lifestyle and it started to take a toll on her. While she agreed that she didn’t believe she had any future with him, she absolutely refused to leave. She ended up messaging my husband, Paul, on Messenger to ask from advice from both the perceptive of a man and someone who had been a friend of his. This is apparently where it started.\n\nI didn’t have any reservations about May talking to Paul. She had been my close friends for years and I had already introduced her to multiple previous boyfriends without issue. She had also been messaging me frequently to coordinate wedding plans, even buying plane tickets to travel to be my bridesmaid. It was incredibly important, as this would be both the first time we met and a very special event in my life. However, at some point May started shifting the conversation with Paul to wedding plans instead of her relationship problems. Instead of making travel plans with me, she started repeatedly asking that my husband arrange everything because I was too stressed with the rest of the wedding. Paul deferred everything back to me the first few times. When she saw that, she shifted. \n\nDuring this same time period, I was recovering from a complicated pregnancy loss that resulted in me having multiple surgeries. I developed a very deep depression afterwards and wasn’t feeling my best self emotionally or physically. My husband has always struggled with both anxiety and autism, and that shared struggle had only heightened things. We began fighting more than normal. While things were both good, they absolutely weren’t perfect. May had been privy to everything that had been going on in our lives and I felt comfortable venting to her when we got into arguments. When Paul denied her requests to make travel plans, she ended up shifting to the topic of our arguments.\n\nFrom what I saw in their conversations, May initially brought up how something I had messaged her sounded weird, that maybe something was off with me and it didn’t sound like something he would say. Her statement was correct, as she had taken a sentence I said out of context and cropped the screenshot to remove any explanation I had offered on it. Paul was hesitant to believe her but the next morning, he came back to ask again.\n\nWithin the span of weeks, May had convinced Paul that I was cheating and looking for a discrete way of canceling the wedding without telling him I had an affair partner. As she was my best friend, my husband took her at face value. She would often crop things out of context or twist events I had told her and retell them to him, framing them as weird and suspicious. Despite it all, Paul refused to leave me until he had concrete proof that I had been cheating. Instead, May switched back to bringing up travel plans. Rather than the girls night we had planned, her goal shifted to drinks and a movie with Paul. She talked about how she would comfort him and give him a much needed break, taking him to all his favorite places. She would follow it up by sending him Spotify songs that reminded her of him, calling him cute and texting him good morning. The worst part wasn’t even the cheating. She had tried to tell him I had actually aborted our child, and that the miscarriage was a plea for sympathy. While Paul shut down this multiple times, it had clearly been planted in his head.\n\nI started to notice something had shifted in Paul. Instead of my usual attentive husband, he stopped participating in wedding planning. He spent most of the day glued to his phone. I begged for communication but he would pretend to be oblivious to whatever I was complaining about. Our fights shifted from spats as a result of heavy emotion and into accusations of me acting suspicious or being untrustworthy. A lot of these days are a blur to me now. In a moment of weakness, I went through his phone. That’s where I found all of the messages he had sent with May.\n\nThere had been quite a few suggestive text messages mixed in with what May had sent him. While Paul did not acknowledge them, it had absolutely been an emotional affair and an attempt at a physical one on her part. He acknowledged this and we spent a long time talking. My husband and I ended up pursuing couples counseling to discuss what lead to this. We found out through a therapist that this most definitely fit the bill for incredible manipulation. He had been convinced I had been cheating on him and was waiting for the other shoe to drop at any moment. \n\nI ended up leaving many of our discords and group chats. I reached out to May’s partner, Brian and informed him of the situation. Initially, May pretended this was 100% Paul’s fault, and the affair was totally one sided. However, as soon as I messaged Brian, the conversation changed. May sent me multiple long paragraphs detailing how I should commit suicide and I was a compulsive liar, making up things that never happened. Brian responded with hostility, insisting I had been the one who cheated. I messaged a few of our mutual friends to ask for advice, and received an incredible amount of screenshots of May telling them I had been engaged in an affair going back long before she’d ever mentioned the idea to Paul. She had even named specific people and places. Luckily, all of the people she named were also in the community and able to provide an alibi that not only did it not happen, but most often we were on opposite sides of the country on the dates she named. \n\nWhen this failed, May made multiple long Facebook posts about how I was witchunting her because I ruined my own marriage. I deleted my Facebook but I wish I could say that stopped it. Every day, for the last 9 months, May has made at least one post detaining the same story. She accused me of using her to cover up my affair, using drugs and abusing my husband. Paul and I ended up continuing on with our wedding. The night before, we received multiple calls to our cake and food vendors impersonating me and telling them we had called it off. She even attempted to pay cancellation fees.\n\nThe posts happened so often that I started tuning them out by default. People would often provide me with screenshots but I simply ignored them. That seemed to only anger her farther, as things continued to escalate. After we had managed to figure out the situation with the wedding vendors, May called the police. She insinuated to me and the cops that I was underage and my husband was sexually abusing me. Specifically, she had claimed I was 16 and only my husband knew, as he was happily abusing me in order to cover up the fact I was lying about my age to have affairs with other adult men. Due to me entering the community when I was underage and being younger than many other members, some of them believed her. When she had convinced them enough, they turned on her for not calling the cops. This resulted in a visit from our local police department, as well as a call from the state police as she’d contacted internet crimes against children as well. I was easily able to prove my age but the police report she made only convinced people further.\n\nBy this point, I acknowledge that this was internet drama and there was nothing I could do but turn off my phone. Once the police report was cleared, I deleted any trace of myself left on the internet and decided to try reaching out to people in person. Instead, May retained an attorney. She alleged that I had doxxed her online and that people had shown up to her home, threatening her as a result. With her new attorney in tow, she emailed both my job and the college I was attending telling them that I was being charged with harassment.\n\nI study nursing and I work with children who have developmental disabilities. In my state, you can’t work or attend school for either of these things if you possess a criminal record. Any kind of allegation of this sort is incredibly serious and enough to get you expelled. I had to file my own police report and pleaded with both institutions to believe me. While the police were unable to do anything, as May lived in another state and it was out of the jurisdiction, I was able to provide a police report I had made about her to both and get my name cleared. However, the continued calls to my work place meant that I was asked to quit for the safety of the children.\n\nLosing my job broke me. My profession was my passion and I struggled to find meaningful work due to my autism. Saying it gutted me is a complete understatement. I was pissed. May had also claimed to work in a daycare for children with disabilities and pursuing her own degree in early childhood education. I had enough and decided to report her to both her job and her own school. While I had the addresses for both, neither claimed to recognize her. I ended up spending an entire weekend calling around to different agencies and universities within 4 hours of her address. None had ever heard of her. In the state she lives in, educators and people working with children have to sign up for a registry. She had never been entered onto it.\n\nI looked back through our conversation and found that May’s story of what she did changed often. Particularly, I noticed that when I entered my field, May had changed from working in a Montessori school to working with children with disabilities. Before, she had claimed to be studying biology and shifted it to childhood education when I expressed that I was considering the same field. The more I read, the more I noticed the same pattern of behavior. When I mentioned a band, May would parrot having interests in the same things. If I had a hobby, she would slowly start telling others she was even better than me at the same activity. After a week of obsessing over it, I realized May had never even told me one thing she was interested in that I hadn’t brought up first. We had been friends for years and I couldn’t name a single personality trait, interest or hobby that was unique to her. We spent hours on voice call, texting every day and it was her agreeing with me before coming back a week later to announce that actually, she had thought that before I had ever even said it. \n\nI started to actually lose my mind. Between the constant harassment, pregnancy loss and couples counseling, I felt like I was going insane. I had long since been off the internet and I couldn’t escape her. I decided to come back to Facebook and announce my findings with all of the screenshots of the emotional affair included. I was met with a lot of support. A few other women would come out, sharing that May had done similar things to their partners or had been catty to them in the past. Our mutual friends would thank me for sharing and ask what they could do to help this stop. I don’t think I’ve ever felt so supported in my life but none of the support stopped her.\n\nWithin a week of reactivating my Facebook, I had another woman making posts about me. We had been in the same community but she rarely was active so I was not well acquainted with her. She made 10 or so posts mostly insulting my appearance and repeating similar phrases to May. She thanked God that my child was dead because there was no need for more of my genetics on this planet. While I had too much going on to pay proper attention to her (and she had me blocked) it was relayed to me that her own husband had admitted to cheating but wouldn’t admit with who. An anonymous account reached out to her, claiming to be me and that I was the affair partner. Doubly, I started receiving calls and texts to my phone number often from men claiming they’d spoke with me on hook up sites and that I was looking to share photos and meet up. \n\nI felt I had little left at this point. I couldn’t engage with my support system, I had changed my job, lost my job and left college to avoid any more trouble. I spent much of my time locked in the house and forced to clean to try not to think about it. I had attempted going to the police twice more and was told that there was nothing that could be done. I couldn’t afford to hire my own attorney. Brian would reach out to me via email, explaining to me that May had been confirmed to be cheating on him. One of our other friend’s partner had left his girlfriend and they had begun dating just hours later. When he refused to give her attention after she messaged his mother and childhood friends calling him a drug addict, she attempted to report him for revenge porn. As vindicated as I was that this was not a unique experience, it had been 9 months since I confronted Paul about the text messages and they had never once slowed. No matter how much or little attention I gave her, it kept going.\n\nI wish I had a concrete way to end this but unfortunately May has made 2 separate posts about me today. I am lost on what more there is to do. Without a job, I can’t hire a lawyer and even then, it’s hard to do with us living in different states. I feel so isolated and cut off from the world. My marriage will likely dissolve as a result of the strain this has put on our trust, regardless of therapy. I’m not sure what there is left to do. ",
  "score": 2026,
  "num_comments": 137,
  "subreddit": "offmychest",
  "author": "aspiemonch",
  "created_utc": 1729752505,
  "url": "https://reddit.com/r/offmychest/comments/1gawhg4",
  "is_text_post": true,
  "rank": 100
}