{
  "id": "1fw23o2",
  "title": "First Season of Gardening! ",
  "subreddit": "gardening",
  "author": "BadgalBrooky",
  "created_utc": 1728056162,
  "score": 7625,
  "num_comments": 128,
  "permalink": "/r/gardening/comments/1fw23o2/first_season_of_gardening/",
  "url": "https://www.reddit.com/gallery/1fw23o2",
  "selftext": "This was my first season of gardening! \n\nLast summer I bought my first home. The home itself was well maintained but the yard needed a ton of work. My partner and I spent all spring clearing the yard and pruning the trees/bushes and getting rid of invasive plants.\n\nWe planted kale, tomatoes, raspberries, blueberries, sunflowers, zinnias and dahlias as annuals. As well as put in tons of perennials where we cleared out old leaves.\n\nI think my favorite part of growing is the flowers! This past month I’ve really enjoyed cutting flowers and making bouquets for my home and friends.\n\nA couple of lessons I learned:\n\n1. The plants that did the best had better soil conditions \n\n2. Don’t try and plant perennials during the heat of the summer\n\n3. Don’t plant veggies you don’t want to eat\n\nI had zero gardening experience going in and I learned a lot about plants this season. I can’t wait for next spring!",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9900000095367432,
  "domain": "reddit.com",
  "is_self": false,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "CasualConversation",
    "DoesAnybodyElse"
  ],
  "varied_title": "Initial Season of Gardening!",
  "varied_selftext": "This was my initial season of gardening! Previous summer I bought my first home. The home itself was well maintained but the yard needed a ton of work. My partner and I spent all spring clearing the yard and pruning the trees/bushes and getting rid of invasive plants. We planted kale, tomatoes, raspberries, blueberries, sunflowers, zinnias and dahlias as annuals. As well as put in tons of perennials where we cleared out old leaves. I think my favorite part of growing is the flowers! This past month I’ve really enjoyed cutting flowers and making bouquets for my home and friends. A couple of lessons I learned: 1. The plants that did the best had better soil conditions 2. Don’t try and plant perennials during the heat of the summer 3. Don’t plant veggies you don’t want to eat I had zero gardening experience going in and I learned a lot about plants this season. I can’t wait for next spring!"
}