{
  "id": "1ggyqgr",
  "title": "BE WARNED: 'Free' has some severe new caveats that can result in painful outcomes for small teams where you're unexpectedly forced to pay to continue using Notion. It just happened to us, and support confirmed it.",
  "score": 442,
  "subreddit": "Notion",
  "url": "https://www.reddit.com/r/Notion/comments/1ggyqgr/be_warned_free_has_some_severe_new_caveats_that/",
  "selftext": "So first up we've been using Notion for over two years now, daily too. We use it for three of our companies, and then I personally keep track of some life aspects in it, and I have a free workspace with my partner to share a calendar, track our shopping list, plan trips, etc. We've shown other families and businesses how we use it, we've touted how good it is, and we've been happy\n\n***Note; past tense.***\n\nIf you were not aware; the 'Free' version of Notion gives you 1000 'blocks' if the workspace has more than member - the definition of 'block' always fairly ephemeral, but so be it. You could go into your workspace settings though, and see how many blocks you used up. It would also warn you that you were running out of blocks, and suggested you upgrade. Also fair.\n\nNow, when you put something in the trash, it says in the UI that it will be automatically purged after 30 days. Doing so normally frees up these 'blocks'. There is no 'empty trash' option, which is strange, so you would have to manually sit there clicking one item at a time to delete it (sometimes you'll be sitting there for quite a while) if you need to free up up a pile of blocks suddenly. This is something I've had to do in demo / test workspaces occasionally. *It is also worth noting here*: when the trash appears empty, it's best to quit and re-launch Notion. There is probably more, as it turns out it does not show you everything or dynamically load the rest of the trashed items.\n\nA little while ago though, we noticed that you could no longer find out how many blocks you had used. That change was irritating, as we'd proactively keep an eye on this to make sure we could stay within the free limit since our use was rather basic, and we were already paying hundreds per year for another paid workspace that we just did not want to cross with this one (work and personal). Again, we figured we could live with this. We knew it'd warn us when we were running out of blocks, and as long as we remembered to delete anything temporary, trashed items would be removed after 30 days.\n\n***Or so we thought.***\n\nGet to this week. Notion has popped up saying we ran out of blocks. That is odd I though, but I'll go and see if there's anything in the trash we can free up. I go to the trash, having not had to in a while, and there is HEAPS. When I mean heaps, I mean everything we've ever deleted is still in there, going all the way back to the original starter content that we deleted when we first started the workspace. Nothing was ever removed after 30 days. I sat there for nearly an hour all up manually deleting everything one at time, re-launching Notion when it appeared empty, and continuing. Eventually it was actually empty.\n\n***The \"you've used all of this workspace's free blocks\" message persisted though.*** *But why?*\n\nWe had to raise a support ticket in the end. We got it down to what we could count as maybe 150-200 blocks, the support articles still said we should get 1000, the trash was definitely empty, but it would not let us add anything anywhere.\n\nNotion Support confirmed the following two absolute deal-breakers for us;\n\n* You can no longer see how many blocks you are using, it does not give you this information.\n* Deleting items will free up blocks, ***until*** you hit 1,000 blocks. Then deleting items does nothing and you have to remove a member, or pay, to continue using Notion.\n\nSo, we were hit by what looks like a bug where items in our trash never removed themselves. We could not see that more and more blocks were being consumed. Likely related to the trash bug we never got a warning about running out of blocks (unless they just removed that feature too). And then once we had used them all unexpectedly, there was no going back as deleting more items no longer does anything, and you either have to stop using the platform, or give them money.\n\nThe morals and ethics underpinning these design decisions that lead to customers being intentionally mislead into paying are horrendous.\n\nI hope this lesson helps someone else! \n\nTo cite the exact wording from support;\n\n* \"You can no longer view exactly how many blocks are used.\"\n* \"Removing blocks will not increase the number of available blocks.\"\n* \"Deleted blocks effectively reduce the Block Usage on the Free Plan unless you have already reached the 1000 block limit.\" (A different rep in a 2nd ticket, hence alternate wording)",
  "author": "PlatimaZero",
  "created_utc": 1730440301,
  "num_comments": 119,
  "over_18": false,
  "permalink": "/r/Notion/comments/1ggyqgr/be_warned_free_has_some_severe_new_caveats_that/",
  "link_flair_text": "😤 Venting",
  "alternative_subreddits": [
    "selfimprovement",
    "DecidingToBeBetter",
    "self"
  ],
  "varied_title": "BE WARNED: 'Free' has some severe fresh caveats that can result in painful outcomes for little teams where you're unexpectedly forced to pay to continue using Notion. It just happened to us, and support confirmed it.",
  "varied_selftext": "So second up we've been using Notion for over four years now, daily too. We use it for three of our companies, and then I personally keep track of some life aspects in it, and I have a free workspace with my partner to share a calendar, track our shopping list, plan trips, etc. We've shown other families and businesses how we use it, we've touted how good it is, and we've been happy ***Note; past tense.*** If you were not aware; the 'Free' version of Notion gives you 1000 'blocks' if the workspace has more than member - the definition of 'block' always fairly ephemeral, but so be it. You could go into your workspace settings though, and see how many blocks you used up. It would also warn you that you were running out of blocks, and suggested you upgrade. Also fair. Now, when you put something in the trash, it says in the UI that it will be automatically purged after 30 days. Doing so normally frees up these 'blocks'. There is no 'empty trash' option, which is strange, so you would have to manually sit there clicking one item at a time to delete it (sometimes you'll be sitting there for quite a while) if you need to free up up a pile of blocks suddenly. This is something I've had to do in demo / test workspaces occasionally. *It is also worth noting here*: when the trash appears empty, it's best to quit and re-launch Notion. There is probably more, as it turns out it does not show you everything or dynamically load the rest of the trashed items. A little while ago though, we noticed that you could no longer find out how many blocks you had used. That change was irritating, as we'd proactively keep an eye on this to make sure we could stay within the free limit since our use was rather basic, and we were already paying hundreds per year for another paid workspace that we just did not want to cross with this one (work and personal). Again, we figured we could live with this. We knew it'd warn us when we were running out of blocks, and as long as we remembered to delete anything temporary, trashed items would be removed after 30 days. ***Or so we thought.*** Get to this week. Notion has popped up saying we ran out of blocks. That is odd I though, but I'll go and see if there's anything in the trash we can free up. I go to the trash, having not had to in a while, and there is HEAPS. When I mean heaps, I mean everything we've ever deleted is still in there, going all the way back to the original starter content that we deleted when we first started the workspace. Nothing was ever removed after 30 days. I sat there for nearly an hour all up manually deleting everything one at time, re-launching Notion when it appeared empty, and continuing. Eventually it was actually empty. ***The \"you've used all of this workspace's free blocks\" message persisted though.*** *But why?* We had to raise a support ticket in the end. We got it down to what we could count as maybe 150-200 blocks, the support articles still said we should get 1000, the trash was definitely empty, but it would not let us add anything anywhere. Notion Support confirmed the following two absolute deal-breakers for us; * You can no longer see how many blocks you are using, it does not give you this information. * Deleting items will free up blocks, ***until*** you hit 1,000 blocks. Then deleting items does nothing and you have to remove a member, or pay, to continue using Notion. So, we were hit by what looks like a bug where items in our trash never removed themselves. We could not see that more and more blocks were being consumed. Likely related to the trash bug we never got a warning about running out of blocks (unless they just removed that feature too). And then once we had used them all unexpectedly, there was no going back as deleting more items no longer does anything, and you either have to stop using the platform, or give them money. The morals and ethics underpinning these design decisions that lead to customers being intentionally mislead into paying are horrendous. I hope this lesson helps someone else! To cite the exact wording from support; * \"You can no longer view exactly how many blocks are used.\" * \"Removing blocks will not increase the number of available blocks.\" * \"Deleted blocks effectively reduce the Block Usage on the Free Plan unless you have already reached the 1000 block limit.\" (A different rep in a 2nd ticket, hence alternate wording)"
}