{
  "id": "1fzguue",
  "title": "Girlfriend (25F) cheated and disappeared. I (M25) moved on with (F24), now she's back angry at me. What am I supposed to do?",
  "subreddit": "relationship_advice",
  "author": "throwra_outlaw41",
  "created_utc": 1728439524,
  "score": 12575,
  "num_comments": 1527,
  "permalink": "/r/relationship_advice/comments/1fzguue/girlfriend_25f_cheated_and_disappeared_i_m25/",
  "url": "https://www.reddit.com/r/relationship_advice/comments/1fzguue/girlfriend_25f_cheated_and_disappeared_i_m25/",
  "selftext": "My (now ex) girlfriend and I met and started dating early 2022. I always felt on my guard with her because she was a 10\\10 and I couldn't figure out why she decided to date me, let alone be in a relationship with me for a year. We went long distance in 2023 because she got a great opportunity to go to Europe for work on a 1 year contract. It was huge money and an opportunity for her to travel, but I couldn't afford to go.\nWe video chatted regularly, talked throughout the day by text and things seemed manageable a few months in. I started feeling anxious because she mentioned a guy she worked with who always hit on her, but she assured me nothing would happen and she really missed me.\n\nOne week, she didn't answer and left me on read for two weeks. I finally asked if she was okay and if something happened. She finally answered and said that she had made a mistake and didn't know how to tell me. She wound up going out with that coworker and slept with him. She told me the sex was \"completely shitty\" and described a few things and how it made it so weird. Things I wish I didn't know. Imtold her I was really hurt because she promised nothing would happen and we were still in a relationship. She said she understood she hurt me and it was hard for me but she chose to be honest. She said she needed some space to sort out everything, and it felt like she wanted me to feel bad for her.\n\nA month went by. I reached out once and she left me on read. One month became two, then three. I gave up. I went to therapy after a few weeks cause I was so devastated. I had gone to this therapist after I got out of college at 18, so it's been helpful. But I just wrote off the relationship and decided it was time to move on. I felt angry at first, thought about sleeping with one of my coworkers or friends. But I never did.\n\nAfter 4 months, i asked out the girl who had been my stylist for almost a year. She was super sweet and always subtly flirted with me. We went out and it was just a breath of fresh air. She was very beautiful and kind and we talked so easily and had a great time with each other. We went on 5 or so dates before we said we were a thing. I told her about what happened with my ex and I considered it over and in the past but I had some trust issues and she understood. Her ex did cheated on her too a few years prior.\n\nIt's been almost 6 months since my ex cheated on me. My new girlfriend met my parents and I met her mom. Things have gone very well, and I can't explain everything has been just easy, less anxious and fun. We had a family party at my parents place this last weekend. I decided to post some photos to my Instagram of me and her doing some of the games and just a photo of us together. \n\nI woke up the next morning to a flood of angry texts from my ex. For \"abandoning our relationship\" and not being man enough to tell her it was over and I had moved on. I blocked her number, and then she continued on Instagram and even emailed. Finally I responded saying she didn't deserve to be mad, she cheated and turned her back on everything. She and the relationship was dead to me and she needed to live with what she did.\n\nShe also messaged my new girlfriend. Some nasty things about how how she looked, how we were together and she couldn't replace her. My girlfriend was upset with her but didn't take it to heart. She also blocked my ex and we've just been trying to proceed as normal. But my ex's friends have also messaged me as the bad guy. \n\nI don't feel like this is something I need to answer for",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9700000286102295,
  "domain": "self.relationship_advice",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "stopprocrastinating",
    "bulletjournal",
    "declutter",
    "minimalism",
    "selfimprovement",
    "college",
    "bipolar",
    "schizophrenia",
    "selfcare",
    "Meditation"
  ]
}