{
  "id": "1fzyjhm",
  "title": "They said getting married would end our sex life. ",
  "subreddit": "TrueOffMyChest",
  "author": "OPofThisSpecificPost",
  "created_utc": 1728498744,
  "score": 7694,
  "num_comments": 262,
  "permalink": "/r/TrueOffMyChest/comments/1fzyjhm/they_said_getting_married_would_end_our_sex_life/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1fzyjhm/they_said_getting_married_would_end_our_sex_life/",
  "selftext": "His friends warned him. They told him that, as soon as I got that ring, kiss sex goodbye. \n\nOne friend, very religious and stuck in a loveless marriage, who invited a third person into their relationship and broke the rules by fucking the third alone without his wife knowing, warned my husband that it would all be downhill from here. \n\nNone of them know how good we have it. None of them know how obsessed we are with each other, and have been since high school. The frisky, awkward little teens have only gotten more confident and more adventurous over time. Did they think we'd suddenly get tired of each other after 15 years just because we finally share a last name? Ridiculous.\n\nThe stress release we've had after the wedding has been remarkable - I can't keep my hands off him, and he keeps laughing and joking that he would have married me sooner if he had known the effect it would've had. \n\nDon't be in a hurry. Love your person wholly. Try new things. When the clerk at the sex shop recommends the libido chocolate, brush off the embarassment and give it a try. When your husband makes comments about how good you look, lean into it and ask if he has any requests for later.  Don't stop having fun. And if you think sex with one person is boring, you're fuckin' doing it wrong. ",
  "link_flair_text": null,
  "over_18": true,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9200000166893005,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "confession",
    "CasualConversation"
  ],
  "varied_title": "They said getting married would end our sex life. ",
  "varied_selftext": "His friends warned him. They told him that, as soon as I got that ring, kiss sex goodbye. Two friend, quite religious and stuck in a loveless marriage, who invited a third person into their relationship and broke the rules by fucking the third alone without his wife knowing, warned my husband that it would all be downhill from here. None of them know how good we have it. None of them know how obsessed we are with each other, and have been since high school. The frisky, awkward little teens have only gotten more confident and more adventurous over time. Did they think we'd suddenly get tired of each other after 15 years just because we finally share a last name? Ridiculous. The stress release we've had after the wedding has been remarkable - I can't keep my hands off him, and he keeps laughing and joking that he would have married me sooner if he had known the effect it would've had. Don't be in a hurry. Love your person wholly. Try new things. When the clerk at the sex shop recommends the libido chocolate, brush off the embarassment and give it a try. When your husband makes comments about how good you look, lean into it and ask if he has any requests for later. Don't stop having fun. And if you think sex with one person is boring, you're fuckin' doing it wrong."
}