{
  "id": "1geh29n",
  "title": "My (32M) wife (31F) sold the dresser my SIL (28ish) built and gifted us. How do I help smooth and fix the potential backlash?",
  "selftext": "So my SIL (my brother's wife) makes furniture as a hobby and is really good at it. About a year ago my brother randomly asked if my wife and I needed anything, he was beating around the bush and I blurted the first thing that came to mind and said a new entryway dresser would be nice. I didn't think anything would come out of it, but a couple of months ago for our 5th anniversary, they surprised us with our own custom built dresser.\n\nI'm not a crafty person at all, but I could tell that a lot of effort and time was put into this piece. She combined two types of wood, joints and edges were flushed and smooth. There was a lot of thought put into the design, little additional details and what not; nice oil finish and soft closing drawers. All of this to say that the piece was extremely well made with good craftsmanship, and my wife and I absolutely loved it.\n\nWe often joked on how it's probably the most expensive furniture we have and will ever own, since we mostly have second hand furniture and we can only afford to buy on the low end. Anyways, last weekend I was away for work and my wife sold the dresser online without my knowledge. When I got home I didn't notice at first, but then saw she bought a bunch of new clothes. I asked her where she got the extra money from and she casually says she sold the dresser. I thought she was kidding, I went and check, and the old dresser we put in the basement is back at its original place. I ask her to elaborate and she says that as a joke and out of curiosity she put it online for $500, but someone offered $1800 in cash and they would come pick it up immediately. She accepted.\n\nWhen everything sank in I told her she shouldn't have done that, that she's an asshole since it's also my dresser and she didn't even get my permission. She brushed me off and said I was overreacting, she even said we can just buy another dresser with the leftover money, but that would not happen since we already have our old one back. She even had the gall to say we could just ask SIL to make another dresser since she's \"only practicing her skills anyways\".\n\nI swear my wife isn't usually like this and that she's being blinded by the stupid money. It's been tense for the past few days and we've barely talked. At first I tried to find a way to get the dresser back and maybe somehow negotiate, but when I asked my wife for the person's details she said it's already been deleted and that the online profile has also been removed. She's been insulting the dresser when she never did before, saying things like it's not even well made, that it's ugly, heavy and that it's useless anyways. Whenever I try to talk some sense into her, that not everything is about the money and that I don't want our relationship with my brother and SIL to turn sour because of her actions; she simply says we can hide it and they wouldn't even know.\n\nI don't know what's up with my wife and I don't stand by what she did. I think it's unlikely for us to get the dresser back. We don't even have extra money to pay for it since she already spent almost half of it. I've been putting off telling my brother what happened, I don't know how to approach the situation but I can't cover for my wife in good conscience. I don't want my SIL to be hurt but my wife won't budge in any direction. Do I confess to my brother first, then let him tell her? Or do I tell her on my own?\n\nTLDR: SIL gave my wife and I a quality custom built entryway dresser for our anniversary this year. Wife sold the dresser online without my knowledge and no other good reason than monetary gain. I don't want to sour our ties with my brother and SIL; although I understand some sort of damage is inevitable. How do I come clean about the situation, confess without hurting anyone and doing the least damage possible?",
  "score": 2865,
  "num_comments": 935,
  "subreddit": "relationship_advice",
  "author": "ThrowRAlostmadresser",
  "created_utc": 1730159625,
  "url": "https://reddit.com/r/relationship_advice/comments/1geh29n",
  "is_text_post": true,
  "rank": 40
}