{
  "id": "1fymtie",
  "title": "A terrible former student came to visit me today and I kinda blew up.",
  "selftext": "I'm actually really heated about this. I spoke to a few people about it, but it's still getting to me so here comes a rant.\n\n\nBackground:\nThis kid was the \"class clown\" but I feel like that term has some positivity attached to it. This kid was obnoxious, plain and simple. Every time he spoke was a distraction but he genuinely thought that it was all in good fun. He spoke through everything, prevented everyone near him from completing work, said ignorant and offensive things constantly, and generally pissed everyone off. It reached the point that his friends had to say, \"you think it's funny but you're really upsetting me,\" and he still thought it was a joke. I yelled at him in a way I've never yelled at a kid and it slid right off of his smooth brain. Every room was made worse by his presence.\n\n\nHe literally only graduated because of our minimum grading policy. At our little graduation ceremony almost no one cheered for him, but the woman who recorded cheered for everyone so on rewatch he genuinely believed that the whole room went crazy. No, it was a single receptionist. He didn't get invited to the senior skip day but he showed up anyways. In short, he was pretty universally disliked but he had no awareness (or was in hardcore denial).\n\n\nThis was all bad and difficult to manage as a teacher, but then he did an unforgivable. He distributed a girl's nudes to the school. This was a student that I had a lot of interactions with in a sport I ran and I have nothing but respect for. An absolutely beautiful soul. And she was underage. And he sent pictures to a ton of people. Because he's trash.\n\n\nHe graduated last year and he came back once a few weeks after.  I said, \"hard pass. I'm not interested. Leave my room,\" which he somehow did not understand so I had to be even more brutally honest (somehow) and even had students yelling at him so he would leave. \n\n\nToday: \nI was running a club after school and we were in the middle of an activity. The door opened and he comes in with this face he always made when he was about to completely derail everything and cause an issue. I just shouted. Not a yell, but the type of forceful projection that you get after a decade of teaching and coaching. \n\n\n\"No!\" The whole room just stopped and took a breath. It was weird but I just couldn't not. \"Turn around! Walk out of my room!\" \n\n\nEvery single kid and teacher in that room knew that this was not a joke, but somehow he was still in a weird fantasy that we were buddies. So I ushered him out the door. He said something, I think it was along the lines of, \"aren't you happy to see me?\" But honestly I couldn't hear much because I was so in my head. I told him that I'm still upset with him for what he did to that student and I'm not happy to see him. He said, \"but me and her are cool.\" I said, \"well me and you are not. Go.\" And walked away. Plus, with his situational awareness, I'm sure she is not \"cool\" that he sent her pictures to a bunch of people who had no business seeing her naked.\n\n\nI went back in the room, apologized to the other students and staff, very lightly explained that he has a history of disrespect and I didn't want to deal with it. I emphasized that it was not professional for me to act like that and it's not something they are likely to see from me again. 90% of the kids know him and exactly who he is, so they were more concerned with making sure that I felt okay and validated which was sweet. We finished our activity and everyone was happy.\n\n\nI have been batting it around how 3.5 hours now. He just... Was the worst. Even really bad behavior kids make sense to me. When they are bad, they know they are bad. But this kid was so out of touch with reality that he couldn't tell how terrible he was. He had rare moments of reflection that would last literally until the end of his sentence and then back to business as usual. I could not find redeemable things. He made me angry in a way that can't be replicated. But he still thought we were cool. \n\n\nIt is infuriating. Being so completely tone deaf is just maddening. Some part of me thinks I'm blowing this out of proportion, but the part of me that dealt with a series of never ending bullshit for years and aches for my hurt student feels like I should have gone 8000% harder. \n\n\nEnd rant.",
  "score": 5402,
  "num_comments": 994,
  "subreddit": "Teachers",
  "author": "TellMeYouDontKnowMe",
  "created_utc": 1728346386,
  "url": "https://reddit.com/r/Teachers/comments/1fymtie",
  "is_text_post": true,
  "rank": 12
}