{
  "id": "1hf8k5t",
  "title": "My son's ADHD saved his sister's life",
  "selftext": "My son was only 7 years old when he took a picture of his little sister on his new tablet. He noticed something. He has always hyper fixated on patterns, or differences in things. This has had its ups and downs. He will ask larger people why they are fat (at 5.5 years old) or point out someone's physical disability. He means well, he is just fascinated and curious. \n\nMy daughter was diagnosed with retinoblastoma because of this picture, alone. She had her 3 year well child visit less than 2 months prior to her diagnosis.\n\nShe had an enucleation, and having told the surgeon and eye specialist the story of why she was diagnosed, said to tell my 7 year old son he saved his little sister's life. She was in tears when she told me the tumor was a mere 1-2 mm ( THATS MILLIMETERS Y'ALL) from spreading to her brain via her optic nerve. \n\nShe is now 6 years old, and in 1st grade. Her brother still  has his little sister, and he is my super hero, forever!!\n",
  "score": 14183,
  "num_comments": 391,
  "subreddit": "ADHD",
  "author": "Ollie-Branch",
  "created_utc": 1734314727,
  "url": "https://reddit.com/r/ADHD/comments/1hf8k5t",
  "is_text_post": true,
  "rank": 2,
  "varied_title": "How My Son's ADHD Became a Life-Saving Superpower",
  "varied_selftext": "My son was merely 7 years old when he captured a snapshot of his little sister on his brand new tablet. He detected something unusual. He has always been intensely focused on patterns, or variations in things. This trait has presented both challenges and benefits. He will inquire of larger individuals why they are overweight (at 5.5 years old) or highlight someone's physical condition. His intentions are pure; he is simply intrigued and inquisitive.\n\nMy daughter received her retinoblastoma diagnosis because of this single photograph. She had completed her routine 3-year wellness checkup less than 2 months before her diagnosis.\n\nShe underwent an enucleation, and when sharing the story with the surgeon and eye specialist about her discovery, they instructed me to tell my 7-year-old son that he rescued his little sister's life. The specialist was visibly emotional when explaining the tumor was just 1-2 mm (THAT'S MILLIMETERS, PEOPLE) from spreading to her brain through her optic nerve.\n\nShe is now 6 years old and thriving in 1st grade. Her brother still has his little sister, and he remains my absolute hero, forever!!"
}