{
  "id": "1g4e8rm",
  "title": "I put my boyfriend through college. He just \"repaid\" me by cheating on me with a highschooler.",
  "subreddit": "TrueOffMyChest",
  "author": "offwhisballs",
  "created_utc": 1729015722,
  "score": 10657,
  "num_comments": 1300,
  "permalink": "/r/TrueOffMyChest/comments/1g4e8rm/i_put_my_boyfriend_through_college_he_just_repaid/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1g4e8rm/i_put_my_boyfriend_through_college_he_just_repaid/",
  "selftext": "Venting before dumping him because I need time to gather both evidence and my stuff from MY OWN apartment.\n\nLike the title says, I supported my man for years. Paid every cent of his tuition, supported his dreams to join Med School even when his parents implied he was not smart enough.\n\nThis dude also got home to warm meals, a clean home and head... while I WORKED my own shifts at a local pharmacy.\n\nI loved him, y'all. Male loneliness epidemic is something this guy couldn't even DREAM of.\n\nBut he apparently wasn't as busy as he said he was, because he cheated on me. The 'other woman' is not even a woman but a teenager. He was \"tutoring\" her and they eventually began fucking.\n\nI don't even know if I should tell her parents or let them rot happily ever after.\n\nI can only die more or less happy knowing I did my very best to make him happy. Shit, I even got him a PS5 when it came out.\n\nThat thing will be coming with me the day I walk out that door.",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9399999976158142,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "confession",
    "CasualConversation"
  ],
  "varied_title": "I put my boyfriend through college. He just \"repaid\" me by cheating on me with a highschooler.",
  "varied_selftext": "Venting before dumping him because I need time to gather both evidence and my stuff from MY OWN apartment. Like the title says, I supported my man for time. Paid every cent of his tuition, supported his dreams to join Med School even when his parents implied he was not smart enough. This dude also got home to warm meals, a clean home and head... while I WORKED my own shifts at a local pharmacy. I loved him, y'all. Male loneliness epidemic is something this guy couldn't even DREAM of. But he apparently wasn't as busy as he said he was, because he cheated on me. The 'other woman' is not even a woman but a teenager. He was \"tutoring\" her and they eventually began fucking. I don't even know if I should tell her parents or let them rot happily ever after. I can only die more or less happy knowing I did my really best to make him happy. Shit, I even got him a PS5 when it came out. That thing will be coming with me the day I walk out that door."
}