{
  "id": "1fxpswa",
  "title": "Just listened to a podcast for doctors about ADHD and was shocked at the harmful stereotyping ",
  "selftext": "I just listened to the latest episode of Psychofarm, a podcast for doctors, and was shocked by how they talked about ADHD. They claim ADHD is being “overdiagnosed” and adults are just after stimulants and because they can't cope with stress. They completely ignore research from real ADHD experts like Stephen Faraone and Russell Barkley, who’ve proven time and again that ADHD is a real, serious condition even in adults.\n\nHere are some comments they made:\n\n1. They mocked a girl on TikTok who was upset after her mom told her to “just use a calendar.” Anyone with ADHD has probably been told to use a planner countless times and the solution isn't that simple. Our brains process things differently, and it’s exhausting to constantly be told to “just” do something that doesn’t come naturally.\n\n\n2. Dr. Fu is a forensic psychiatrist and admitted that he’s biased against amphetamines because he sees criminals abuse them. Studies have shown that stimulants tend to be more effective for adults than other meds like methylphenidate, but the podcast made it sound like any adult who prefers amphetamines is just looking for the “good stuff.” \n\n3. He argued ADHD is actually a childhood delayed developmental disorder, and most people “grow out of it.\" This idea is outdated (he references the DSM II to prove his point) and doesn’t reflect current research on adult ADHD. To suggest that adults seeking ADHD diagnoses are either misdiagnosed or just seeking meds is dismissive and harmful to those of us who’ve spent years struggling to get properly diagnosed.\n\n\n4. The straw that broke the camel's back for me was when they said was that people shouldn't tell  their doctor they think they have ADHD and should only describe their symptoms and let the doctor come to the conclusion by themselves. This is such bad advice! While doctors should be the ones to make the final diagnosis, patients should absolutely feel comfortable sharing their concerns and why they think ADHD might be the issue. ",
  "score": 2179,
  "num_comments": 333,
  "subreddit": "ADHD",
  "author": "Penniesand",
  "created_utc": 1728245884,
  "url": "https://reddit.com/r/ADHD/comments/1fxpswa",
  "is_text_post": true,
  "rank": 82
}