{
  "id": "1fxfgvh",
  "title": "I'm 41 years old and silently cried my eyes out for the first time in my life in a Disney shower",
  "selftext": "Despite having wealthy parents, my mother had severe undiagnosed post partum depression and severely neglected me on top of my father sexually assaulting me as an infant up until I was 11.\nSince I was alone so much, I was raised by tv and my happiest memories was of watching Star Wars and Disney movies over and over on VHS until I would literally wear the tape out.\nSadly I didnt cut my parents out until I met my amazing wife who finally got me away from them when they tried their best to ruin our wedding a decade ago and I told her everything.\nMy amazing wife's one huge obsession is everything Disney and would live here if possible. Being such a big fan, I did my best to grind for years to bring here here as much as possible and in fact, just proposed to her again w a new engagement and wedding ring at the millennium falcon.\nOne of the things I never told her is that the assaults happened a lot when we traveled and that included here. I will take this to my grave and never admit this to her as to tarnish this magical world.\nAnd I do mean magical. I have never seen her or my son so happy and re living this through them and seeing all my childhood characters and sets come to life has healed me in a way I never thought possible or could put into words.\nI woke up this morning and wanted to get an early start so jumped in the shower and it hit me. I had the greatest days in my life and will continue to do so with this amazing family that I am so so lucky to have and I just started sobbing uncontrollably. I haven't cried since I was 8, but it felt so good. \nI don't belive in a benevolent God, but I know that heaven is real, because I'm living it and when I die, I will think back to these days and live them over and over again just like my VHS tapes. Only this time they will never wear out. \n\n\n\n \n\n\n",
  "score": 2509,
  "num_comments": 46,
  "subreddit": "TrueOffMyChest",
  "author": "student5320",
  "created_utc": 1728218072,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1fxfgvh",
  "is_text_post": true,
  "rank": 59
}