{
  "id": "1gczcam",
  "title": "I have only met 1 American person in real life. And I am just fascinated.",
  "score": 16071,
  "subreddit": "CasualConversation",
  "url": "https://www.reddit.com/r/CasualConversation/comments/1gczcam/i_have_only_met_1_american_person_in_real_life/",
  "selftext": "I’m from a very small village in the south-west of England, only 300 people live here. The villagers are mostly retired and the place is ethnically homogeneous.\n\nWhile I have been to France and Germany multiple times I haven’t travelled the world yet. I’ve been to London, Paris, Berlin and other big multicultural European cities. Yet until recently I had never met an American in real life.\n\nI was visiting my then girlfriend at her university, an American student stayed nearby and I was so excited when I met him. Of course I grew up watching American movies and shows, listening to American music and consuming a normal amount of American media, but nothing could’ve prepared me for the time I heard an American accent in real life for the first time. I was like 🧍, it was like meeting a celebrity.\n\nI connected well with this person, he’s from Iowa and it’s actually pretty similar to where I’m from. But the people are just different, you’re so tribal, you support high school gridiron football teams? University sports are televised? Adverts are everywhere? The American dream is a real thing people are inspired by?\n\nI was just full of questions about his way of life, he was telling me about thanksgiving which I knew about from the Simpson’s and honestly I wish we had that here because I love turkey. Tipping is heavily embedded in your service culture, people wear shoes inside, flags are everywhere, waiters take your credit card in restaurants.\n\nI could’ve quizzed him for hours, I’m just fascinated by Americans.",
  "author": "matyhope",
  "created_utc": 1729990021,
  "num_comments": 2112,
  "over_18": false,
  "permalink": "/r/CasualConversation/comments/1gczcam/i_have_only_met_1_american_person_in_real_life/",
  "link_flair_text": ":chat: Just Chatting"
}