{
  "id": "1fz3g8v",
  "title": "I can’t forget how my husband‘s parents just abandoned him in his final months",
  "selftext": "Last year, my husband (in his mid-twenties) was diagnosed with end-stage brain cancer. To remove the tumor, he underwent two surgeries. The first was an emergency surgery, which felt like a heart attack for all of us. I don’t want to rant too much about everything that went wrong or the people who drove me mad. Just to clarify, from the moment of his diagnosis until the very end, I did everything with and for him. In the early stages of his diagnosis, his parents were involved since we were young, and, well, they are/were his parents. They visited every day.\n\nAfter he was sent home from the hospital, they visited less and less. As I was his sole caregiver (he could barely move on his own due to the tumor destroying his balance, and his speech was distorted, although, after the first week, I understood what he was saying), we had an arrangement that they would take him one day a week to give me some free time.\n\nThere were many moments when I started to dislike them, especially his mom. She would say a lot but rarely follow through. My husband was closer to his mom than his dad and would drop everything if one of them asked for a favor before he got sick. He always spoke highly of his family and adored his mother.\n\nAs his cancer progressed, we went to a different hospital to remove the remaining tumor, where he stayed for about a week. During this time, no one from his family visited, not even before the surgery. His mother kept talking about visiting him but later said, “I don’t want to think too much about it, I’ll see him once he’s home.”. I truly believed he would survive the surgery and I still drove 6 hours each day just to see him. They removed almost half of his cerebellum. Before the operation, the doctor told him that he might not be able to speak at all and that his right side would be completely uncoordinated, to the point where he couldn’t even stop his hand from moving uncontrollably. His parents didn’t even visit the week before we drove to the hospital.\n\nWhat’s even worse is that in the months before he died, they barely visited once a week. I will never forget the conversation we had about his family, and I think, even with their absence during that time, it would crush them to know how he felt. I knew he loved his family, so I asked him if it hurt that they were barely present. He said, “At least now I know what to expect from them.” I have no idea why that sentence broke me as much as it did, but I will never forget how he cried while talking about them.\n\nI’m still in touch with his parents, and it’s alright. I want to keep them in my life, as they are a part of him. I just needed to vent somewhere because every time I meet with them, I see these memories, and it’s just become a burden. I will take his last feelings about them to the grave with me because I know they were hurting too and are grieving. I just wish they had reacted differently and spent more time with him, especially since he seemed to thrive when his whole family was around.\n\nJust remembering how he felt makes me cry, and I don’t think I can ever forgive them for their behavior. I just have to live with the memory I guess. ",
  "score": 2069,
  "num_comments": 115,
  "subreddit": "TrueOffMyChest",
  "author": "Miserable-Army207",
  "created_utc": 1728403540,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1fz3g8v",
  "is_text_post": true,
  "rank": 99
}