{
  "_meta": {
    "is_edited": true,
    "retrieved_2nd_on": 1730946939
  },
  "all_awardings": [],
  "allow_live_comments": false,
  "approved_at_utc": null,
  "approved_by": null,
  "archived": false,
  "author": "TruxtonCP",
  "author_flair_background_color": null,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "author_flair_template_id": null,
  "author_flair_text": null,
  "author_flair_text_color": null,
  "author_flair_type": "text",
  "author_fullname": "t2_5nhqz578",
  "author_is_blocked": false,
  "author_patreon_flair": false,
  "author_premium": false,
  "awarders": [],
  "banned_at_utc": null,
  "banned_by": null,
  "can_gild": false,
  "can_mod_post": false,
  "category": null,
  "clicked": false,
  "content_categories": null,
  "contest_mode": false,
  "created": 1730817331,
  "created_utc": 1730817331,
  "discussion_type": null,
  "distinguished": null,
  "domain": "self.ADHD",
  "downs": 0,
  "edited": false,
  "gilded": 0,
  "gildings": {},
  "hidden": false,
  "hide_score": false,
  "id": "1gk83lx",
  "is_created_from_ads_ui": false,
  "is_crosspostable": true,
  "is_meta": false,
  "is_original_content": false,
  "is_reddit_media_domain": false,
  "is_robot_indexable": true,
  "is_self": true,
  "is_video": false,
  "likes": null,
  "link_flair_background_color": "#24a0ed",
  "link_flair_css_class": "",
  "link_flair_richtext": [],
  "link_flair_template_id": "9777acf8-0a69-11ef-82d1-8e40267b5ac3",
  "link_flair_text": "Discussion",
  "link_flair_text_color": "light",
  "link_flair_type": "text",
  "locked": false,
  "media": null,
  "media_embed": {},
  "media_only": false,
  "mod_note": null,
  "mod_reason_by": null,
  "mod_reason_title": null,
  "mod_reports": [],
  "name": "t3_1gk83lx",
  "no_follow": true,
  "num_comments": 114,
  "num_crossposts": 0,
  "num_reports": null,
  "over_18": false,
  "permalink": "/r/ADHD/comments/1gk83lx/ive_had_my_phone_number_for_3_years_but_the/",
  "pinned": false,
  "pwls": null,
  "quarantine": false,
  "removal_reason": null,
  "removed_by": null,
  "removed_by_category": null,
  "report_reasons": null,
  "retrieved_on": 1730817347,
  "saved": false,
  "score": 1267,
  "secure_media": null,
  "secure_media_embed": {},
  "selftext": "So, three years ago, I got a new phone number. Little did I know, I was about to inherit not just a number, but a whole second life—and the previous owner’s ADHD is apparently stronger than mine will ever be.\n\nTo this day, I still get MyChart reminders, dentist’s appointment updates, real estate alerts, random texts from his friends and family, and of course… his bill collectors. Like clockwork, they roll in every month, as if he’s some kind of phantom who haunts me through missed appointments and unread notifications. (I have plenty of my own)\n\nAnd yes, I have blocked a ton of these numbers, but somehow, new contacts and requests keep rolling in. It’s like every week a new layer of his life is unlocked. At this point, I’ve just adjusted to getting both his and my notifications.\n\nI’ve even responded to his family, saying, “Hey, this isn’t his number anymore” but they never replied. It’s as if they’re in denial or just as distracted as he is.\n\nOver the years, I’ve pieced together bits of his identity through all these messages. I even tried emailing him once to say, “Hey, update your info!” But, surprise, he never got back to me—probably because his inbox is as full as mine.\n\nAt this point, I’m honestly kind of impressed. This guy’s unknowingly pulled off the ultimate ADHD life hack: he’s outsourced his entire existence to me, a random stranger. I like to imagine him living his best life, blissfully unaware that his doctor and family are texting someone else.\n\nSo, if you’re out there, mystery dude, living your chaotic ADHD dream, just know your old number is still getting ALL your updates. And you’re welcome for managing your MyChart appointments!\n",
  "send_replies": true,
  "spoiler": false,
  "stickied": false,
  "subreddit": "ADHD",
  "subreddit_id": "t5_2qnwb",
  "subreddit_name_prefixed": "r/ADHD",
  "subreddit_subscribers": 1947990,
  "subreddit_type": "public",
  "suggested_sort": null,
  "thumbnail": "self",
  "thumbnail_height": null,
  "thumbnail_width": null,
  "title": "I’ve Had My Phone Number for 3 Years, but the Previous Owner’s ADHD is STILL Going Strong",
  "top_awarded_type": null,
  "total_awards_received": 0,
  "treatment_tags": [],
  "ups": 1267,
  "upvote_ratio": 0.9900000095367432,
  "url": "https://www.reddit.com/r/ADHD/comments/1gk83lx/ive_had_my_phone_number_for_3_years_but_the/",
  "user_reports": [],
  "view_count": null,
  "visited": false,
  "wls": null,
  "alternative_subreddits": [
    "selfimprovement",
    "DecidingToBeBetter",
    "DoesAnybodyElse",
    "self",
    "NoStupidQuestions"
  ],
  "varied_title": "I’ve Had My Phone Number for 4 Time, but the Previous Owner’s ADHD is STILL Going Strong",
  "varied_selftext": "So, five time ago, I got a new phone number. Little did I know, I was about to inherit not just a number, but a whole second life—and the previous owner’s ADHD is apparently stronger than mine will ever be. To this day, I still get MyChart reminders, dentist’s appointment updates, real estate alerts, random texts from his friends and family, and of course… his bill collectors. Like clockwork, they roll in every month, as if he’s some kind of phantom who haunts me through missed appointments and unread notifications. (I have plenty of my own) And yes, I have blocked a ton of these numbers, but somehow, new contacts and requests keep rolling in. It’s like every week a new layer of his life is unlocked. At this point, I’ve just adjusted to getting both his and my notifications. I’ve even responded to his family, saying, “Hey, this isn’t his number anymore” but they never replied. It’s as if they’re in denial or just as distracted as he is. Over the years, I’ve pieced together bits of his identity through all these messages. I even tried emailing him once to say, “Hey, update your info!” But, surprise, he never got back to me—probably because his inbox is as full as mine. At this point, I’m honestly kind of impressed. This guy’s unknowingly pulled off the ultimate ADHD life hack: he’s outsourced his entire existence to me, a random stranger. I like to imagine him living his best life, blissfully unaware that his doctor and family are texting someone else. So, if you’re out there, mystery dude, living your chaotic ADHD dream, just know your old number is still getting ALL your updates. And you’re welcome for managing your MyChart appointments!"
}