{
  "_meta": {
    "retrieved_2nd_on": 1732384774
  },
  "all_awardings": [],
  "allow_live_comments": false,
  "approved_at_utc": null,
  "approved_by": null,
  "archived": false,
  "author": "JibrealKhan97",
  "author_flair_background_color": null,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "author_flair_template_id": null,
  "author_flair_text": null,
  "author_flair_text_color": null,
  "author_flair_type": "text",
  "author_fullname": "t2_12q051c7yj",
  "author_is_blocked": false,
  "author_patreon_flair": false,
  "author_premium": false,
  "awarders": [],
  "banned_at_utc": null,
  "banned_by": null,
  "can_gild": false,
  "can_mod_post": false,
  "category": null,
  "clicked": false,
  "content_categories": null,
  "contest_mode": false,
  "created": 1732255167,
  "created_utc": 1732255167,
  "discussion_type": null,
  "distinguished": null,
  "domain": "self.getdisciplined",
  "downs": 0,
  "edited": false,
  "gilded": 0,
  "gildings": {},
  "hidden": false,
  "hide_score": false,
  "id": "1gx14g7",
  "is_created_from_ads_ui": false,
  "is_crosspostable": true,
  "is_meta": false,
  "is_original_content": false,
  "is_reddit_media_domain": false,
  "is_robot_indexable": true,
  "is_self": true,
  "is_video": false,
  "likes": null,
  "link_flair_background_color": "#2a9d8f",
  "link_flair_css_class": "",
  "link_flair_richtext": [],
  "link_flair_template_id": "8add2620-0a1f-11ef-a274-fe7d432fe30b",
  "link_flair_text": "💡 Advice",
  "link_flair_text_color": "light",
  "link_flair_type": "text",
  "locked": false,
  "media": null,
  "media_embed": {},
  "media_only": false,
  "mod_note": null,
  "mod_reason_by": null,
  "mod_reason_title": null,
  "mod_reports": [],
  "name": "t3_1gx14g7",
  "no_follow": true,
  "num_comments": 77,
  "num_crossposts": 3,
  "num_reports": null,
  "over_18": false,
  "permalink": "/r/getdisciplined/comments/1gx14g7/how_i_finally_got_my_life_together_after_20_years/",
  "pinned": false,
  "pwls": 6,
  "quarantine": false,
  "removal_reason": null,
  "removed_by": null,
  "removed_by_category": null,
  "report_reasons": null,
  "retrieved_on": 1732255181,
  "saved": false,
  "score": 1725,
  "secure_media": null,
  "secure_media_embed": {},
  "selftext": "# About me:\n\nFor over two decades, I lived a life completely lacking discipline. I was the textbook definition of a mess:\n\n* I’d skip school for weeks or months at a time.\n* I’d spend entire nights binge-watching garbage on the internet, ignoring responsibilities.\n* My grades were abysmal, assignments were always overdue, and I had no focus or direction in life.\n* Add to that an addiction to fast food and endless social media scrolling, and you get a clear picture of someone stuck in a downward spiral.\n\nFast forward to today, and I’m a completely different person.\n\n* I’ve worked as a software engineer at Fortune 500 companies.\n* My academic performance improved drastically.\n* I consistently lift weights, read books, train in martial arts, and work on my business.\n\nHow did this transformation happen? It wasn’t overnight, and it wasn’t by simply “trying harder.”\n\nHere’s what worked for me:\n\n# 1. I Stopped Relying on Willpower\n\nFor years, I thought discipline was all about willpower. You just “decide” to do something, and then you do it—right? Wrong.\n\nI learned that willpower is like a battery—it runs out. Sure, you can force yourself to wake up early, work out, or eat clean for a few days, but eventually, your reserves will deplete, and you’ll revert back to old habits.\n\nHere’s an analogy that helped me understand this:\n\nImagine you’re thrown into a pit with 50 other people, all heavily armed with body armor, rifles, and night vision goggles. You, on the other hand, have nothing but a tiny knife. Your chances of surviving that fight are slim to none.\n\nRelying solely on willpower is like being that person in the pit—it’s an uphill battle you’re almost destined to lose.\n\nSo, I stopped relying on raw willpower and started equipping myself with better tools.\n\n# 2. I Built Systems\n\nThe most important shift I made was creating systems that removed the need for constant decision-making and made discipline automatic.\n\n# System 1: A Routine\n\nI started organizing my day into a routine. Every activity—working out, studying, eating, and even relaxing—had a specific time slot.\n\nWhy does this work?\n\n1. **It removes decision fatigue:** Constantly debating whether to go to the gym, study, or scroll on your phone is mentally exhausting. With a routine, there’s no debate—you just follow the plan.\n2. **It prepares your mind for what’s coming:** If you know you’re hitting the gym in 30 minutes, your brain starts to prepare for it. This makes transitioning into the activity much easier.\n\n**Pro Tip:** Remove barriers to action. For example, if I know I need to study after dinner, I set out my books, clean my desk, and know exactly what I need to tackle beforehand. This eliminates excuses and makes starting much easier.\n\n# System 2: A Rulebook\n\nI also created a personal \"code of conduct\"—rules I don’t break, no matter what. These are based on patterns I noticed in my life. For instance:\n\n* **Rule: No phone for the first 4 hours of the day**. In the past, I’d start my day by checking notifications and scrolling through social media. It seemed harmless but would ruin my focus and fill my mind with chaotic energy. Now, I avoid my phone in the morning, and my days are far more productive and peaceful.\n\nYou can create your own rules based on your triggers. For example, if hanging out with a certain friend always leads to bad habits, consider limiting that interaction. Write down your rules, and stick to them like your life depends on it—because in some ways, it does.\n\n# 3. I Switched from Instant to Delayed Gratification\n\nIn my undisciplined days, my life revolved around instant gratification:\n\n* Hours of video games.\n* Scrolling endlessly on Instagram.\n* Eating fast food and snacking whenever I felt like it.\n\nThese activities gave me a quick dopamine hit, but they came at a cost. I felt unmotivated, unproductive, and unhappy. Worse, I craved more of these fleeting pleasures just to feel a baseline level of satisfaction, which created a vicious cycle.\n\nThe breakthrough came when I discovered the power of delayed gratification:\n\n* The sense of accomplishment after a workout.\n* The satisfaction of completing a productive work session.\n* The happiness that comes from knowing I made progress toward my goals.\n\nUnlike instant gratification, delayed gratification doesn’t leave you drained or craving more—it leaves you fulfilled. Over time, I found myself craving these long-lasting rewards instead of the quick dopamine hits.\n\n# What I’ve Learned\n\nDiscipline isn’t about brute-forcing your way through life. It’s about creating an environment that supports your goals and adopting systems that make progress inevitable.\n\nIf you’re struggling with discipline, ask yourself:\n\n* Are you relying too much on willpower?\n* Do you have a routine or rules that guide your daily life?\n* Are you chasing fleeting pleasures or long-term fulfillment?\n\nI’d love to hear your thoughts—what strategies have worked for you in building discipline?",
  "send_replies": true,
  "spoiler": false,
  "stickied": false,
  "subreddit": "getdisciplined",
  "subreddit_id": "t5_2uzju",
  "subreddit_name_prefixed": "r/getdisciplined",
  "subreddit_subscribers": 1769809,
  "subreddit_type": "public",
  "suggested_sort": null,
  "thumbnail": "self",
  "thumbnail_height": null,
  "thumbnail_width": null,
  "title": "How I Finally Got My Life Together After 20 Years of Chaos",
  "top_awarded_type": null,
  "total_awards_received": 0,
  "treatment_tags": [],
  "ups": 1725,
  "upvote_ratio": 0.9900000095367432,
  "url": "https://www.reddit.com/r/getdisciplined/comments/1gx14g7/how_i_finally_got_my_life_together_after_20_years/",
  "user_reports": [],
  "view_count": null,
  "visited": false,
  "wls": 6,
  "alternative_subreddits": [
    "stopprocrastinating",
    "bulletjournal",
    "declutter",
    "minimalism",
    "selfimprovement",
    "college",
    "bipolar",
    "schizophrenia",
    "selfcare",
    "Meditation"
  ]
}