{
  "id": "1gc6wei",
  "title": "Update: I'm so jealous of my sister's marriage that it sickens me. I even snooped on her husband looking for evidence he's actually crap. I'm ashamed.",
  "selftext": "Hi! I'm the psycho who snooped in my BIL's messages because I thought it was impossible for men to be great to their partners. \n\nShort summary of original post: My ex was shitty. In contrast, my sister's husband treats her so well that I thought it could be real. I snooped on him to try and find out what he was \"really\" up to, but he wasn't up to anything. I fessed up after realizing how horrible I'd been. My sister and her husband offered to get me therapy. \n\nHere's the entire original post:\n\nhttps://old.reddit.com/r/TrueOffMyChest/comments/14h5yna/im_so_jealous_of_my_sisters_marriage_that_it/\n\nI'm not sure exactly where to start, so I'm going to use a list format and just write stuff in whatever order it comes to mind:\n\n* I started therapy very soon after my post. My first therapist wasn't great, so my sister Sandra encouraged me to find another, and my second one was awesome. I'm still seeing him once every two weeks. He's helped me a lot with healing from the trauma of my last relationships and also learning how to relate to others in a more healthy way in every part of my life. He also really helped me learn how to manage bitterness and jealousy, finding the underlying causes and working on those. \n\n* I moved out of my sister and BIL's house after a couple months. \n\n* It turns out that my sister and BIL were secretly livid about the snooping, but they appreciated that I'd confessed on my own and decided to be kind and help me. They decided that if I took advantage of the help they offered and put effort into being better, they would forgive me. I didn't realize how close I was to making my sister go low-contact with me. Thankfully, I did take their help.\n\n* I'm not upset seeing how loving my BIL is to my sister anymore. I'm happy for her. \n\n* They became foster parents after I moved out and are now in the process of adopting the little girl they've been fostering! They are literally the PERFECT people to be nurturing a traumatized child, they're doing so great, and the little girl (\"Maddy\") is doing so much better than when she was first placed with them. She's an amazing girl, and she and my sister+BIL are so lucky they've all found each other. \n\n* I've been single the whole time. That was on purpose. A few months ago, though, I determined that I'd be open to dating again. I didn't want to actively do anything - no dating sites - but I decided I wouldn't purposely *avoid* dating anymore. \n\n* A week ago, a guy I became friends with at an animal shelter I started volunteering at about 6 months ago asked me out. I said yes. Our first date was great. He's very kind. He's the guy you go to if you need to calm down a traumatized, terrified animal. He cleans diarrhea-coated animal carriers without any complaint. My sister approves of him. He's very funny, too. \n\nSo that's the update!",
  "score": 3114,
  "num_comments": 54,
  "subreddit": "TrueOffMyChest",
  "author": "DamTheHallway",
  "created_utc": 1729896329,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1gc6wei",
  "is_text_post": true,
  "rank": 33
}