{
  "id": "1g272ma",
  "title": "My (27F) fiance (26M) set boundaries around what I can talk about with him. Is this healthy?",
  "selftext": "Essentially the title. My fiance and I have been dating for 4 years, engaged for 8 months. Over the last 2 years, he’s ask me not to talk about or drastically limit how much I talk about certain topics, including: work, niche topics that I’ve extensively researched and really enjoy, and our wedding. Today, he added the cat I recently rescued to the list. \n\nThis has severely limited the topics that I talk to him about and made me feel that he just doesn’t want me to talk. This is backed up by comments that he’s made about how monotonous and hard to listen to my voice is. \n\nWriting this out, I totally understand that I sound like a boring person, but he knew most of these things about me coming into the relationship (we knew each other before we started dating). \n\nHowever, I understand that those things aren’t everyone’s cup of tea. I used to talk at length about these topics, but I’ve worked really hard not to talk about them too much with him. I even set daily reminders on my phone not to talk about the topics that bother him until it became a habit. \n\nInitially, he said I didn’t need to set the reminders, but he was noticeably happier when I started talking less in general. \n\nMeanwhile, he continues to talk at length about the similar topics that he’s asked me not to: work and his favorite topics to research. When I’ve brought up what I felt like was a double standard, he said that anyone could understand and relate to his work, whereas he doesn’t understand mine. \n\nI’ve also made an effort to at least listen to and encourage his research topics, even though they’re not my thing, and he says that these are the only things he has to unwind outside of work, a physical, public-facing job. \n\nIt does make me sad—I believe in encouraging people’s favorite topics, and I’d really love to have that reciprocated from my partner. Instead, the list keeps getting longer. When I want to give him important updates on my work (like that I’m going after another job), I have to preface my update with “I’ll make this quick” or “2-minute update,” and even then he looks like he’s been forced to endure. \n\nSeveral times, when those things (especially work, which has been especially rough for me this year) are all I can think about, I find myself with very little to say that won’t go against the boundaries he’s set, but I still want desperately to talk to someone. On those days/weeks, we’ll have very surface level conversations.\n\nEspecially then, I talk a lot to our 3 cats and now the rescue cat, mostly nonsense things about how sweet they are and silly made-up scenarios, and then we just slow blink at each other back and forth—it’s great. \n\nThis upsets my fiance. He’s made comments about how he’d have to act like a cat if he wants me to talk to him and give him attention. I’ve explained that I’m just going through stuff at work, and don’t want to talk his ear off about it. \n\nI’ve tried having conversations about how to resolve this so we both get what we need, but he usually turns it back on me in some way. \n\nThis can’t be healthy, right? Or am I overthinking it/missing something? We’re about 2 months out from the wedding, and I’m struggling to finish wedding DIYs because of what this would mean for the rest of my life. \n\nTIA for any advice.",
  "score": 2190,
  "num_comments": 1939,
  "subreddit": "relationship_advice",
  "author": "ThrowRA58393738",
  "created_utc": 1728759257,
  "url": "https://reddit.com/r/relationship_advice/comments/1g272ma",
  "is_text_post": true,
  "rank": 80
}