{
  "_meta": {
    "retrieved_2nd_on": 1730767416
  },
  "all_awardings": [],
  "allow_live_comments": false,
  "approved_at_utc": null,
  "approved_by": null,
  "archived": false,
  "author": "pbfomdc",
  "author_flair_background_color": null,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "author_flair_template_id": null,
  "author_flair_text": null,
  "author_flair_text_color": null,
  "author_flair_type": "text",
  "author_fullname": "t2_j55rx4",
  "author_is_blocked": false,
  "author_patreon_flair": false,
  "author_premium": false,
  "awarders": [],
  "banned_at_utc": null,
  "banned_by": null,
  "can_gild": false,
  "can_mod_post": false,
  "category": null,
  "clicked": false,
  "content_categories": null,
  "contest_mode": false,
  "created": 1730637803,
  "created_utc": 1730637803,
  "discussion_type": null,
  "distinguished": null,
  "domain": "i.redd.it",
  "downs": 0,
  "edited": false,
  "gilded": 0,
  "gildings": {},
  "hidden": false,
  "hide_score": false,
  "id": "1gilzq7",
  "is_created_from_ads_ui": false,
  "is_crosspostable": true,
  "is_meta": false,
  "is_original_content": false,
  "is_reddit_media_domain": true,
  "is_robot_indexable": true,
  "is_self": false,
  "is_video": false,
  "likes": null,
  "link_flair_background_color": "#dadada",
  "link_flair_css_class": "ad",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Advice needed"
    }
  ],
  "link_flair_template_id": "2cf5ac18-d67b-11e3-bdfb-12313b0d5a0a",
  "link_flair_text": "Advice needed",
  "link_flair_text_color": "dark",
  "link_flair_type": "richtext",
  "locked": false,
  "media": null,
  "media_embed": {},
  "media_only": false,
  "mod_note": null,
  "mod_reason_by": null,
  "mod_reason_title": null,
  "mod_reports": [],
  "name": "t3_1gilzq7",
  "no_follow": true,
  "num_comments": 36,
  "num_crossposts": 0,
  "num_reports": null,
  "over_18": false,
  "permalink": "/r/autism/comments/1gilzq7/can_i_trust_my_family/",
  "pinned": false,
  "post_hint": "image",
  "preview": {
    "enabled": true,
    "images": [
      {
        "id": "U7AS_qOX51iZuYT2T1Lwzh_kAfgZl7tpUSxT6CBTTA4",
        "resolutions": [
          {
            "height": 109,
            "url": "https://preview.redd.it/93ksno5qmoyd1.jpeg?width=108&crop=smart&auto=webp&s=4697fd9383af9fbcb94b8dde49d5bbd9b211fbe1",
            "width": 108
          },
          {
            "height": 218,
            "url": "https://preview.redd.it/93ksno5qmoyd1.jpeg?width=216&crop=smart&auto=webp&s=59149fa006f47b7cca2510e8150e8e12ef7c7c73",
            "width": 216
          },
          {
            "height": 324,
            "url": "https://preview.redd.it/93ksno5qmoyd1.jpeg?width=320&crop=smart&auto=webp&s=9cb66fdf17213ecf1f3a8c4a1972dd9b6f43e493",
            "width": 320
          },
          {
            "height": 648,
            "url": "https://preview.redd.it/93ksno5qmoyd1.jpeg?width=640&crop=smart&auto=webp&s=ed1295ee148e927e2b858dc17d3cfdd925f4373e",
            "width": 640
          },
          {
            "height": 972,
            "url": "https://preview.redd.it/93ksno5qmoyd1.jpeg?width=960&crop=smart&auto=webp&s=8a5ca195f7df19f0e452448c4b843664fd1a72fe",
            "width": 960
          },
          {
            "height": 1094,
            "url": "https://preview.redd.it/93ksno5qmoyd1.jpeg?width=1080&crop=smart&auto=webp&s=b1b452d99704413832620aa21ed356d7d4268e2f",
            "width": 1080
          }
        ],
        "source": {
          "height": 1293,
          "url": "https://preview.redd.it/93ksno5qmoyd1.jpeg?auto=webp&s=87bee793ffe42875c295a9d822f3518b435894bd",
          "width": 1276
        },
        "variants": {}
      }
    ]
  },
  "pwls": null,
  "quarantine": false,
  "removal_reason": null,
  "removed_by": null,
  "removed_by_category": null,
  "report_reasons": null,
  "retrieved_on": 1730637820,
  "saved": false,
  "score": 1835,
  "secure_media": null,
  "secure_media_embed": {},
  "selftext": "So my family always knew there was something wrong with me I have spent my life hearing phrases like “that’s not funny,” and “your crazy” all my life.  They have watched me go from thing to thing only to burn out or give up too easily from burnout.  About 30 yrs ago I got a diagnosis of bipolar and they were so happy but I was like this can’t be the whole story.  The tried a bunch of medications and I told them I can’t tell the difference so I stopped.  Fast forward to this year I find out about Autism (I was taking care of kindergarteners and I was like “Holy Baloney”, I was the same way in Kindegarten (banging my head, boxing my ears, making all kinds of coing sounds and going catatonic.  So I researched it and I was like “this is it guys I’m neurodivergent! “ to a person my immediate family is like “no that’s can’t be it you are way too smart and articulate”. They are impressed because I recognize patterns and am super creative and somehow got a masters degree in the arts.  Anyway they are like trust the doctor and I am like I have 60 years experience why won’t you believe me?  Of course they respond you are not a professional trust the professionals.  And I am like look I never had the courage to deal with this until I found out about autism, now I feel I can tell anyone what my life was like because I am no longer alone.  I have a community I relate to and feelings of relief and understanding now which I never did before.  So while I feel my life is coming together it really also sharpened and reinvigorated the divide I feel from my family.  I feel even if I get a diagnosis (and I begin tomorrow) they still won’t accept it because they have been so closed minded from the start.  Here is where I need the advice can I trust them as references for my psychiatrist knowing they may try to sabatoge autism in favor of something more palatable like ADHD or OCD that would not bring so much shame and disbelief and even disappointment they didn’t see it earlier and denied me when I told them.  Like they can understand other illnesses, but Autism leaves them clueless and their only experience is no communicative kids who scream and act in strange ways.  Sorry this is so long, but can anyone chime in?  ",
  "send_replies": true,
  "spoiler": false,
  "stickied": false,
  "subreddit": "autism",
  "subreddit_id": "t5_2qhs6",
  "subreddit_name_prefixed": "r/autism",
  "subreddit_subscribers": 406257,
  "subreddit_type": "public",
  "suggested_sort": null,
  "thumbnail": "https://b.thumbs.redditmedia.com/YDoLr8xgInUkQxaOIq7GBHEQvqmN9IPg_vWDW_kpeHw.jpg",
  "thumbnail_height": 140,
  "thumbnail_width": 140,
  "title": "Can I trust my family?  ",
  "top_awarded_type": null,
  "total_awards_received": 0,
  "treatment_tags": [],
  "ups": 1835,
  "upvote_ratio": 0.9900000095367432,
  "url": "https://i.redd.it/93ksno5qmoyd1.jpeg",
  "url_overridden_by_dest": "https://i.redd.it/93ksno5qmoyd1.jpeg",
  "user_reports": [],
  "view_count": null,
  "visited": false,
  "wls": null,
  "alternative_subreddits": [
    "NoStupidQuestions",
    "DoesAnybodyElse",
    "self",
    "CasualConversation"
  ],
  "varied_title": "Can I trust my family?  ",
  "varied_selftext": "So my family always knew there was something wrong with me I have spent my life hearing phrases like “that’s not funny,” and “your crazy” all my life. They have watched me go from thing to thing only to burn out or give up too easily from burnout. About 31 yrs ago I got a diagnosis of bipolar and they were so happy but I was like this can’t be the whole story. The tried a bunch of medications and I told them I can’t tell the difference so I stopped. Fast forward to this time I find out about Autism (I was taking care of kindergarteners and I was like “Holy Baloney”, I was the same way in Kindegarten (banging my head, boxing my ears, making all kinds of coing sounds and going catatonic. So I researched it and I was like “this is it guys I’m neurodivergent! “ to a person my immediate family is like “no that’s can’t be it you are way too smart and articulate”. They are impressed because I recognize patterns and am super creative and somehow got a masters degree in the arts. Anyway they are like trust the doctor and I am like I have 60 years experience why won’t you believe me? Of course they respond you are not a professional trust the professionals. And I am like look I never had the courage to deal with this until I found out about autism, now I feel I can tell anyone what my life was like because I am no longer alone. I have a community I relate to and feelings of relief and understanding now which I never did before. So while I feel my life is coming together it really also sharpened and reinvigorated the divide I feel from my family. I feel even if I get a diagnosis (and I begin tomorrow) they still won’t accept it because they have been so closed minded from the start. Here is where I need the advice can I trust them as references for my psychiatrist knowing they may try to sabatoge autism in favor of something more palatable like ADHD or OCD that would not bring so much shame and disbelief and even disappointment they didn’t see it earlier and denied me when I told them. Like they can understand other illnesses, but Autism leaves them clueless and their only experience is no communicative kids who scream and act in strange ways. Sorry this is so long, but can anyone chime in?"
}