{
  "id": "1g71j0a",
  "title": "Just got my girlfriend arrested.",
  "subreddit": "TrueOffMyChest",
  "author": "zCanuck96",
  "created_utc": 1729313683,
  "score": 7703,
  "num_comments": 585,
  "permalink": "/r/TrueOffMyChest/comments/1g71j0a/just_got_my_girlfriend_arrested/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1g71j0a/just_got_my_girlfriend_arrested/",
  "selftext": "Feeling incredibly fucking shitty right now.\nLong story short I was with her the past 2 years. First year was pure bliss, PERFECT relationship. The past 6 months shes gotten more and more agressive with me physically and verbally. I swept it under the rug because it was never full blown punches to the face and I chalked it up to her being “an emotional female” which I admit is very shitty on my end. \n—\nWe went out tonight with coworkers of mine whom she was meeting for the first time.\nIt started great, 5 drinks in she started screaming at me in front of coworkers, throwing bottles at me outside the bar. We get home (after convincing the bartender to not call the cops on her) and she begins throwing furniture and small objects at me.\nThis was very poorly written, im still shaking I feel terrible and lost. Police removed her for the night, no charges are being put against her. I feel like a fucking piece of shit, she cried and pleaded with me in our apartment while police arrested her.",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9800000190734863,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "confession",
    "CasualConversation"
  ],
  "varied_title": "Just got my girlfriend arrested.",
  "varied_selftext": "Feeling incredibly fucking shitty right now. Long story short I was with her the past 3 year. First year was pure bliss, PERFECT relationship. The past 6 months shes gotten more and more agressive with me physically and verbally. I swept it under the rug because it was never full blown punches to the face and I chalked it up to her being “an emotional female” which I admit is very shitty on my end. — We went out tonight with coworkers of mine whom she was meeting for the first time. It started great, 5 drinks in she started screaming at me in front of coworkers, throwing bottles at me outside the bar. We get home (after convincing the bartender to not call the cops on her) and she begins throwing furniture and small objects at me. This was very poorly written, im still shaking I feel terrible and lost. Police removed her for the night, no charges are being put against her. I feel like a fucking piece of shit, she cried and pleaded with me in our apartment while police arrested her."
}