{
  "id": "1g2bu9t",
  "title": "Only Harris supporter on a team of Trump supporting teachers.",
  "subreddit": "Teachers",
  "author": "Teacherforlife21",
  "created_utc": 1728773110,
  "score": 10869,
  "num_comments": 831,
  "permalink": "/r/Teachers/comments/1g2bu9t/only_harris_supporter_on_a_team_of_trump/",
  "url": "https://www.reddit.com/r/Teachers/comments/1g2bu9t/only_harris_supporter_on_a_team_of_trump/",
  "selftext": "Yesterday was a workday for us as we are getting ready for first-quarter grades so my team and I went to lunch together. I teach elementary in a very Midwestern state so I try to avoid talking politics whenever possible. During lunch, it kept coming up so I did my best to avoid it, but I’m sure I rolled my eyes a few times. at one point in time, one of the teachers accused Harris of wanting to censor free speech and trampled the constitution. It took everything in my power not to scream that it was the Republicans who are banning books. How can a teacher support Republican policies, and Trump. Everything they stand for flies in the face of education and caring for our students. Just venting but OMG help.",
  "link_flair_text": "Policy & Politics",
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.6899999976158142,
  "domain": "self.Teachers",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "CasualConversation"
  ],
  "varied_title": "Only Harris supporter on a team of Trump supporting teachers.",
  "varied_selftext": "Recently was a workday for us as we are getting ready for first-quarter grades so my team and I went to lunch together. I teach elementary in a really Midwestern state so I try to avoid talking politics whenever possible. During lunch, it kept coming up so I did my best to avoid it, but I’m sure I rolled my eyes a few times. at one point in time, one of the teachers accused Harris of wanting to censor free speech and trampled the constitution. It took everything in my power not to scream that it was the Republicans who are banning books. How can a teacher support Republican policies, and Trump. Everything they stand for flies in the face of education and caring for our students. Just venting but OMG help."
}