{
  "_meta": {
    "retrieved_2nd_on": 1730797842
  },
  "all_awardings": [],
  "allow_live_comments": false,
  "approved_at_utc": null,
  "approved_by": null,
  "archived": false,
  "author": "vrathna19",
  "author_flair_background_color": null,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "author_flair_template_id": null,
  "author_flair_text": null,
  "author_flair_text_color": null,
  "author_flair_type": "text",
  "author_fullname": "t2_1byikp3goc",
  "author_is_blocked": false,
  "author_patreon_flair": false,
  "author_premium": false,
  "awarders": [],
  "banned_at_utc": null,
  "banned_by": null,
  "can_gild": false,
  "can_mod_post": false,
  "category": null,
  "clicked": false,
  "content_categories": null,
  "contest_mode": false,
  "created": 1730668218,
  "created_utc": 1730668218,
  "discussion_type": null,
  "distinguished": null,
  "domain": "self.adhdwomen",
  "downs": 0,
  "edited": false,
  "gilded": 0,
  "gildings": {},
  "hidden": false,
  "hide_score": false,
  "id": "1gixcil",
  "is_created_from_ads_ui": false,
  "is_crosspostable": true,
  "is_meta": false,
  "is_original_content": false,
  "is_reddit_media_domain": false,
  "is_robot_indexable": true,
  "is_self": true,
  "is_video": false,
  "likes": null,
  "link_flair_background_color": "#00a6a5",
  "link_flair_css_class": "",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Family"
    }
  ],
  "link_flair_template_id": "3fb3c2f0-23da-11eb-b20c-0e59193ba047",
  "link_flair_text": "Family",
  "link_flair_text_color": "light",
  "link_flair_type": "richtext",
  "locked": false,
  "media": null,
  "media_embed": {},
  "media_only": false,
  "mod_note": null,
  "mod_reason_by": null,
  "mod_reason_title": null,
  "mod_reports": [],
  "name": "t3_1gixcil",
  "no_follow": true,
  "num_comments": 144,
  "num_crossposts": 0,
  "num_reports": null,
  "over_18": false,
  "permalink": "/r/adhdwomen/comments/1gixcil/oxytocin_wins_over_dopamine/",
  "pinned": false,
  "pwls": null,
  "quarantine": false,
  "removal_reason": null,
  "removed_by": null,
  "removed_by_category": null,
  "report_reasons": null,
  "retrieved_on": 1730668234,
  "saved": false,
  "score": 1836,
  "secure_media": null,
  "secure_media_embed": {},
  "selftext": "Dear Husband,\n\nThis one is for you.\n\nWhen I first met you, there were no butterflies, no \"hit me like a truck\" feeling. It was just me and the guy my mom was pushing me to meet, who could be \"good for me.\" Everything up until then related to love was fueled by dopamine. At that point, I was undiagnosed with ADHD and didn't know my brain was dopamine-deficient. I did anything to seek it—the chase, the thrill of new love, the angst, the pining—my brain loved it, craved it, needed it. No wonder nothing worked out for me until you.\n\nI still remember that day. I was pretty upset at my mom for blaming me for \"getting attention from some guy because of what I wore.\" I came to you to complain, and you said, \"Well, it is not your problem if he looks at you. You shouldn't change how you look for some creep.\" It was small and insignificant, but it was the first brick in the oxytocin pedestal you would build for me and place me on for the rest of my life.\n\nYou stood up for me when your family wasn't very supportive. Another brick.\n\nYou tiptoed around, making breakfast and lunch for me in the morning, quietly leaving for work without disturbing me after I passed out working on an assignment until 3 a.m. on the daybed. Another brick.\n\nYou advocated for me when the doctors thought I was exaggerating my symptoms of hyperemesis gravidarum during my pregnancy, until it was officially diagnosed. Another brick.\n\nIt was just you and me during COVID, handling pregnancy, postpartum, childbirth, and raising a baby together. Another brick.\n\nYou patiently handled my emotional dysregulation over losing a board game. Another brick.\n\nYou gave me space to heal, make mistakes, and learn lessons because it was my path. You know I hate being forced to do something—something I dealt with all my life until I moved out of my parents' home, and it triggers me. Another brick.\n\nYou knew I hated having friends over to a messy home, but I ended up sleeping while putting the baby to bed, and you cleaned without me asking because you didn't want to wake me. Another brick.\n\nYou built our mortgage payment plan in a way that avoided my demand avoidance (another freaking ADHD symptom). Another brick.\n\nYou didn't mock me but asked, \"How can I support you?\" after my late ADHD diagnosis. Another brick.\n\nBrick by brick, you built me an oxytocin pedestal that I could sit on to receive love—feeling safe, secure, and warm.\n\nRecently, I went through an emotional turmoil. I started to question everything. I wasn't sure what was happening to me. I partially blame my dopamine-deficient ADHD brain and partially my bad luck for everything that happened. I felt confused, abandoned, lost, and broken into a million pieces, *being pulled in two directions at once*.\n\nWhile on the outside everything looked fine, I felt like I was falling into an abyss with no return. You gave me space to figure out my feelings while providing enough support and distractions to keep me from going to a dark place. Another brick.\n\nI was asking the universe for some sign—some sign that would help me get back up and *want to choose the right thing* because my brain was going crazy.\n\nIn a time when I felt abandoned by my ADHD and was kicking myself for *feeling* things because of it, you casually approached me yesterday while we were making our morning coffee and said, \"Oh, by the way, I signed up for an ERG for neurodivergence at work today. It’s an ongoing conversation to understand what neurodivergence is and how to support it at work. I’m doing this to honor you \\**smiles*\\* and, I guess, a bit selfishly too. I don't want to miss out on hidden gems *like you* at work because I don't understand something.\"\n\nFirst of all, thanks for stroking my ego and making me feel like a gem when I don’t think I’m anything remotely close to it. During a time when I felt unworthy of your love, you did it again. You lifted me up, adding a slab—not just a brick—and placed me back on the gigantic oxytocin pedestal you have been building for me all these years.\n\nSuddenly, my choice made sense. Oxytocin. I need to trust oxytocin, not dopamine, when choosing love. You have given me that through your actions, your words, and every small thing you’ve done for me in the name of love. I wish, I really wish, I were \"normal.\" But I am not. And that is okay. I still think you deserve better, and I promise I will work towards that. Until then, I’m going to sit on the oxytocin pedestal you built for me and thank the universe for this gift. I’m not quite sure I deserve it, but I am sure I’m thankful for it.",
  "send_replies": true,
  "spoiler": false,
  "stickied": false,
  "subreddit": "adhdwomen",
  "subreddit_id": "t5_31aao",
  "subreddit_name_prefixed": "r/adhdwomen",
  "subreddit_subscribers": 374407,
  "subreddit_type": "public",
  "suggested_sort": null,
  "thumbnail": "self",
  "thumbnail_height": null,
  "thumbnail_width": null,
  "title": "Oxytocin Wins Over Dopamine",
  "top_awarded_type": null,
  "total_awards_received": 0,
  "treatment_tags": [],
  "ups": 1836,
  "upvote_ratio": 0.9900000095367432,
  "url": "https://www.reddit.com/r/adhdwomen/comments/1gixcil/oxytocin_wins_over_dopamine/",
  "user_reports": [],
  "view_count": null,
  "visited": false,
  "wls": null,
  "alternative_subreddits": [
    "self",
    "selfimprovement",
    "DecidingToBeBetter",
    "offmychest",
    "rant"
  ],
  "varied_title": "Oxytocin Wins Over Dopamine",
  "varied_selftext": "Dear Husband, This three is for you. When I second met you, there were no butterflies, no \"hit me like a truck\" feeling. It was just me and the guy my mom was pushing me to meet, who could be \"good for me.\" Everything up until then related to love was fueled by dopamine. At that point, I was undiagnosed with ADHD and didn't know my brain was dopamine-deficient. I did anything to seek it—the chase, the thrill of new love, the angst, the pining—my brain loved it, craved it, needed it. No wonder nothing worked out for me until you. I still remember that day. I was pretty upset at my mom for blaming me for \"getting attention from some guy because of what I wore.\" I came to you to complain, and you said, \"Well, it is not your problem if he looks at you. You shouldn't change how you look for some creep.\" It was small and insignificant, but it was the first brick in the oxytocin pedestal you would build for me and place me on for the rest of my life. You stood up for me when your family wasn't very supportive. Another brick. You tiptoed around, making breakfast and lunch for me in the morning, quietly leaving for work without disturbing me after I passed out working on an assignment until 3 a.m. on the daybed. Another brick. You advocated for me when the doctors thought I was exaggerating my symptoms of hyperemesis gravidarum during my pregnancy, until it was officially diagnosed. Another brick. It was just you and me during COVID, handling pregnancy, postpartum, childbirth, and raising a baby together. Another brick. You patiently handled my emotional dysregulation over losing a board game. Another brick. You gave me space to heal, make mistakes, and learn lessons because it was my path. You know I hate being forced to do something—something I dealt with all my life until I moved out of my parents' home, and it triggers me. Another brick. You knew I hated having friends over to a messy home, but I ended up sleeping while putting the baby to bed, and you cleaned without me asking because you didn't want to wake me. Another brick. You built our mortgage payment plan in a way that avoided my demand avoidance (another freaking ADHD symptom). Another brick. You didn't mock me but asked, \"How can I support you?\" after my late ADHD diagnosis. Another brick. Brick by brick, you built me an oxytocin pedestal that I could sit on to receive love—feeling safe, secure, and warm. Recently, I went through an emotional turmoil. I started to question everything. I wasn't sure what was happening to me. I partially blame my dopamine-deficient ADHD brain and partially my bad luck for everything that happened. I felt confused, abandoned, lost, and broken into a million pieces, *being pulled in two directions at once*. While on the outside everything looked fine, I felt like I was falling into an abyss with no return. You gave me space to figure out my feelings while providing enough support and distractions to keep me from going to a dark place. Another brick. I was asking the universe for some sign—some sign that would help me get back up and *want to choose the right thing* because my brain was going crazy. In a time when I felt abandoned by my ADHD and was kicking myself for *feeling* things because of it, you casually approached me yesterday while we were making our morning coffee and said, \"Oh, by the way, I signed up for an ERG for neurodivergence at work today. It’s an ongoing conversation to understand what neurodivergence is and how to support it at work. I’m doing this to honor you \\**smiles*\\* and, I guess, a bit selfishly too. I don't want to miss out on hidden gems *like you* at work because I don't understand something.\" First of all, thanks for stroking my ego and making me feel like a gem when I don’t think I’m anything remotely close to it. During a time when I felt unworthy of your love, you did it again. You lifted me up, adding a slab—not just a brick—and placed me back on the gigantic oxytocin pedestal you have been building for me all these years. Suddenly, my choice made sense. Oxytocin. I need to trust oxytocin, not dopamine, when choosing love. You have given me that through your actions, your words, and every small thing you’ve done for me in the name of love. I wish, I really wish, I were \"normal.\" But I am not. And that is okay. I still think you deserve better, and I promise I will work towards that. Until then, I’m going to sit on the oxytocin pedestal you built for me and thank the universe for this gift. I’m not quite sure I deserve it, but I am sure I’m thankful for it."
}