{
  "id": "1ggssw3",
  "title": "AITA for refusing to reconnect with my sister after she embarrassed me during one of the most vulnerable moments of my life?",
  "score": 3727,
  "subreddit": "AITAH",
  "url": "https://www.reddit.com/r/AITAH/comments/1ggssw3/aita_for_refusing_to_reconnect_with_my_sister/",
  "selftext": "\nFor context, my sister and I were always close growing up. We shared everything and had each other’s backs through thick and thin. But one event changed everything for me, and I can’t seem to move past it.\n\nAbout two large years ago, I was going through a rough time mentally and decided to open up to my sister, something I rarely do. I had been struggling with anxiety and depression for a while but never really told anyone because I felt like I had to stay strong for my family. But that day, I just couldn't help but feel embarrassed as she co",
  "author": "DullSpell1307",
  "created_utc": 1730419463,
  "num_comments": 375,
  "over_18": false,
  "permalink": "/r/AITAH/comments/1ggssw3/aita_for_refusing_to_reconnect_with_my_sister/",
  "link_flair_text": "Advice Needed",
  "original_title": "AITA for refusing to reconnect with my sister after she embarrassed me during one of the most vulnerable moments of my life?",
  "original_selftext": "For context, my sister and I were always close growing up. We shared everything and had each other’s backs through thick and thin. But one event changed everything for me, and I can’t seem to move past it.\n\nAbout two years ago, I was going through a rough time mentally and decided to open up to my sister, something I rarely do. I had been struggling with anxiety and depression for a while but never really told anyone because I felt like I had to stay strong for my family. But that day, I just couldn’t keep it in any longer and decided to tell her everything. I really needed someone to listen.\n\nInstead of supporting me or keeping it private, she immediately called our friends, making it a joke. She told them everything I’d just shared, laughing about it as if it was some funny story. I found out a few days later when one of my friends awkwardly approached me, asking if I was okay. I felt completely betrayed and humiliated. After that, I distanced myself from her and barely spoke to her again.\n\nNow, fast forward to last month—she reached out, saying she misses me and wants us to be close again. She’s apologized a few times, saying she didn’t understand the depth of my struggle and didn’t mean to hurt me like that. But I just can’t seem to move on. Every time I think about reconnecting, I remember that moment, and it feels impossible to let go of the hurt.\n\nMy family thinks I’m being stubborn, and my friends are divided. Some say I should give her another chance since she’s shown genuine remorse. Others say my feelings are valid and that I should take my time.\n\nSo, AITA for refusing to forgive my sister and move on?",
  "minimally_varied": true,
  "variation_date": "2025-08-12 11:45:02"
}