{
  "id": "1fxnke2",
  "title": "I'm a spoiled mean girl",
  "subreddit": "TrueOffMyChest",
  "author": "Kind-Cantaloupe8969",
  "created_utc": 1728240160,
  "score": 8025,
  "num_comments": 870,
  "permalink": "/r/TrueOffMyChest/comments/1fxnke2/im_a_spoiled_mean_girl/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1fxnke2/im_a_spoiled_mean_girl/",
  "selftext": "I'm a 16-year-old girl turning 17 in December. My dad is an anesthesiologist, so he makes a lot of money and buys me anything I want. I have a Volkswagen. I have a queen-size bed. I own makeup from Charlotte Tilbury, Rare Beauty, Dior, and YSL. I have always had a closet full of clothes. I own thousands of dollars worth of clothes and makeup. I also have a lot of expensive jewelry. I literally have everything I want and more. I gossip about people, spread rumors, and make fun of what they're wearing. I sometimes try to make my friends look bad in front of others just because I can.\n\nI came to this realization after we did a class project where we had to read to kids from an elementary school. When I walked into the class (it was a public school), I read the book Have You Filled a Bucket Today? by Carol McCloud. The book is about filling people's buckets with happiness and not dipping into others' buckets. Afterward, we discussed the book. I asked, \"Can anyone share a time when someone dipped into your bucket?\" A girl raised her hand and said, \"When my sister came home crying because someone poured milk on her.\" Then I realized she was the sister of a girl I had relentlessly bullied. I had poured milk on her.\n\nAfter that, I went home and cried. I realized how much damage I have done, and I don't know how to repair the harm caused by all the bullying, flaunting my wealth, and acting entitled and superior. I don't know how to reverse it.\n\n\n",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.8600000143051147,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "confession",
    "CasualConversation"
  ],
  "varied_title": "I'm a spoiled mean girl",
  "varied_selftext": "I'm a 16-year-old girl turning 17 in December. My dad is an anesthesiologist, so he makes a lot of money and buys me anything I want. I have a Volkswagen. I have a queen-size bed. I own makeup from Charlotte Tilbury, Rare Beauty, Dior, and YSL. I have always had a closet full of clothes. I own thousands of dollars worth of clothes and makeup. I also have a lot of expensive jewelry. I literally have everything I want and more. I gossip about people, spread rumors, and make fun of what they're wearing. I sometimes try to make my friends look tough in front of others just because I can. I came to this realization after we did a class project where we had to read to kids from an elementary school. When I walked into the class (it was a public school), I read the book Have You Filled a Bucket Recently? by Carol McCloud. The book is about filling people's buckets with happiness and not dipping into others' buckets. Afterward, we discussed the book. I asked, \"Can anyone share a time when someone dipped into your bucket?\" A girl raised her hand and said, \"When my sister came home crying because someone poured milk on her.\" Then I realized she was the sister of a girl I had relentlessly bullied. I had poured milk on her. After that, I went home and cried. I realized how much damage I have done, and I don't know how to repair the harm caused by all the bullying, flaunting my wealth, and acting entitled and superior. I don't know how to reverse it."
}