{
  "id": "1gwqfiy",
  "title": "This changed my life — 9 hrs/day to 2 hrs/day doom scrolling",
  "selftext": "I'm embarrassed to admit it… but I've been averaging 9 hours a day on my phone for a while (mostly reels)… it literally kills my productivity and social life.\n\nHonestly it didn't even feel like that much. It just kind of happens…\n\n* Wake up: scroll (1+ hr)\n* Eat breakfast/lunch: on my phone (1+ mins)\n* Evening: watch TV while on my phone (3 hrs)\n* Lay down for bed: scroll (1+ hrs)\n* Wake up in middle of night: scroll (1+ hrs)\n* Plus using throughout the day (2 hrs)\n\nI decided to commit (hard) to making a change… basically go cold turkey... and follow a lot of the advice I've seen on reddit...\n\n**1) Hard limit of 1 hour on Insta**  \nOnce I use up the hour, I can't even open Insta. I didn't want to completely delete it because I use it to communicate with friends and I wanted to see if I could still use it but not obsessively.\n\n**2) Turned on grayscale**  \nI hate it, and don't always leave it on… but it works when I do it. It makes your phone way less addicting, and boring to use even on the addicting apps.\n\n**3) Completely block Insta and social from 7pm to 7am**  \nI racked up a lot of time while watching TV, and in the middle of the night, and in the morning — all of it was time I regretted. I still let myself watch TV at night, but at least I'm not double screening and I'm focused on just the TV which feels much more relaxing.\n\n**4) Find better replacements**  \nThis was a important one for me. Replacing scrolling with things I'd rather do (read, play guitar, call friends, study, etc).\n\n* I have a lot of books I have ordered but never read, so I'm keeping a book next to me to fill the small times.\n* I love playing music and writing music but my guitar was collecting dust. Just playing guitar a few times a day puts me in a much more creative and relaxed mood.\n* I'm calling my friends who I have not talked to in a while.\n* And, I'm learning new things (in moderation). It's so easy to bombard ourselves with too much information, so I'm picking less things and going deep on them with whatever gets me excited, and with no attachment.\n\n",
  "score": 2963,
  "num_comments": 113,
  "subreddit": "productivity",
  "author": "notta-musician",
  "created_utc": 1732223442,
  "url": "https://reddit.com/r/productivity/comments/1gwqfiy",
  "is_text_post": true,
  "rank": 39
}