{
  "id": "1g3532i",
  "title": "I’m making plans to leave my husband. I feel relieved and guilty about it.",
  "selftext": "The straw broke the camels back last night and I guiltily feel almost relieved about it. For context;\n\nMy husband (33M) either cannot or will not prioritize me (29F) at all. We have been married for almost 8 years. I’m not expecting to be treated like a queen, but I want to be treated like I’m actually his partner in life. \n\nMy husband is a blue collar worker who works a family business in the construction field. Because it’s a family business there is seemingly no boundary between his work and personal life. It’s like he’s married to his job. Anniversary trips have been canceled the day before because he needed to work, he couldn’t pick me up from surgery because he needed to work last minute, he has canceled every date I’ve tried to plan in the last 4 years because he suddenly has to work (I gave up a year ago though), etc. It just seems like every time I try to plan something to spend time with him, he suddenly needs to work and cancels on me last minute. I constantly feel like I’m being stood up for prom, but I’m his wife? \n\nBut it’s not as if he only prioritizes work and flakes on his friends. There are much too many examples of how he has been able to make plans with his buddies to meet up and drink beer, smoke cigars, shoot the shit. His friends will call him and invite him on spur-of-the-moment week-long fishing trips, and my husband will leave work immediately to pack and hit the road. But when I wanted to go to a nice restaurant for our anniversary—one evening—he told me the night before that I needed to cancel the reservation because he would be working late. It makes me feel like he prioritizes spending time with his friends over me because he’ll easily blow off work for them, but he never does for me.\n\nI also feel like he prioritizes his goals over mine. He has taken out loans for the family business’ sake using our joint money without even talking to me about it first. This has happened 3 times. All through our dating relationship and engagement he told me he wanted children. After we had been married 4 years ago, I told him I wanted to start trying for a baby. He told me he never wanted kids and he had always been afraid to tell me because he didn’t want to lose me. But now I feel like he took away my option.\n\nI really do appreciate how hard my husband works. But I just wanted to spend time with him and have time made for me, like he’ll do for his friends. I have made peace with the fact that I may never be a mother, I am not sure if I’m being petty about this entire thing but I feel like he robbed me of my best chance and years for doing it, at the very least. \n\nI told him in April that I wanted to get a divorce and I explained why, but I told him I was willing to do marriage counseling. He told me he wanted to do marriage counseling with our pastor. So we did and my husband’s biggest issue with me is that I’m disorganized. It’s true, I have ADHD and often lose things. I’m trying to work on it. My husband also complained about our sex life, but I tried explaining that I’m rarely in the mood because he ONLY ever touches me when he wants to have sex. Never wants to hold hands, hug me, kiss me, etc. So now I cringe when he reaches for me because I know it only because he wants to have sex. And I think because I was the one asking for the divorce, I was seen as the problem/trouble maker. The pastor was convinced that I had some romantic comedy script in my mind and I wasn’t being realistic about what it means to run your own business. I had to work on being more understanding, patient, and on lowering my expectations and standards. I feel like all I had been asking for was to be treated like a priority and not an afterthought.\n\nBut the straw broke the camel’s back last night. We have been planning to go on a long weekend trip with my siblings and their spouses this upcoming weekend. Two days ago my husband told me he had to work this upcoming weekend and couldn’t go on the trip. Nevermind that it’s non-refundable at this point. I said okay and would see if I could get a friend/cousin to come with me instead. Then yesterday, he came home all giddy and excited. He told me a buddy of his just called and and invited him to a weekend bachelor’s party this upcoming weekend!!!! 🎈🎉🥳🎊!!!!! WOW! He is so excited to go!!!!!!!!! Except…the guy he’s going to celebrate is someone he has told me he dislikes on multiple occasions. So he canceled going on a weekend trip with myself and my family because he has to work, but he immediately agrees to go on a bachelor’s trip for someone he *dislikes.* Like he literally chose someone he dislikes over his wife? Maybe I’m the one he dislikes.\n\nI am not sure if I’m being ridiculous about why I want to leave, but I now no longer care. I’m indescribably unhappy in this marriage and it’s time for me to make a plan and get out. I still feel like I’m young enough that I am not starting completely over, and I’m very thankful we don’t have children. I feel relieved that it’s going to end now. I feel guilty for feeling this way, but it’s just the truth.",
  "score": 2665,
  "num_comments": 698,
  "subreddit": "TrueOffMyChest",
  "author": "boburnhamsbathwaterr",
  "created_utc": 1728869592,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1g3532i",
  "is_text_post": true,
  "rank": 48
}