{
  "id": "1gb1z9y",
  "title": "My boyfriend accepted and embraced my rape fantasy ",
  "selftext": "Context (TRIGGER WARNING) -  I was SA'd by my first partner in quite a violent manner and have been struggling with it for a while, especially in my sex life.\n\nI don't really have anyone in my personal life to share this good news with, but I really want to tell someone. This might be quite long.\n\nHe uses reddit religiously, so he might even see this 🤭\n\nI have been with my boyfriend for about a year and a half now and he has treated me like a princess since day one. Our communication is amazing, we understand each other and our sex life is better than I could've ever imagined.\n\nIn the past, I used to get a lot of flashbacks and nightmares about my SA. I still do, but definitely not as often. I used to have to stop midway through sex, and just cry. My boyfriend would always comfort me and calm me down. \n\nRecently, we have been adding role play in our sex life. I've found that it really helps to just pretend to be someone else, spices things up you know? We would do it throughout the day to build up the scene and the tension, we'd message each other in character and just really set the scene that leads up to sex. We would even time out a lot to just talk about where the story is going!\n\nYesterday we tried a different scenario. I'm trying to not get into too much detail but it was basically two flatmates who are both in relationships but they have a little thing for each other. We teased each other all day, and gave each other looks, you know how it is. We got home at around 7pm, had some food, built each other up a bit more and then went to the bedroom.\n\nWe must've done it 5 times last night, and some more this morning. Since we were already going a bit rough, I tried riling him up by saying my supposed \"boyfriends\" name, instead of his. And this got him going. He got so much more rough, looked visibly angry (obviously he doesn't want to hear me moan someone else's name, but he said he exaggerated for the plot). Then I poked some more and asked him what he's going to do, he kept saying \"I'm gonna do it harder\" which I liked. Then I asked him if he's going to hurt me, be said yes and then I said \"are you gonna rape me?\"\nHe stopped in shock, but I reassured him that I'm okay and that I liked it. We checked in with each other regularly and we were both really into it.\n\nWe talked about it more this morning and it turns out that we are both really into that kind of rough play. \n\nI have had this fantasy for a while but always thought it was strange and that he might think I'm gross for wanting something like that. I'm really glad that I was able to share that part of myself with him and he accepts me no matter what. \n\nI'm just so happy and thankful that I have such a kind, loving partner who accepts every part of me and doesn't think I'm weird. \n\n",
  "score": 2084,
  "num_comments": 167,
  "subreddit": "TrueOffMyChest",
  "author": "Ok_Garden_2125",
  "created_utc": 1729774623,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1gb1z9y",
  "is_text_post": true,
  "rank": 96
}