{
  "id": "1gcas8i",
  "title": "My girlfriend made me poop in a plastic bag. ",
  "selftext": "I'm F(26) and my girlfriend is F(30) and this is a throwaway account. \n\nWe've been in a relationship for about 10 years and we're engaged.\n\nMy girlfriend has always had problems with hygiene and cleaning of the house, she never did domestic activities in childhood/adolescence and in adulthood this behavior strengthened. Since we met, she has never really taken care of her house and countless times I myself spent weekends cleaning and organizing her house over these 10 years.\n\nFor about 3 years she has been dealing with a depressive condition. She has access to medication, psychologist and all the necessary support in her treatment. In addition, I help her financially since the beginning of our relationship, I pay half of her rent, all the bills when we go out together and some more financial help during the month. She has a good job but doesn't know how to handle the money she earns.\n\nLately her house has been a real pigsty, I don't know how she manages to survive this way. There is no surface free of garbage or objects. She doesn't use dishes so she doesn't have to wash, so it's always disposable plates, glasses and cutlery that she simply throws around the house.\n\nThe sheets smell bad, the floor is dirty but the worst was the bathroom.\n\nSomehow she managed to clog the toilet so nothing goes down the drain. The toilet was full of poop last weekend (I didn't know that). Every weekend I go to her house to be with her and on that day I really needed to poop. When I opened the toilet lid I almost threw up my guts, I couldn't sit there. When I went to talk to her about it, she told me that she was doing her needs in plastic bags and that I should do the same.\n\nAnd, well, I had to do it. There was no way to go out and look for a public bathroom or the mall so I had to shit in a plastic bag. It was so disgusting and humiliating and I felt very angry with her.\n\nAfter that, I had to walk down the 13 floors of her apartment to a trash can on the street with my poop bag. I felt tears forming in my eyes and a lump in my throat. I can't take this relationship anymore and I don't know what to do. How can I leave her like this? My girlfriend's depression is ruining my life.",
  "score": 5818,
  "num_comments": 963,
  "subreddit": "TrueOffMyChest",
  "author": "Just-Wallaby6270",
  "created_utc": 1729908565,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1gcas8i",
  "is_text_post": true,
  "rank": 8,
  "varied_title": "I Was Forced to Defecate in a Plastic Bag by My Partner",
  "varied_selftext": "I'm F(26) and my partner is F(30) and this is a throwaway account.\n\nWe've been in a relationship for about 10 years and we're engaged.\n\nMy girlfriend has always struggled with cleanliness and household maintenance, she never performed domestic tasks during childhood/adolescence and in adulthood this pattern intensified. Since we met, she has never genuinely taken care of her living space and numerous times I personally spent weekends cleaning and organizing her home over these 10 years.\n\nFor approximately 3 years she has been managing a depressive condition. She has access to medication, psychological support and all the necessary resources in her treatment. Additionally, I help her financially since the beginning of our relationship, I cover half of her rent, all the bills when we go out together and some extra financial assistance during the month. She has a good job but doesn't understand how to manage the money she earns.\n\nRecently her house has been an absolute disaster, I can't comprehend how she manages to exist this way. There is no surface free of trash or items. She doesn't use dishes so she avoids washing, so it's always disposable plates, glasses and utensils that she simply scatters around the house.\n\nThe sheets reek, the floor is filthy but the worst was the bathroom.\n\nSomehow she managed to block the toilet so nothing drains. The toilet was filled with excrement last weekend (I wasn't aware). Every weekend I visit her house to be with her and on that day I desperately needed to defecate. When I lifted the toilet lid I nearly vomited, I couldn't sit there. When I went to discuss it with her, she informed me that she was doing her business in plastic bags and that I should do the same.\n\nAnd, well, I had to do it. There was no way to go out and find a public bat"
}