{
  "id": "1fyn8q2",
  "title": "My daughter died 5 years ago today and a part of me is glad about that.",
  "selftext": "Makes me sound horrible. I know. I would never say this out loud to anyone ever.\n\nThough I said daughter, she wasn't technically my daughter. She was my sister's child. My sister OD'ed when the baby was around a year old. I was 19 at that time and in college.\n\nI got custody. I never wanted children. I wanted to be a doctor. I wanted to go a different path than the path my family took. But I felt responsible to take her in. So, I dropped out. Took care of her. Loved her. Life was hard but we got by. I was working any jobs I could get and I didn't have any life. I didn't have any friends. I didn't have any time to date. I was either working or at home taking care of her. At times, I felt like I didn't even have time to breathe.\n\n6 years passed. One day, her school bus was in an accident. 3 children died that day including my daughter.\n\nI was devastated at first. Depressed. Lost. I was even homeless for a little while. I didn't have any family. I didn't have any friends. All I had was haunted memories in that city. So, I moved to a different city to get a fresh start. Reapplied for college. Graduated. Currently, I am in year one of medical school. I got married a few months back.\n\nI feel like finally I am living the life that I wanted to live. Achieving what I wanted to achieve. Take a different path. Do something different. Live a better life than my alcoholic father, runaway mother and drug addicted sister.\n\nI loved her. I would have taken care of her like my child if she had lived. I know that. But there is a part of me that is glad that she is gone. It makes me a horrible person. I already know that.\n\nBut, still I am glad.",
  "score": 4687,
  "num_comments": 195,
  "subreddit": "TrueOffMyChest",
  "author": "Thesophisticatedardo",
  "created_utc": 1728347646,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1fyn8q2",
  "is_text_post": true,
  "rank": 17
}