{
  "id": "1g2fahf",
  "title": "I Hired A Cleaner To Help Me Clean My Depression Home & She Left ",
  "subreddit": "TrueOffMyChest",
  "author": "whoreforthelorax",
  "created_utc": 1728784548,
  "score": 10020,
  "num_comments": 340,
  "permalink": "/r/TrueOffMyChest/comments/1g2fahf/i_hired_a_cleaner_to_help_me_clean_my_depression/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1g2fahf/i_hired_a_cleaner_to_help_me_clean_my_depression/",
  "selftext": "\nI have severe depression and i’ve been trying to get a handle on my depression home and i’ve done a lot of cleaning so far and I am proud of myself. I was neglected as a child and grew up in a hoarders home so I never properly learned how to clean which sounds weird because just pick up a mop? anyways I decided to hire a cleaner to come help me finish up the home and I told her that I have severe depression and my home is fairly large. And she told me she went to school for mental health and addiction",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9700000286102295,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "confession",
    "CasualConversation"
  ],
  "original_title": "I Hired A Cleaner To Help Me Clean My Depression Home & She Left ",
  "original_selftext": "I have severe depression and i’ve been trying to get a handle on my depression home and i’ve done a lot of cleaning so far and I am proud of myself. I was neglected as a child and grew up in a hoarders home so I never properly learned how to clean which sounds weird because just pick up a mop? anyways I decided to hire a cleaner to come help me finish up the home and I told her that I have severe depression and my home is fairly bad. And she told me she went to school for mental health and addictions and she is a PSW, so she’s seen it all and she can handle it, and I was excited to have a clean home. I even stayed home from work today so I could help clean and maybe even ask her to show me how to clean. Anyways she walks into my house, stands there a moment and then says she can’t do it. I ask why, she says because of the smell. Now I already felt like shit for needing someone to come help me clean and she tells me she can’t do it because of the smell, and then leaves. God I feel so angry and disgusting. \n\nSo I spent the next three hours cleaning, I got all the big stuff gone and now the house just needs a good deep clean with bleach. \n\nAnd my best friends mom will be coming next week to help me. I’m grateful. ",
  "minimally_varied": true,
  "variation_date": "2025-08-12 11:50:06"
}