{
  "id": "1gdok7o",
  "title": "Something I’ve never told my husband…",
  "subreddit": "wholesome",
  "author": "His_stargazer",
  "created_utc": 1730072429,
  "score": 9958,
  "num_comments": 167,
  "permalink": "/r/wholesome/comments/1gdok7o/something_ive_never_told_my_husband/",
  "url": "https://www.reddit.com/r/wholesome/comments/1gdok7o/something_ive_never_told_my_husband/",
  "selftext": "I’ve been with my husband for almost 3 decades, we began dating in high school. When I was at his house once, I mentioned I was hungry. He ran to his kitchen and he tried to make some mac and cheese, but added too much milk. He was so excited to make something for me and felt bad about messing it up so I went on a huge rave about how it was the best thing I’ve ever had. That was also the first time I told him I loved him. The way he looked at me after that will never leave my mind. To this day, he will joyfully tell anyone how he made me fall in love with him with “mac and cheese soup”. The truth is, the “soup” is okay, but I fell in love with him because he is the most generous and amazing person I have ever known. Now every time he makes me a bowl of mac and cheese soup, he has the biggest smile and I get to fall in love with this man all over again. ",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9599999785423279,
  "domain": "self.wholesome",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "CasualConversation",
    "self"
  ],
  "varied_title": "Something I’ve never told my husband…",
  "varied_selftext": "I’ve been with my husband for almost 5 decades, we began dating in high school. When I was at his house once, I mentioned I was hungry. He ran to his kitchen and he tried to make some mac and cheese, but added too much milk. He was so excited to make something for me and felt hard about messing it up so I went on a huge rave about how it was the best thing I’ve ever had. That was also the first time I told him I loved him. The way he looked at me after that will never leave my mind. To this day, he will joyfully tell anyone how he made me fall in love with him with “mac and cheese soup”. The truth is, the “soup” is okay, but I fell in love with him because he is the most generous and amazing person I have ever known. Now every time he makes me a bowl of mac and cheese soup, he has the biggest smile and I get to fall in love with this man all over again."
}