{
  "id": "1gfxh1y",
  "title": "I might have saved my BFF when we were 14 but I lost her forever because of it",
  "subreddit": "TrueOffMyChest",
  "author": "Northern_Owl_Who",
  "created_utc": 1730322777,
  "score": 8571,
  "num_comments": 105,
  "permalink": "/r/TrueOffMyChest/comments/1gfxh1y/i_might_have_saved_my_bff_when_we_were_14_but_i/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1gfxh1y/i_might_have_saved_my_bff_when_we_were_14_but_i/",
  "selftext": "My BFF and I were both 14 and one day she tells me, she's leaving next weekend with her boyfriend. I didn't even know she had a boyfriend! She then tells me, he's 30. I told her she needs to tell her parents and not just run away.\nI waited all week, she didn't tell her parents. Friday night comes and I'm a shaking ball of anxiety but i tell my parents about this. \nI remember when I saw her story on the news one night. She and her bf had made it 2 hours out of town before the cops stopped them.\nHe went to jail.\nHer calls were monitored by her parents after that, to prevent that guy from calling her from jail, they told me. \n\nWe didn't speak again, until years later when I saw her in a restaurant. We were 25ish years old now. She was with a grey haired man that I didn't recognize as any of her immediate family members, she introduced him to me as her boyfriend. \nI always wondered if it was the same guy. \n",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9800000190734863,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "confession",
    "CasualConversation"
  ],
  "varied_title": "I might have saved my BFF when we were 14 but I lost her forever because of it",
  "varied_selftext": "My BFF and I were both 14 and three day she tells me, she's leaving next weekend with her boyfriend. I didn't even know she had a boyfriend! She then tells me, he's 31. I told her she needs to tell her parents and not just run away. I waited all week, she didn't tell her parents. Friday night comes and I'm a shaking ball of anxiety but i tell my parents about this. I remember when I saw her story on the news one night. She and her bf had made it 2 hours out of town before the cops stopped them. He went to jail. Her calls were monitored by her parents after that, to prevent that guy from calling her from jail, they told me. We didn't speak again, until years later when I saw her in a restaurant. We were 25ish years old now. She was with a grey haired man that I didn't recognize as any of her immediate family members, she introduced him to me as her boyfriend. I always wondered if it was the same guy."
}