{
  "id": "1fuuvlp",
  "title": "My coworker is a totally normal person and he fascinates me.",
  "subreddit": "TrueOffMyChest",
  "author": "Apprehensive_Cry6293",
  "created_utc": 1727914035,
  "score": 10041,
  "num_comments": 914,
  "permalink": "/r/TrueOffMyChest/comments/1fuuvlp/my_coworker_is_a_totally_normal_person_and_he/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1fuuvlp/my_coworker_is_a_totally_normal_person_and_he/",
  "selftext": "He has no mental health problems like everyone else here and most of the other people in my life. He isn't on any meds, he's physically healthy. I've had to explain my panic attacks, anxiety, my meds, being overwhelmed by basically everything and so much more to him because he's never experienced/heard of them.\n\nAlmost everyone I know is a mess and the contrast between them, myself and him is amazing to me. It's like he's a machine.\n\nJust some other things:\nHe's never late to work, he doesn't over sleep, he doesn't have trouble sleeping.\n\nHe doesn't have meltdowns/tantrums/outbursts or shutdowns\n\nHe isn't allergic to anything and he has no food sensitivities, or at least none that he knows of.\n\nHe works out every day, either at home or the gym.\n\nHe has no chronic health issues\n\nHe doesn't get stuck or freeze or get trapped in a loop\n\nHe can drive without issue and knows how to get to where he wants to go without his phone. Detours don't cause him any issues.\n\nIf things don't go to plan or have to change or just fall apart he just adapts and moves on. \n\nHe can just talk to people, males, females, just casual conversation. \n\nIf a big choice has to be made he just makes it.\n\nHe does what he says he'll do when he says he'll do it the way he says he'll do it.\n\nHe can solve problems, there's no googling no looking it up, he just knows.\n\nHe doesn't keep his phone on him all day. He just puts it away and has no need to look at it. \n\nHe doesn't use social media, he doesn't follow it, he doesn't care about it.",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9700000286102295,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "stopprocrastinating",
    "bulletjournal",
    "declutter",
    "minimalism",
    "selfimprovement",
    "college",
    "bipolar",
    "schizophrenia",
    "selfcare",
    "Meditation"
  ]
}