{
  "id": "1g0djwg",
  "title": "Update: I posted a few months ago about ending my relationship with my ex who bought an 87K truck without telling me. Going ahead with that decision means that I paid off my student loans this past month. He also returned the truck.",
  "selftext": "Hi, everyone. So I posted a few months about a situation I was dealing with my ex and him buying a car without telling me. I really doubted myself when I first made my first post because I had received such strong negative reactions from other people about me wanting to back out of the move. I appreciate the comments I got not only on the posts but through the messages as well. It really helped solidify, for me that these feelings I had about the situation shouldn't be ignored. So thank you guys for responding because it saved me financially.\n\nLooking back at the situation now months later, I can see that I was being set up to be financially abused. When I broke up with my ex, i thought that we were financially incompatible and that unfortunately it took this large purchase happening to see it. But I can see now, but that's not the case. My ex made a plan in his head and what made sense to him was for me to pay most of the expenses and he thought this was okay and that I should be okay with it too.\n\nEven though I can see the reality of what he was trying to do, I can't hate my ex because he helped start me on this path of looking at my finances. I remember when we first started dating and I went to pay for an item I was getting and my card declined and without batting an eye, even though it was a little embarrassing, I just took out another card and paid. I was used to this happening every once in a while, because I was literally living paycheck up to paycheck. I'm not putting down anyone where that's the case. But in my situation, then I was living way above my means. I would justify every single want and get it and I thought because I was making minimum payments and on time, i wasn't as bad as the next person. \n\nWhen the situation with my card happened, after we got back to my ex's car, he kindly asked, if this type of thing happens all the time and I told him sometimes and he basically gave me advice. He did not try to force me to stop spending. He asked me to track my purchases and recommended a few apps. The first 2 months that we were seeing each other,  he would  encourage me every other day or every once in a while, to just track what I spent, to shop like I usually did, but just track everything. Being able to see how much I was spending, especially when I broke it down into categories was astounding. There was one month I spent sixty eight dollars on bagels. It wasn't for work. It wasn't for other people. It was me stopping at a bagel place every morning and getting a bagel. I would sometimes get variations, which is why the bagels cost so much. \n\nOnce I realized how much I was spending on stupid things , my ex helped me make a plan that would work for me and that plan has continued to consistently work. I have added to it and changed things or tweaked things as my financial status has continued to improve, and so far, so good. This is why I don't have any bad feelings about my ex. He never pushed for me to pay my bills in front of him. He never saw credit card statements on apps, nothing. He only kept encouraging me to look at my finances and fix them. He helped give me the foundation to start to manage my finances and I thought in my head that we were on the same page. And because he was such a sticker for finances and he was so frugal, that is why this truck purchase was such a surprise to me. It was unplanned, not discussed, it was a large amount of money and, just knowing the general view of how much debt he had, I know without a doubt that there was no way he could afford this truck. \n\nI'm not trying to paint my ex as a saint. I am explaining why he had such a positive impact on me financially. So when the truck purchase happened, and he refused to budge I honestly was shocked and seeing how bad this was, i had to walk away.\n\nIt's been about 6 months since everything's happened and I'm doing very well. I just recently paid off my student loans about two weeks ago. I now have my car. I have a small savings. Because of that, i have changed the focus of putting the majority of my income now towards my car. I'm not rich by any means, but i'm definitely living within my means and i'm okay with that.\n\nThe last two things I am updating on are my raise and my ex's truck. I had a few people message me about the raise and unfortunately I did not get it due to a big mistake i made on a project.\nOnce I realized the mistake, i knew that it would jeopardize things for my raise because I had made the mistake so close to my evaluation and I didn't get the raise. But I fixed the mistake, and when I get reevaluated after three months, i am hopeful I get it this time. Losing the possibility of the raise made me realize even more that I had made the right decision because I would be so screwed right now if I hadn't ended my relationship. \n\nWith my ex, we have spoken once and that is when we broke up. I cut communication completely, because he was still trying to fix things without addressing the truck and the fact that he was keeping it. I know from a person close to him that actually four months after we broke up, he did a voluntary repossession. I also know the truck is gone, because he deleted all the pictures he had of it. I was actually relieved to hear that for him because he can hopefully start to fix the situation he got himself in. I really do want the best for my ex and I don't know the thought process that led to him getting this truck, or what could have influenced him, but hopefully he can get back to where he was and make more improvements. The relationship is finished and there is no hope of rekindling anything. Even though he returned the truck, I could never go back to him because the trust is gone. It wasn't only the money. It was also him making such a vital decision without me,  expecting me to go along with it, and then vilifying me when I had viable concerns. I can't move past that. Yes, money isn't everything, but I can't stop thinking about what my life would be like now had I stayed. My student loans would not be paid off. We would both be broke.We would both be in worse off financial positions. All of these things would have affected the relationship negatively, which would have made it unhealthy. Im glad we broke up and I have forgiven him what he tried to do to me and i wish him the best. I stand and I will continue to stand by the view that finances are a breakable offense, especially when your partner isn't listening to you and does something that will affect both of you. If you don't agree that's fine, but these last few months have proved that to me.\n\nSo that's my the longish update, and again, I really want to say thank you guys for responding to my first post. I honestly was leaning to towards staying with him and not moving in, and I think in the long run, I would have been financially devastated and taken advantage right now and because of the different opinions i read, It made me realize how bad not only the situation was, but also how bad it could get, so thanks.\n\n\nA very, very, very, very small, humble brag. I posted my paid in full student loan email on my profile, so if you want to see that you can click that post but you don't have to. Sorry, i'm just so proud of that fact. Ok bye :).",
  "score": 3382,
  "num_comments": 100,
  "subreddit": "TrueOffMyChest",
  "author": "Notmovingin_",
  "created_utc": 1728546212,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1g0djwg",
  "is_text_post": true,
  "rank": 29
}