{
  "id": "1gdok7o",
  "title": "Something I’ve never told my husband…",
  "selftext": "I’ve been with my husband for almost 3 decades, we began dating in high school. When I was at his house once, I mentioned I was hungry. He ran to his kitchen and he tried to make some mac and cheese, but added too much milk. He was so excited to make something for me and felt bad about messing it up so I went on a huge rave about how it was the best thing I’ve ever had. That was also the first time I told him I loved him. The way he looked at me after that will never leave my mind. To this day, he will joyfully tell anyone how he made me fall in love with him with “mac and cheese soup”. The truth is, the “soup” is okay, but I fell in love with him because he is the most generous and amazing person I have ever known. Now every time he makes me a bowl of mac and cheese soup, he has the biggest smile and I get to fall in love with this man all over again. ",
  "score": 9958,
  "num_comments": 167,
  "subreddit": "wholesome",
  "author": "His_stargazer",
  "created_utc": 1730072429,
  "url": "https://reddit.com/r/wholesome/comments/1gdok7o",
  "is_text_post": true,
  "rank": 5,
  "varied_title": "Here's the rewrite:\n\n A Secret I've Kept for Years…",
  "varied_selftext": "I've been married to my husband for nearly 30 years, and we started dating back in high school. During one visit to his place, I mentioned feeling hungry. He dashed to the kitchen and attempted to prepare some mac and cheese, accidentally pouring in too much milk. He was so enthusiastic about cooking something for me and felt terrible about the mishap, so I went on a passionate rave about how it was absolutely incredible. That was also the precise moment I first told him I loved him. The way he gazed at me afterward will forever be etched in my memory. To this day, he gleefully tells everyone how he made me fall in love with him through \"mac and cheese soup\". The reality is, the \"soup\" is decent, but I fell in love with him because he is the most selfless and incredible person I've ever known. Now every time he serves me a bowl of mac and cheese soup, he beams with the brightest smile and I get to rediscover my love for this man all over again."
}