{
  "id": "1g55cce",
  "title": "I let my daughter knock out her sister ",
  "score": 14038,
  "subreddit": "TrueOffMyChest",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1g55cce/i_let_my_daughter_knock_out_her_sister/",
  "selftext": "My kids were over last night. My daughter lost her husband 7 years ago to suicide. My girls are 34,33, and 29.\n\nOldest we'll call Ashley, middle we'll call Mary (of course)\n\nAshley and Mary joke a lot. Mary and I had a long talk and she has decided to not date and remain abstenent in her second life. She has 2 kids, and a kind of mean sense of humor.Ashley is divorced with no children. She jokes too but her jokes can also come across harsh.\n\nSo anyway, last night. They were joking and Mary said something along the lines of \"it's the uneven eyebrows for me\" and Ashley said \"it's the dead husband for me\"\n\nMary did not laugh. She just straight face sat there and turned and watched the tv. Then Ashley was like \"oh wow you can dish it out but you can't take it\" and they sat in silence. \n\nI left the room to keep fixing dinner but I came back to a shouting match between them. My youngest was trying to calm them down but finally Ashley said \"No wonder ____ shot himself if he was hearing this shit every day\"\n\nMary looked at Ashley for a few seconds and then took off her wedding ring, placed it on the end table by where she was standing, and grabbed her hair and started beating the crap out of her. Ashley fought back but couldn't do much since her hair wss being pulled down. \n\nI was in shock, but part of me, as horrible as it sounds, felt like she kind of deserved it. Like their Nana said \"you play with the match , you just might just start a fire\"\n\nFinally it was getting bad, my youngest was pulling her off and I also started pulling her off. Ashley had a Stanley cup that was now on the ground. When we pulled Mary off Ashley got up. Mary grabbed the Stanley and threw it at Ashley's forehead. \n\nAshley fell down and laid there for a minute. She was conscious, but it took her a few seconds. \n\nHer sister took her to the doctors this morning, she has a concussion, I'll be taking care of her for a while but... that's kind of what happens.",
  "author": "Intelligent-Bison561",
  "created_utc": 1729100606,
  "num_comments": 1474,
  "over_18": false,
  "permalink": "/r/TrueOffMyChest/comments/1g55cce/i_let_my_daughter_knock_out_her_sister/",
  "link_flair_text": null
}