{
  "id": "1g2tzni",
  "title": "I think time blindness for us with ADHD makes it very difficult to miss people, even loved ones. Have you found anything that works out for you, so you don't forget about the existence of those you love, who are not near you?",
  "selftext": "Usually we miss someone because we haven't seen them for a while. But I noticed that for me, it doesn't matter if I haven't seem then in one day, one month, or one year. It's just the same, I feel like I have seen them very recently, even though a lot of time may have passed in between. This is making it very difficult to really miss someone.\n\nBecause of this, I don't call my parents very often, or visit them. Not just parents, friends as well. Relatives. And no, it's not that I don't enjoy time with them. I do. I think it's just that most of the times, I completely forget that they exist. Even writing this sounds mental. How can I forget that they exist. But I get so caught up on my daily life that I barely remember anyone that is not near me. Unless of course there is a reason to remember them. If they come up somehow, through what I'm doing, then I remember their existence. \n\nSo this is a strange paradox, because while I do feel that I've just met them recently and don't miss them, I also completely forget their existence, unless something reminds me of them. I tried to talk to a psychologist about this, and they've tried to attach this behavior to some sort of passed trauma. Which is a bit annoying, to be honest. Does everything nowadays need to be explained with a passed trauma or what? I didn't have any trauma that I can recall. I have very pleasant relatives. Oh, but maybe you've had some trauma that you can't recall - she asked. Fuck. I guess I'll analyze the problem myself then. In my mind, time blindness is a good explanation for all this. Can't miss someone, because you don't notice passage of time. Can't remember someone's because you get too cought up on something and again, don't notice the passage of time. \n\nIt may be that not everyone feels this way. Maybe this is just my experience.",
  "score": 2544,
  "num_comments": 298,
  "subreddit": "ADHD",
  "author": "Potatoe_expert",
  "created_utc": 1728838044,
  "url": "https://reddit.com/r/ADHD/comments/1g2tzni",
  "is_text_post": true,
  "rank": 57
}