{
  "id": "1ggm9r8",
  "title": "UPDATE: I think my husband fathered his best friend’s children. (One month later.)",
  "selftext": "Happy Halloween everyone.\n\nIt's been a while. Things have continued to spiral. Had a number of comments and private messages wanting to check in, which I appreciate. While I obviously still can't talk about much, I've shown this post to my legal counsel before uploading it and had it approved as safe. \n\nSo, the headline here, which I already discussed in the comments, is that Luke and Amy talked about themselves as half-siblings in the letters I found on Luke's laptop. The timeline is still a bit unclear to me, but Jim had an affair with one of his (college age) students and she got pregnant. Years later, her daughter became friends with Jim's son. Amy was abused in her parents' house and everyone in Luke's family wanted to get her out, which they eventually did. At that point, Jim told Luke and Amy the truth. It wasn't until a couple years later that they began to sleep together. \n\nAs far as recent updates, Kaylee has spent some time in a psychiatric ward. Tom discovered that she had done something very reckless. Social Services have also seen fit to remove her from Luke and Amy's care, so she is currently staying with Cat. Amy hated that and I'm told she raged for some time at the idea that I would poison Kaylee against her and that in her anger, she made some choice threats. I have been advised not to reach out myself, but Kaylee has all my information and I did send her a message promising her that she could always come to me about anything. I think that's more than alright. If she initiates, I will not turn her away.\n\nMy troubles are not over, and they got worse after the test results came back. Everyone was tested. I finally know the truth now, beyond a shadow of a doubt, that Luke is the biological father to all four of Amy's children. After years of wondering, confirmation feels strangely hollow. It changes almost nothing at this point but it is proof that he was unfaithful to me. Luke is still maintaining that it was an open relationship. I had thought to use incest charges against him and Amy, but that plan hit a roadblock. The two of them had mandated testing as well, and at least according to the results, Luke and Amy are NOT siblings. I don't understand it either. Perhaps Jim was wrong all this time? Either way, I still have proof that they believed it to be true, but they are now insisting that was just a kind of role-play for them. \n\nLuke also threw a curve ball at me by demanding we test my children as well. I honestly hated him for that. They've been through enough as it is. But he is claiming that I also participated in the \"open relationship\" and that the paternity of our children will prove it. In particular, he was adamant that Sophie be tested. I couldn't figure out why. But I think Luke must know something I do not, because the test results for Sophie came back negative. They said that Luke is not her father. Then Luke began to claim that he had tested Sophie years ago to be sure. I was certain he was lying, that he had somehow sabotaged the test, but he did submit a DNA test from about ten years ago and it likewise maintains that Luke is not Sophie's father.\n\nBefore anyone asks, no, I never had an affair of my own. I never cheated on Luke. I had no idea how this had happened and I could not make sense of it. I requested another test and that has yet to arrive, but with two tests already, I'm bewildered and frightened. I don't know how this is possible. Since I was never unfaithful to Luke, I can only assume that something was done without my consent. I have never been sexually assaulted as far as I am aware. But there were a few nights, back when I used to get drunk with Amy, that someone could have possibly drugged me. What scares me is that Luke tested Sophie years ago. I feel like he knows more about this than he is letting on. I've discussed this with my therapist and my lawyer, I've tried to get to the bottom of it, but I just don't know.\n\nI have been upfront about everything with Sophie. I believe Luke is trying to make her doubt me, to drive a wedge between us. I've promised her that I never had an affair, that these results are impossible. I don't think she believes me, completely. But I also don't get the sense that she's angry with me or that she feels betrayed. I think she would honestly preger it were true at this point, that Luke was not her birth father. The rest of my kids don't know about this part yet, but they probably will soon. Gossip is spreading like wildfire among Amy's kids and my own. I've never been the sort of parent to read my kids' texts, so I'm not sure about specifics. But I'm not going to address this with them unless Sophie gives me her blessing. She was the only one who's results came back negative, the rest of the kids are proven to be Luke's. \n\nCat is not speaking to either of her children, but that's not to say she's giving them the silent treatment. Technically, they're not allowed any contact with Kaylee right now. So keeping distance isn't really optional. But Cat is furious with them both, now that she's seen the state Kaylee is in. She's likely going to explode at them when she next has the chance.\n\nI wish I could describe a happy ending for our family but the trouble is far from over. I'm actually somewhat traumatized by the idea that I might have been assaulted and never known it until now, and if that is indeed the case, I'm not looking forward to the conversation where Sophie finds out about that and about her origins. Anyway, I don't know when I'll next update but I am taking the kids to a haunted house tonight, so that should be fun. ",
  "score": 2754,
  "num_comments": 227,
  "subreddit": "offmychest",
  "author": "PsychFactor",
  "created_utc": 1730401432,
  "url": "https://reddit.com/r/offmychest/comments/1ggm9r8",
  "is_text_post": true,
  "rank": 44
}