{
  "id": "1ggtwoy",
  "title": "Most “Rich people” hobbies aren’t prohibitively expensive they’re cultural signifiers ",
  "score": 3495,
  "subreddit": "unpopularopinion",
  "url": "https://www.reddit.com/r/unpopularopinion/comments/1ggtwoy/most_rich_people_hobbies_arent_prohibitively/",
  "selftext": "For example Tennis is a \"rich persons sport\" but is a cheap and easy to get into as Basketball on the entry level (and Cheaoer than Football or baseball)\n\nPlaying the Violin is a rich person thing but a fiddle is literally the same thing and is associated with the poor appalachians. \n\nThe Symphony is for rich people but it's often cheaper than all live sports except Baseball.\n\nSkiing is considered a rich person thing but it's probably cheaper than four wheeling which is \"working class\" entertainment. (Assuming you live in New England or the Mountain states where skiing does not require a whole vacation)\n\nYou could go on and on but most rich people hobbies are gatekept by culture not means.",
  "author": "1maco",
  "created_utc": 1730422896,
  "num_comments": 978,
  "over_18": false,
  "permalink": "/r/unpopularopinion/comments/1ggtwoy/most_rich_people_hobbies_arent_prohibitively/",
  "link_flair_text": null,
  "alternative_subreddits": [
    "self",
    "CasualConversation",
    "NoStupidQuestions",
    "DoesAnybodyElse"
  ],
  "varied_title": "Most “Rich people” hobbies aren’t prohibitively expensive they’re cultural signifiers ",
  "varied_selftext": "For example Tennis is a \"rich persons sport\" but is a cheap and easy to get into as Basketball on the entry level (and Cheaoer than Football or baseball) Playing the Violin is a rich person thing but a fiddle is literally the same thing and is associated with the poor appalachians. The Symphony is for rich people but it's often cheaper than all live sports except Baseball. Skiing is considered a rich person thing but it's probably cheaper than four wheeling which is \"working class\" entertainment. (Assuming you live in Recent England or the Mountain states where skiing does not require a whole vacation) You could go on and on but most rich people hobbies are gatekept by culture not means."
}