{
  "id": "1g6lwpt",
  "title": "My (26F) Husband's (26M) family keeps referring to me as his \"best friend\". What does this mean?",
  "selftext": "My Husband Robbie (26 M) and I (26 F) got married earlier this year. It was a beautiful day and I felt so much love and support from both sides of our family. \n\nTwo months after our wedding day, we celebrated my birthday at my inlaws house. It was nothing major, just a dinner and a night together with me, my husband, his mom (50sF) , dad (50sM), and sister(22F). That is the first night I noticed them referring to me as \"Robbie's best friend\". \nAfter my birthday dinner, we were all sitting together in the livingroom, just chatting and having some drinks. That's when my SIL got a phone call from a good friend of hers. When she answered the phone and her friend asked what she was doing, she replied that it was her \"brother's best friend's birthday\". I had never heard anyone refer to me as Robbie's best friend. I am his wife, and before that we were engaged for over 2 years. Hearing my SIL refer to me like that confused me greatly. I always refer to her as my SIL, and I would expect her to do the same. Or maybe even as Robbie's wife, but certainly not best friend. After my SIL hung up her phone, I asked her why she referred to me the way she did. She did not seem at all abashed. She just said \"well, you are best friends! And that's what mom and dad call you\" (referring to MIL and FIL). \nMy SIL and I are by no means very close, but we are nice to each other and have never had any fights. We just don't hang out outside of family functions because our personalities are pretty different. She's never made it seem like she was annoyed or mad at me. \n\nI decided to let it go that night, even though it weirded me out. But then it all happened again a few days ago, which is why I'm writing this post. My MIL and I both work in the same industry doing similar jobs, but at different companies in the area. Sometimes our companies collaborate when we have clients who switch over. This week we had that happen, and I had to pay a visit to my MILs office to help a client transition. My MIL was in the office, so I stopped by to say hello. While I was there she introduced me to her colleague, and once again I was perplexed by how she did it. She said, \"this is my son's best friend!\" As I was shaking hands with the colleague. I paused and awkwardly said \"I'm his wife...\". The colleague looked confused but my MIL continued to smile and didn't address it. \nOnce we were alone I asked my MIL why she referred to me like that. Just like my SIL she didn't seem to act like it was weird at all, and said the same thing, \"well you are best friends!\". \n\nThe only thing that I can think to explain this is that in my vows to Robbie I promised to continue being his best friend. Nobody acted like this was odd or special, and I feel like it's a pretty common thing to put in vows. So I'm not sure why Robbie's family seems to have clung to it, unless it has nothing to do with everything. I've spoken to Robbie about this too, and he is also perplexed by it. He asked his parents privately about it and they gave him the same answer they've been giving me. \n\nIt all just feels like some sort of bullying behavior to me, but I've never felt a sense of this from them before. Are they calling be his best friend because they don't like the fact I'm his wife? Or is it some inside joke they've been in on without me? I'm not sure what to do or make of it, especially because the in laws are acting like it's not an issue when I bring it up. Yes, I am Robbie's best friend, but I'm also his life partner, and their DIL/SIL. I don't know what to do. Any input or advice would be welcome. \n\nTLDR; my inlaws keep referring to me as my husband's \"best friend\", but I am his wife and their daughter in law. They don't seem to think it's weird at all. \n\nNote: the rule filter is forcing me to delete some sentences. If anything is unclear I'll try to clear it up in the comments. \n",
  "score": 3236,
  "num_comments": 469,
  "subreddit": "relationship_advice",
  "author": "faxxed",
  "created_utc": 1729267865,
  "url": "https://reddit.com/r/relationship_advice/comments/1g6lwpt",
  "is_text_post": true,
  "rank": 30
}