{
  "id": "1g2fahf",
  "title": "I Hired A Cleaner To Help Me Clean My Depression Home & She Left ",
  "selftext": "I have severe depression and i’ve been trying to get a handle on my depression home and i’ve done a lot of cleaning so far and I am proud of myself. I was neglected as a child and grew up in a hoarders home so I never properly learned how to clean which sounds weird because just pick up a mop? anyways I decided to hire a cleaner to come help me finish up the home and I told her that I have severe depression and my home is fairly bad. And she told me she went to school for mental health and addictions and she is a PSW, so she’s seen it all and she can handle it, and I was excited to have a clean home. I even stayed home from work today so I could help clean and maybe even ask her to show me how to clean. Anyways she walks into my house, stands there a moment and then says she can’t do it. I ask why, she says because of the smell. Now I already felt like shit for needing someone to come help me clean and she tells me she can’t do it because of the smell, and then leaves. God I feel so angry and disgusting. \n\nSo I spent the next three hours cleaning, I got all the big stuff gone and now the house just needs a good deep clean with bleach. \n\nAnd my best friends mom will be coming next week to help me. I’m grateful. ",
  "score": 10020,
  "num_comments": 340,
  "subreddit": "TrueOffMyChest",
  "author": "whoreforthelorax",
  "created_utc": 1728784548,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1g2fahf",
  "is_text_post": true,
  "rank": 4,
  "varied_title": "I Brought in a Cleaning Pro for My Depression-Riddled Home & She Bailed",
  "varied_selftext": "I struggle with severe depression and I've been battling to get a grip on my messy living space and I've accomplished a lot of cleaning so far and I am genuinely proud of myself. I was emotionally neglected as a child and grew up in a hoarder's environment so I never truly learned how to clean which sounds strange because isn't it just about picking up a mop? anyway, I decided to hire a professional cleaner to come assist me in finishing up the home and I explained that I have severe depression and my living space is pretty rough. She told me she went to school for mental health and addiction support and she's a Personal Support Worker, so she's witnessed everything and can handle it, and I was thrilled to potentially have a clean home. I even called out from work today so I could help clean and maybe even ask her to demonstrate some cleaning techniques. \n\nAnyway, she enters my house, stands there for a moment and then declares she can't do it. I ask why, she says because of the odor. Now I already felt absolutely terrible for needing someone to come help me clean and she tells me she can't proceed because of the smell, and then just leaves. God I feel so angry and disgusting.\n\nSo I spent the next three hours cleaning, I got all the major clutter removed and now the house just needs a thorough deep clean with bleach.\n\nAnd my best friend's mom will be coming next week to help me. I'm grateful."
}