{
  "id": "1fwibac",
  "title": "How can I navigate my (32F) Husband's (34M) eating habits?",
  "selftext": "I'm curled up on the floor of my bathroom and I've realized I've hit a breaking point. I just finished a 28 hour shift so I apologize if this is incomprehensible. \n\nMy (32F) husband (34M) has always been a big eater. He's a big gym-goer so him consuming an upwards of 9-10k calories a day has always been his norm. His parents even said it nearly bankrupted their family trying to feed him through puberty. He's still very lean.\n\nIt's never caused issues until I started residency. \n\nWe share groceries, and on my days off we try and get out to the grocery store together for a big grocery run. Unfortunately, due to a hospitalization as a child caused by a major food handling issue in my school (me and almost 100 other students were hospitalized) I am working through strong aversions to \"unsafe\" foods. I'm working with a psychiatrist about it (and have been since I was a child) and have my \"safe\" foods (which are generally dry pantry goods or very specific items otherwise).\n\nWe buy huge quantities, our grocery bill works out to be about $1k/month (we don't have kids). \n\nRecently, all of this food has been disappearing within 5-6 days. He drinks about a gallon of milk a day, half a box of cereal, an entire package of chicken, multiple large tubs of yogourt and entire blocks of cheese- this doesn't even include his midnight snacks. This is one day. I can sometimes get in a bite or two of the food I bought before I find the empty packages in the pantry the next day. It's almost insult to injury that he puts the empty packages back instead of in the garbage. \n\nIt's not uncommon I come home to an empty fridge- most days I'm too exhausted coming home to even bother ordering takeout- I've fallen asleep too many times on the couch just to wake up the next day with the food untouched on the front door mat. My only saving grace is that my residency program pays for meals while we're on shift so at least I get 2/3 meals a day at the hospital- that is, if I have a chance to eat on shift. \n\nI begged my husband to get seen by a doctor (I was concerned about a thyroid issue, an eating disorder, or even insane diagnoses like Prader-Willi) and he dragged his feet before inevitably going. Nothing awry with his labwork by any means which totally stunned me. He hasn't gained any weight. He isn't binging and purging (at least from what he's told me) and he doesn't display any signs that he would be purging. I asked if he felt upset or stressed with my long work hours (I work around 80 hours a week) and he said he was coping fine. \n\nThe biggest issue I'm facing is that I'm constantly coming home to an empty fridge/cabinet. The best I can do is ketchup with salt and pepper because of how efficiently he clears out any food item. He has tried to cook for me in the past but gets fidgetey waiting for me to come home (the most recent example I have is him preparing two lage pans of lasagna- he ate it all in one sitting before I even got home). \n\nEven groceries I explicitly bought for myself and my husband knows are my safe foods get eaten because he \"forgot\" or \"thought I wouldn't eat them anyways.\" He does have severe ADHD he is getting medicated  so the forgetfulness I can sometimes forgive but I have even started designating specific shelves/drawers to be mine or putting up signs on food I want to be saved- it doesn't stop him. I just want to be able to have a snack when I get home without wondering if the cabinet will be empty. \n\nMy next step was to look at putting a fridge in our basement with a lock so I have my own safe stash of food but I shouldn't have to go down that extreme. I seriously wonder if a locked fridge would even deter him.\n\nI'm at a total impasse of what to do now. I've asked my colleagues both for medical and personal advice and they've expressed concerns that he's doing this maliciously if we can't find a reason otherwise. He's been the light of my life and is a fantastic partner in so many ways outside of the food situation so I'm at a loss. But coming home today to find the one bag of veggie straws I asked him to save for me gone just broke me. ",
  "score": 2553,
  "num_comments": 890,
  "subreddit": "relationship_advice",
  "author": "ThrowRA_OddSundae39",
  "created_utc": 1728102273,
  "url": "https://reddit.com/r/relationship_advice/comments/1fwibac",
  "is_text_post": true,
  "rank": 56
}