{
  "id": "1g65j41",
  "title": "I advocated for myself and in return was called a drug addict. Man, I hate having ADHD",
  "selftext": "Here's a more concise version of your post, reduced to under 2000 characters:\n\nI had my second visit with a new psychiatrist, and it went terribly. This provider, supposedly specializing in ADHD, called me a drug addict for advocating for myself.\n\nStimulants were life-changing after 21 years of struggling. On Vyvanse, I became functional, confident, and better at relationships. I maintained the same dosage for over 2 years without tolerance issues.\n\nDuring the shortage, I went without for 6 weeks. Life became hell again. When I finally got pills, they were ineffective, even with increased dosages.\n\nI switched to Focalin, which worked even better than Vyvanse. I took it daily for 6 months without issues. Then, due to insurance changes, I had to see a new provider.\n\nThis new provider insisted I \"strictly cannot\" take stimulants daily, despite my explanation of their benefits. She prescribed only 15 pills for over 30 days.\n\nThose 30 days were miserable. The Focalin lost effectiveness, and my productivity, self-esteem, and confidence plummeted.\n\nI brought this up in our second session, hoping she'd reconsider. Instead, she called me a \"drug addict because I am asking for more pills.\" When I mentioned my history of daily use without tolerance issues, she replied, \"I can only treat based on professional data.\" She ended by saying, \"I won't be prescribing controls of any type until I receive proof that you completed a substance abuse program.\"\n\nI'm not a drug addict! I have ADHD and need these meds to function. Why are doctors focused on treating the average person instead of the individual? Just because 85% of people build tolerance to stimulants doesn't mean the 15% who don't should be treated the same way.\n\nNeedless to say, I'll be finding a new doctor.",
  "score": 2184,
  "num_comments": 382,
  "subreddit": "ADHD",
  "author": "photographer0228",
  "created_utc": 1729210870,
  "url": "https://reddit.com/r/ADHD/comments/1g65j41",
  "is_text_post": true,
  "rank": 81
}