{
  "id": "1fz4b9r",
  "title": "I teach English at a university. The decline each year has been terrifying. ",
  "subreddit": "Teachers",
  "author": "HighlightMelodic3494",
  "created_utc": 1728405706,
  "score": 25114,
  "num_comments": 3872,
  "permalink": "/r/Teachers/comments/1fz4b9r/i_teach_english_at_a_university_the_decline_each/",
  "url": "https://www.reddit.com/r/Teachers/comments/1fz4b9r/i_teach_english_at_a_university_the_decline_each/",
  "selftext": "I work as a professor for a uni on the east coast of the USA. What strikes me the most is the decline in student writing and comprehension skills that is among the worst I've ever encountered. These are SHARP declines; I recently assigned a reading exam and I had numerous students inquire if it's open book (?!), and I had to tell them that no, it isn't... \n\nMy students don't read. They expect to be able to submit assignments more than once. They were shocked at essay grades and asked if they could resubmit for higher grades. I told them, also, no. They were very surprised. \n\nTo all K-12 teachers who have gone through unfair admin demanding for higher grades, who have suffered parents screaming and yelling at them because their student didn't perform well on an exam: I'm sorry. I work on the university level so that I wouldn't have to deal with parents and I don't. If students fail-- and they do-- I simply don't care. At all. I don't feel a pang of disappointment when they perform at a lower level and I keep the standard high because I expect them to rise to the occasion. What's mind-boggling is that students DON'T EVEN TRY. At this, I also don't care-- I don't get paid that great-- but it still saddens me. Students used to be determined and the standard of learning used to be much higher. I'm sorry if you were punished for keeping your standards high. None of this is fair and the students are suffering tremendously for it. ",
  "link_flair_text": "Teacher Support &/or Advice",
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9100000262260437,
  "domain": "self.Teachers",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "CasualConversation"
  ],
  "varied_title": "I teach English at a university. The decline each time has been terrifying.",
  "varied_selftext": "I work as a professor for a uni on the east coast of the USA. What strikes me the most is the decline in student writing and comprehension skills that is among the worst I've ever encountered. These are SHARP declines; I recently assigned a reading exam and I had numerous students inquire if it's open book (?!), and I had to tell them that no, it isn't... My students don't read. They expect to be able to submit assignments more than once. They were shocked at essay grades and asked if they could resubmit for higher grades. I told them, also, no. They were quite surprised. To all K-12 teachers who have gone through unfair admin demanding for higher grades, who have suffered parents screaming and yelling at them because their student didn't perform well on an exam: I'm sorry. I work on the university level so that I wouldn't have to deal with parents and I don't. If students fail-- and they do-- I simply don't care. At all. I don't feel a pang of disappointment when they perform at a lower level and I keep the standard high because I expect them to rise to the occasion. What's mind-boggling is that students DON'T EVEN TRY. At this, I also don't care-- I don't get paid that great-- but it still saddens me. Students used to be determined and the standard of learning used to be much higher. I'm sorry if you were punished for keeping your standards high. None of this is fair and the students are suffering tremendously for it."
}