{
  "id": "1g3gbg5",
  "title": "Root cause of a student’s sudden misbehavior caught me off guard",
  "subreddit": "Teachers",
  "author": "mcjunker",
  "created_utc": 1728914054,
  "score": 13442,
  "num_comments": 371,
  "permalink": "/r/Teachers/comments/1g3gbg5/root_cause_of_a_students_sudden_misbehavior/",
  "url": "https://www.reddit.com/r/Teachers/comments/1g3gbg5/root_cause_of_a_students_sudden_misbehavior/",
  "selftext": "A kid on campus, who traditionally was a target for bullying due to being emotionally fragile and consistently melting down at any teasing, started acting out.\n\nDisrupting class, threatening people with threats of gun violence, ditching class, physical altercations, all in the course of like a week.\n\nMy coworker caught the case and was sitting him down talking about it, and after a mild chewing out made the kid burst into tears they got on the same page vis a vis cutting it out and starting his detention.\n\nOn the way out though, the kid said \"It's not really my fault though. My dad told me to do it.\"\n\nMy coworker was like \"wut\" and the kid expounded:\n\n\"My dad told me that since I'm a seventh grader now I was supposed to start ditching class and fighting kids and stuff.\"\n\n\"I thought your dad didn't live at home?\"\n\n\"Yeah, he texts me from prison.\"",
  "link_flair_text": "Humor",
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9599999785423279,
  "domain": "self.Teachers",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "CasualConversation"
  ],
  "varied_title": "Root cause of a student’s sudden misbehavior caught me off guard",
  "varied_selftext": "A kid on campus, who traditionally was a target for bullying due to being emotionally fragile and consistently melting down at any teasing, started acting out. Disrupting class, threatening people with threats of gun violence, ditching class, physical altercations, all in the course of like a month. My coworker caught the case and was sitting him down talking about it, and after a mild chewing out made the kid burst into tears they got on the same page vis a vis cutting it out and starting his detention. On the way out though, the kid said \"It's not truly my fault though. My dad told me to do it.\" My coworker was like \"wut\" and the kid expounded: \"My dad told me that since I'm a seventh grader now I was supposed to start ditching class and fighting kids and stuff.\" \"I thought your dad didn't live at home?\" \"Yeah, he texts me from prison.\""
}