{
  "id": "1gb02fj",
  "title": "I \"woke up\" when I was 12 years old.",
  "subreddit": "TrueOffMyChest",
  "author": "HotmailsNearYou",
  "created_utc": 1729768348,
  "score": 7973,
  "num_comments": 243,
  "permalink": "/r/TrueOffMyChest/comments/1gb02fj/i_woke_up_when_i_was_12_years_old/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1gb02fj/i_woke_up_when_i_was_12_years_old/",
  "selftext": "I woke up when I was 12.\n\nWhen I was a child, strange things would happen to me. I was constantly sick with fevers and flus. I feel it's important to preface with this since it could possibly explain some of the things, but not all of them.\n\n I had a small tube TV in the room next to my bedroom, I called it the toy room because I had an easel, desk, casette deck et cetera in there. I repeatedly woke up sitting in a chair in front of my TV, not remembering walking there. It lasted for about a year when I was 5-6.\n\n When I was about 7 years old I remember standing up out of bed and suddenly being in the middle of a field near my house in my underwear in a heavy rain storm. I walked home since it was only a block away and all the doors of my house were locked, I had to knock to be let in. I remember my parents' shock and disbelief. They always denied it happened and seemed to have no memory of it after that night, but when my mom passed in 2019 I read her old journals she left to me and she wrote it down in 2003! They just genuinely didn't seem to remember it even the next day, even til the day she died. My dad still claims not to remember!\n\nAround this time I started having terrible dreams, waking up groaning and crying, unable to remember them. I genuinely felt like there was something coming into my room and putting the dreams into my head. They stopped abruptly one day and I haven't had a single dream since then. \n\nBetween the ages of 8-10 I would frequently have out-of-body experiences where I would see myself from different viewpoints. Sometimes it was like an over-the-shoulder 3rd person perspective, other times it would be a view from above. It was genuinely all I could see, I couldn't see out of my eyes but only through this odd perspective. I thought I would be seen as crazy if I tried to tell anyone so I just kept quiet and tried not to think about it. It happened occasionally as I got older but \n\nFrom 10-12, I have no memories. None. My parents claimed I just kind of stopped talking, stopped interacting with people, stopped doing anything at all. They said I was like a ghost just existing and emotionless, robotic and silent unless asked a question. I failed all of my classes and was nearly put into special Ed.\n\nThen one day when I was about 12 I just.. woke up. No more weird sicknesses, no more sleepwalking (or teleporting I guess?), no more weird dissociating, nightmares, robotic behavior, paranormal experiences, nothing. I started remembering things normally, experiencing normal pre-teen feelings, everything just kind of started being \"okay\".\n\nI don't even know why I'm posting this but it just crossed my mind and felt weird. Any explanations or insights, even just comments or shared experiences would be awesome. Thanks for reading.\n",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9700000286102295,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "stopprocrastinating",
    "bulletjournal",
    "declutter",
    "minimalism",
    "selfimprovement",
    "college",
    "bipolar",
    "schizophrenia",
    "selfcare",
    "Meditation"
  ]
}