{
  "id": "1gf2qwm",
  "title": "My mother hid my passport from me four weeks before I go  away. She thinks I can’t find it but I found where she put it and now I have it. ",
  "subreddit": "TrueOffMyChest",
  "author": "QuitVisible4488",
  "created_utc": 1730229073,
  "score": 7526,
  "num_comments": 289,
  "permalink": "/r/TrueOffMyChest/comments/1gf2qwm/my_mother_hid_my_passport_from_me_four_weeks/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1gf2qwm/my_mother_hid_my_passport_from_me_four_weeks/",
  "selftext": "Long story short my mother is a cyclic abuser and she’s in her abusive phase right now. I was looking everywhere all over my home (I own it, she lives with me) for my passport to get ready to go away in a couple weeks, just to make sure it was good to go etc \n\nCouldn’t find it anywhere and the envelope  put it in under my bed was empty. \n\nSo when she was out, I searched through her bedside draws and lo and behold my passport was tucked away in some papers. With her passport sitting on top of the papers.\n\nI took my passport and when she came\nHome I asked if she’d seen my passport. She denied and denied. I said I’ve loooked everywhere and can’t find it. She asked did I look in her draws (sarcastically) I replied “no, should I? Is it in there?” She said no.\n\nHow crazy do you have to be to steal\nSomeone’s passport before they go away? Luckily I have it safe now but I can’t wait for her to move out. She’s a nightmare. \n\nShe still thinks I’ve not found it. ",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9800000190734863,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "confession",
    "CasualConversation"
  ],
  "varied_title": "My mother hid my passport from me four weeks before I go  away. She thinks I can’t find it but I found where she put it and now I have it. ",
  "varied_selftext": "Long story short my mother is a cyclic abuser and she’s in her abusive phase right now. I was looking everywhere all over my home (I own it, she lives with me) for my passport to get ready to go away in a couple weeks, just to make sure it was fine to go etc Couldn’t find it anywhere and the envelope put it in under my bed was empty. So when she was out, I searched through her bedside draws and lo and behold my passport was tucked away in some papers. With her passport sitting on top of the papers. I took my passport and when she came Home I asked if she’d seen my passport. She denied and denied. I said I’ve loooked everywhere and can’t find it. She asked did I look in her draws (sarcastically) I replied “no, should I? Is it in there?” She said no. How crazy do you have to be to steal Someone’s passport before they go away? Luckily I have it safe now but I can’t wait for her to move out. She’s a nightmare. She still thinks I’ve not found it."
}