{
  "id": "1govyfs",
  "title": "Fixed my sleeping habits — 10x’d my productivity",
  "selftext": "I have struggled with sleep for 15 years. A little over 5 years ago I became obsessed with fixing this issue... since then I have tried every pill, hack, system, etc in the books...\n\nI recently cracked the code. It has absolutely changed my life. I am more productive in the mornings, have more energy throughout the day, and stay so much more focused. \n\nI honestly thought I was just going to have to deal with terrible sleep my entire life, and was pretty depressed about it at one point. So, let me know if you have any questions, would love to help! \n\n# Summary: \n\n**How I sleep now:** \n\n* 7-8 hours solid most nights of the week\n* I don't take any sleeping meds or melatonin\n* I wake up feeling refreshed and motivated\n\n**How I used to sleep:** \n\n* Sleep 3-4 hours, awake 1-2 hours, then sleep 2-3 hours\n* This meant I needed to be in bed 9+ hours just to feel remotely OK\n* Always woke up tired, and felt like I would drag through the day\n\n**How it impacted my productivity:** \n\n* I used to only have a few good hours of focused work in me in the morning\n* Then, I would crash and feel like I had to force myself to work the rest of the day\n* Now, I can tap into a focused mode throughout the day and even in the evening if I need to\n* I am not as stressed by work, and enjoy it more than I did in a \"tired\" state\n\n\n\n# A Quick Disclaimer \n\n**Before I get to the \"how\":** \n\n* I will share what works for me, but one key point (and paradox is) — sleep is about letting go\n* You can overthink sleep habits easily and it can actually have an opposite effect\n* I would recommend testing these and making it a fun experiment to see what works for you\n* The more pressure you put on sleep, the more elusive it becomes\n\n\n\n# The Basic Sleep Advice: \n\nYou have probably heard most of this if you've done any digging on reddit, but it's worth repeating since I do all of these things as much as possible. \n\n* No stimulants after noon (in my case no caffeine period)\n* Eat last meal at least 2 hours before bed\n* No bright lights, or blue light from screens after sunset \n* Wear blue light blockers if you have to be on screens\n* No doom scrolling after dinner (read instead)\n* Avoid alcohol before bed\n* Keep it cool  \n* keep it dark \n* Take Magnesium Glycinate before bed\n* Sweat and get exercise every day\n* Be outside during sunset (and sunrise if possible)\n\n\n\n# The Advanced Sleep Advice: \n\n**Waking up is OK and it's never perfect**\n\n* Your sleep comes in cycles, so it's natural to wake up some\n* But, you should fall back asleep quickly and easily ideally\n* Even now, I still have 1-2 nights a week where I don't sleep great\n\n**Grounding sheets**\n\n* The studies on these are fascinating\n* Whether you buy into the science or not... \n* just trust me and make the investment \n\n**Break your phone addiction** \n\n* If your mind is conditioned to be overstimulated, it's impossible to get good sleep\n* I block distracting apps completely before 9AM and after 6PM\n* Limit myself to \"10 unblocks\" on social media during the day\n\n**Fall back in love with sleep**\n\n* May sound strange, but you can reframe your thoughts on sleep\n* Look forward to the dreams, the rest, the time to do nothing\n* Pretend you have to \"court sleep like a lover\"\n\n**Develop a ritual**\n\n* A wind down routine will prepare your mind and body \n* \"Build a ramp\" to your sleep (ex: start moving slower at night)\n* Ex: Dinner > Walk > Shower > Stretch Read\n\n**Make your sleep space sacred**\n\n* Clean your room, declutter the space\n* Get a diffuser, salt lamp, or whatever feels right\n* Don't watch TV or do (most) other things in bed\n\n**Get off the sleeping pills**\n\n* I never found a sleeping pill that didn't leave me feeling groggy\n* Taking melatonin will train your body not to produce as much naturally\n* It may take time, but you are better off without it long term\n\n**Eat clean** \n\n* heavier meals, and food from restaurants can disrupt sleep\n* If possible, organic or non-gmo food\n* ideally all the time, but especially your last meal\n\n**Meditation and journaling**\n\n* developing a daily meditation practice has huge long term benefits\n* If your mind is \"full\" when you start to wind down for bed...\n* write everything down in a journal, meditate, and release it for tomorrow\n\n**Forget the sleep tracking**\n\n* I tracked my sleep for years but it had a negative overall impact\n* There were a few good insights early (ex: alcohol ruins sleep)\n* but, I'd wake up and think \"did it register that\"\n* I realized I'm better off letting go of the data in this case \n\n",
  "score": 2825,
  "num_comments": 124,
  "subreddit": "productivity",
  "author": "jjohn6646",
  "created_utc": 1731341800,
  "url": "https://reddit.com/r/productivity/comments/1govyfs",
  "is_text_post": true,
  "rank": 42
}