{
  "id": "1g5mo50",
  "title": "I read my wife’s journal. Married 10 years and am wondering what is the truth now? M39/F39",
  "selftext": "My wife and I have been together for ten years and the last six years have been distant. We have 3 kids together and are not happy. We sleep in different rooms, don’t communicate well and honestly feel like she is a roommate. We sleep together rarely and never spend time together. Part of the reason is her eating disorder which takes priority over me and the kids. \n\nTo make a long story short, she was inpatient residential for her ED for 2 months, PHP for 2 months and now is in IOP. I came across her journals while she was in treatment and no longer see her as the same woman and doubt everything she is saying.\n\nCurrently, we are just about to start our third (and for me… a final attempt at marriage therapy). I feel Completely deflated since reading her thoughts. They include horrible things about me, my mother who I watched die from cancer, my family, etc… examples:\n\n“I hate him so much, he is a narcissist, just like his dead bitch mother”\n“He’s from Britain, not even a real American”\n“He’s Jewish, I should have married a good Christian man”\n“I have turned to my eating disorder, starving myself, over exercising and shopping just to\nfeel something, to feel a burn, to feel a high to feel hunger; I just don't feel anything for him anymore.”\n“Lord, I'm pleading with you, please don't force me to stay married to him; I don't think ive ever actually considered him my husband; the word just sounds\ndisgusting, he's my roomate, or honestly less than that b/c not only do we not get along, but we don't even like each other; we dont' want to see each other or spend time together.”\nDoesn’t want to have sex (unless she fantasizes about us having a threesome with a bug breasted sexy woman). Enjoys the thought of me fucking them both.  \nShe made a list of 32 reasons why she wants a divorce. Kept repeating how she “hates me so much.”\nHates my mother and my family, calls them all evil… “not a good person amongst them”\n\nIn addition, I found out she went off birth control so she could get pregnant with 2/3 kids, has a guy friend I didn’t know about for nine years (whom she denied being sexual with but has thought about fucking), constantly lies to me (and admits this), spends recklessly and is a stay at home mom. Being married for 10 years has been challenging, but after reading everything she wrote. I’m wondering if she is really the woman I thought I married.\n\nIn closing, she says she loves me and wants to make things work, but all i see are the thoughts she put down in her journal. Is this actually what she thinks? Does she want to stay together just because I am a good provider? ",
  "score": 3476,
  "num_comments": 1669,
  "subreddit": "relationship_advice",
  "author": "Top_Promotion_6287",
  "created_utc": 1729156235,
  "url": "https://reddit.com/r/relationship_advice/comments/1g5mo50",
  "is_text_post": true,
  "rank": 28
}