{
  "id": "1ga1ay6",
  "title": "A waitress at a restaurant served me a drink without alcohol because she could recognize bad intentions ",
  "subreddit": "TrueOffMyChest",
  "author": "mandalat",
  "created_utc": 1729655076,
  "score": 8325,
  "num_comments": 71,
  "permalink": "/r/TrueOffMyChest/comments/1ga1ay6/a_waitress_at_a_restaurant_served_me_a_drink/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1ga1ay6/a_waitress_at_a_restaurant_served_me_a_drink/",
  "selftext": "I’ve been in therapy and have been able to unpack things recently and I’ve realized how this complete stranger really helped me a few years ago. \n\nFor context, I was 23 and I went to a restaurant at lunch with my former boss who was about 10 years older than me. Although he was my boss, we were incredible friends the entire 5 years I worked with him. We had gotten so close and he never made a move until I got transferred to a different location, but I brushed off that random night because he was very drunk. \n\nFast forward to our catch up lunch, and I could see how he was purposely trying to get me drunk and go back to his place. I was young, had lost 40 pounds, and was typically a light weight as it is so I was very surprised the drinks weren’t hitting me as hard as they were hitting him. But I wasn’t complaining because I didn’t want to drink honestly, but I was having trouble saying no. When we got to the last drink, I told the waitress that I didn’t want another one and he was being incredibly pushy. After us going back and forth a few times, I gave in and she came and brought it to me. I realized, however, that it was mainly just juice. By this point I was frustrated with my friend and wanted to leave so I didn’t tell her anything, I paid and left. \n\nI won’t go into detail, but my friend definitely tried to make more moves and got increasingly aggressive when I didn’t accept his advances and it ended up being a big thing. I’m realizing now that I probably looked very uncomfortable the entire time and that random waitress was looking out for me, which makes me feel so seen as a person. ",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9700000286102295,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "stopprocrastinating",
    "bulletjournal",
    "declutter",
    "minimalism",
    "selfimprovement",
    "college",
    "bipolar",
    "schizophrenia",
    "selfcare",
    "Meditation"
  ]
}