{
  "id": "1g0clie",
  "title": "My sister and her husband have killed two children while awaiting their murder trial for killing another child",
  "selftext": "Over 7 years ago, my sister and her husband killed their baby daughter by denying her medical treatment. She had a completely treatable illness as a result of my sister and her husband refusing a RhoGAM shot prenatally. As a result my niece died a slow, painful death over three days, while my sister and her husband refused to seek or provide any medical attention.\n\nThey have had their parental rights permanently terminated for their other 4 children (two of which were born since my niece died). In the last 18 months, they have had two additional children die at birth. I don’t know if the autopsies can make any conclusions about whether they were stillborn or died after birth like their previous child. But I do know the parents didn’t call 911, just like with their previous child. \n\nTheir murder trial has been delayed an amazing amount of times due to Covid, and their extremely persistent appeal of every … single … pretrial motion. But at the same time, the court system has rescheduled multiple times to prioritize pending cases with defendants who were in custody. But those intervening years without a trial and incarceration have allowed my sister and her husband to carry to term and likely murder two additional children. \n\nI do not blame the prosecutor’s office, as they have been nothing short of exemplary. But I do wish that the court would schedule this trial at a time that works for the prosecutor, with all possible haste. Or at the very least, remand my sister and her husband to jail until the trial occurs. \n\nThe clock is ticking until my sister and her husband don’t call 911 for another dead baby.",
  "score": 5310,
  "num_comments": 249,
  "subreddit": "TrueOffMyChest",
  "author": "theoldestthrowaway",
  "created_utc": 1728541795,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1g0clie",
  "is_text_post": true,
  "rank": 13
}