{
  "id": "1gancjj",
  "title": "Called off my engagement with my fiancée after her reaction to the engagement ring",
  "subreddit": "TrueOffMyChest",
  "author": "Physical-Bus6025",
  "created_utc": 1729722687,
  "score": 9098,
  "num_comments": 1433,
  "permalink": "/r/TrueOffMyChest/comments/1gancjj/called_off_my_engagement_with_my_fiancée_after/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1gancjj/called_off_my_engagement_with_my_fiancée_after/",
  "selftext": "I proposed to my fiancée (now ex) last week. The diamond ring i bought for her was lab grown, $2400. \n\nA few days after the proposal, everything seemed fine until she somehow discovered the price of the ring. She told me she felt hurt that I would spend so little on her, claiming it reflected her worth and the seriousness of our future marriage. When I asked what she had expected, she said the ring should have been at least $20,000. Granted, I sat her down and explained that, while I could certainly afford a more expensive ring, we needed to manage expectations. There’s also a wedding to plan, and we might be covering most of the costs ourselves since neither of our parents has the means to help.\n\nI pointed out that there are smarter ways to use $20,000: paying off a car loan, putting it toward a down payment on a house, investing, or even funding her business idea—something we had talked about before. As someone who didn’t grow up with financial stability, becoming financially secure and literate is a priority for me. But despite the conversation, she insisted she would still feel bothered if I didn’t upgrade the ring.\n\nGentlemen: the price of a diamond ring should never dictate the quality of your marriage. I’ve been a supportive and committed partner (otherwise, she wouldn’t have accepted my proposal). Her response shocked me, and after a lot of reflection, I ultimately decided to end our relationship. These past few days have been rough, full of emotions and reactions from loved ones and friends, but I chose to trust my gut on this one.\n\nWe clearly have different values, and I realized this isn’t the kind of marriage I want. It hurts—I won’t lie—but a price tag on a shiny mineral shouldn’t define the foundation of a partnership.",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.949999988079071,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "stopprocrastinating",
    "bulletjournal",
    "declutter",
    "minimalism",
    "selfimprovement",
    "college",
    "bipolar",
    "schizophrenia",
    "selfcare",
    "Meditation"
  ]
}