{
  "id": "1fxsn2m",
  "title": "I hate my son ",
  "subreddit": "TrueOffMyChest",
  "author": "Final_Mousse_9754",
  "created_utc": 1728253484,
  "score": 8382,
  "num_comments": 1345,
  "permalink": "/r/TrueOffMyChest/comments/1fxsn2m/i_hate_my_son/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1fxsn2m/i_hate_my_son/",
  "selftext": " I hate my son with every fiber of my being, and I don’t even feel bad about it anymore.\n\nI know this makes me sound like the worst father in the world, but I’m past the point of caring. I absolutely hate my son. And no, this isn’t just me being upset over some typical teenage rebellion or an argument gone too far. He’s 21 now, and I can confidently say he is just a terrible person.\n\nIt started young. He was always the kid who picked on others. I’ll never forget when he broke a classmate’s arm on the playground in 3rd grade. *On purpose.* The school had to get involved, and even then, he just didn’t care. No remorse. No apology. I thought it was just a phase or something he'd grow out of, but it only got worse.\n\nFast forward to his teenage years—he started stealing. Not just little things like a few bucks from my wallet, but serious stuff. Last year, he somehow got into our bank account and drained our savings. Thousands of dollars, gone, and he used it all on drinking, gambling, and who knows what else. We found out when the bank called us about suspicious activity, and when I confronted him, he just shrugged. No apology, no explanation. He didn’t even try to deny it. He just *doesn’t care.* \n\nHe’s cheated on every girl he’s ever dated and then has the audacity to laugh about it like it's some kind of joke. He disrespects everyone around him. When he doesn’t get his way, he throws tantrums—he’s punched holes in the walls, smashed things in the house, and once even threatened to hit me. I’ve had to walk on eggshells in my own home for years now, just waiting for the next explosion. His presence is like this dark, toxic cloud that sucks the life out of everyone.\n\nWe’ve tried everything—therapy, family interventions, tough love, soft love, everything. None of it has worked. At this point, I’m exhausted. I don’t even recognize him anymore, and honestly, I don’t want him around. I can’t believe I’m saying this, but it’s the truth: I don’t want anything to do with him anymore. I’m just... done. I don’t feel guilty about it either, not anymore. You can’t fix someone who doesn’t want to be fixed.\n\n\n\n**TL;DR:** My 21-year-old son is manipulative, violent, and has no empathy. He’s stolen from us, drained our savings, and shows no remorse for any of it. I’m tired, and I don’t want him in my life anymore. I don’t feel guilty about it.\n",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9599999785423279,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "rant",
    "offmychest",
    "confession",
    "self",
    "CasualConversation"
  ],
  "varied_title": "I hate my son ",
  "varied_selftext": "I hate my son with every fiber of my being, and I don’t even feel hard about it anymore. I know this makes me sound like the worst father in the world, but I’m past the point of caring. I absolutely hate my son. And no, this isn’t just me being upset over some typical teenage rebellion or an argument gone too far. He’s 21 now, and I can confidently say he is just a awful person. It started young. He was always the kid who picked on others. I’ll never forget when he broke a classmate’s arm on the playground in 3rd grade. *On purpose.* The school had to get involved, and even then, he just didn’t care. No remorse. No apology. I thought it was just a phase or something he'd grow out of, but it only got worse. Fast forward to his teenage years—he started stealing. Not just little things like a few bucks from my wallet, but serious stuff. Last year, he somehow got into our bank account and drained our savings. Thousands of dollars, gone, and he used it all on drinking, gambling, and who knows what else. We found out when the bank called us about suspicious activity, and when I confronted him, he just shrugged. No apology, no explanation. He didn’t even try to deny it. He just *doesn’t care.* He’s cheated on every girl he’s ever dated and then has the audacity to laugh about it like it's some kind of joke. He disrespects everyone around him. When he doesn’t get his way, he throws tantrums—he’s punched holes in the walls, smashed things in the house, and once even threatened to hit me. I’ve had to walk on eggshells in my own home for years now, just waiting for the next explosion. His presence is like this dark, toxic cloud that sucks the life out of everyone. We’ve tried everything—therapy, family interventions, tough love, soft love, everything. None of it has worked. At this point, I’m exhausted. I don’t even recognize him anymore, and honestly, I don’t want him around. I can’t believe I’m saying this, but it’s the truth: I don’t want anything to do with him anymore. I’m just... done. I don’t feel guilty about it either, not anymore. You can’t fix someone who doesn’t want to be fixed. **TL;DR:** My 21-year-old son is manipulative, violent, and has no empathy. He’s stolen from us, drained our savings, and shows no remorse for any of it. I’m tired, and I don’t want him in my life anymore. I don’t feel guilty about it."
}