{
  "id": "1gplj1s",
  "title": "Friend finally hit her husband back with \"just tell me what to do\" and it was hilarious!",
  "selftext": "(my friend has ADHD, but doesn't use reddit, so she graciously allowed me to share this story)\n\nHer husband always was a typical \"weaponized incompetence is my middle name\" dude, but it became magnitude worse after they had kids. Suddenly, he needed detailed instructions for **everything** (well, except his job, of course, god forbid he's look incompetent in front of his boss or male colleagues) and my friend gradually became very angry and frustrated with their whole situation. I know a lot of us can relate to a situation when you are forced to \"manage\" not only yourself, but also another adult and how taxing mentally it feels.\n\nYesterday she called me laughing hysterically, saying she finally found a way to show him how dumb he looks asking for \"lists and instructions\" with the most basic everyday tasks.\n\nHe was asking for sex that night and she simply said \"Okay, just make me a list of what I need to do!\". Apparently, he thought it's a game, wrote \"give me a blowjob\" on a sticky note and put in on his chest.\n\nBut she calmly proceeded with \"Oh, idk, it sounds so complicated! How about you just tell me exactly what I need to do? It's your penis after all and you know it better than me!\". \n\nHe kept going and said \"Okay, you take it in your hand...\" and she interrupted with \"Do I need to use my right hand or left hand? I think it's important, I don't want to mess up anything!\" and at that moment he just angrily stomped out of the bedroom 😂 Ladies, I WOULD DIE for a chance to be there and see his face at that moment! \n\nAnd while she was telling me all this on the phone he apparently went grocery shopping without her reminding him about it. And didn't ask for a list or shop's detailed layout!\n\nI'm so happy she finally realised she can be this petty when he doesn't do his fair share of household and childcare tasks. ",
  "score": 5417,
  "num_comments": 163,
  "subreddit": "adhdwomen",
  "author": "aoi4eg",
  "created_utc": 1731420514,
  "url": "https://reddit.com/r/adhdwomen/comments/1gplj1s",
  "is_text_post": true,
  "rank": 10,
  "varied_title": "Wife Brilliantly Turns Tables on Husband's Constant Instruction-Seeking and It Was Pure Gold!",
  "varied_selftext": "(my friend has ADHD, but doesn't browse reddit, so she kindly permitted me to share this narrative)\n\nHer spouse consistently embodied the \"weaponized incompetence is my trademark\" persona, but it escalated dramatically after child-rearing. Suddenly, he demanded comprehensive instructions for **everything** (well, except his professional role, naturally - heaven forbid he appear inept before his supervisor or male coworkers) and my friend progressively grew intensely irritated with their entire dynamic. I recognize many can empathize with being compelled to \"manage\" not just yourself, but another grown adult and how mentally exhausting that sensation becomes.\n\nYesterday she phoned me cackling uncontrollably, declaring she'd ultimately discovered a method to demonstrate how ridiculous he appears requesting \"lists and instructions\" for the most elementary daily activities.\n\nHe was soliciting intimacy that evening and she simply responded, \"Okay, just create a list of what I need to execute!\". Apparently, he perceived it as a playful challenge, scribbled \"give me a blowjob\" on a sticky note and affixed it to his chest.\n\nBut she calmly continued, \"Oh, I'm uncertain, it sounds so complex! How about you precisely articulate what I must do? It's your penis anyway and you comprehend it better than me!\". \n\nHe persisted and stated \"Okay, you grasp it in your hand...\" and she interjected with \"Should I utilize my right hand or left hand? I believe it's crucial, I don't want to accidentally mishandle anything!\" and at that precise moment he furiously stormed out of the bedroom 😂 Ladies, I WOULD PERISH for an opportunity to witness his expression at that instant! \n\nAnd while she was recounting this via telephone he apparently went grocery shopping without her prompting him. And didn't request a list or store's intricate layout!\n\nI'm so thrilled sh"
}