{
  "id": "1gdiwtr",
  "title": "I know this is a redflag but.. how red? My (34f) husband (37m) knowingly did something that would cause my medical condition to flare up",
  "selftext": "I have suffered from eczema for about 10 years. In the past I have had anywhere from mild to moderately-severe flare ups, but in the past year I have FINALLY gotten it under control to the point I actually don’t have hardly any flare ups anymore! Part of the solution to my eczema that I found was turning off our water softener. I know that is not the case for everyone and some people say that soft water is actually better for eczema, but that is not the case with my skin. In fact, I experimented with it multiple times and proved that it did in fact cause flare ups for me. \n\nCut to approximately 6 mo ago. I started noticing the itchiness increasing and a few small flare ups. I checked the water softener and lo and behold it was turned on again. I asked my husband about it and he had some reasoning or another, that he preferred the soft water, and joked that he wanted to see if it was just in my head. I was very angry and we got in a fight about it. I told him that this obviously is not in my head as I had the flare ups and itchiness to prove it. I told him to please never turn it on again and he apologized and agreed. I cannot for the life of me remember if we unplugged the machine or just turned it off. \n\nCut to yesterday. Got out of the shower and felt the slimy/itchy feeling that comes with soft water. Immediately went and looked at the water softener and it was plugged in and on. I was absolutely irate and also heartbroken. I immediately confronted him, but he completely denies turning it on. We do not live with anyone else, no kids or roommates or anything. We did have a guy inspecting gas lines recently in our basement which is in the same room as the water softener. His dad also is at our house from time to time and is very much a nosy busybody type who also has slight dementia. I would not be completely shocked if his dad messed with it as he has a history of similar things. So there is a small small chance that one of those people actually did plug it in or mess with it. But.. my gut is honestly that he’s lying to me and that he did this again. But I also can’t wrap my head around the fact that he would knowingly do something that would cause me physical discomfort and pain. I want to believe him but I think there is probably a 75% chance it was him.\n\nWhat I have done so far: I unplugged the machine, and put a note on the cord saying ‘do not plug in’. I explained to him very clearly that it is not funny, it’s not ok to ‘test’ me like that, and that it causes me lots of discomfort. I explained all of this and told him very plainly that if it is ever plugged in again that I would be filing for divorce as he would knowingly be putting my health and comfort at risk. \n\nMy question is… I know this is a red flag, and I will 100% be on alert for other signs. But… how red are we talking? Does this count as like emotional or even physical abuse? Or is it just a little squall or misunderstanding between two people who prefer different things? Like I said, I know it’s not ok. I just want to know how bad this is. Anyone’s helpful opinions appreciated! Or any advice for anything else I should do at this point. Thank you in advance  \n\n\nFor added context, our relationship otherwise is good, not perfect but mostly good. He is what I would consider a good person for the most part, although he is not a perfect partner. But no history of mental or physical abuse. The worst of it from his side is disrespect at times and being selfish or inconsiderate. All things that lots of partners struggle with. Just added that for context  ",
  "score": 2583,
  "num_comments": 575,
  "subreddit": "relationship_advice",
  "author": "123wollywolly",
  "created_utc": 1730056863,
  "url": "https://reddit.com/r/relationship_advice/comments/1gdiwtr",
  "is_text_post": true,
  "rank": 54
}