{
  "id": "1gewy4x",
  "title": "My (25M) girlfriend (25F) has given up on her career after I became a millionaire. How do I tell her this won’t work out?",
  "subreddit": "relationship_advice",
  "author": "Throwra_Atlanta1999",
  "created_utc": 1730214665,
  "score": 7907,
  "num_comments": 1751,
  "permalink": "/r/relationship_advice/comments/1gewy4x/my_25m_girlfriend_25f_has_given_up_on_her_career/",
  "url": "https://www.reddit.com/r/relationship_advice/comments/1gewy4x/my_25m_girlfriend_25f_has_given_up_on_her_career/",
  "selftext": "Backstory I met my girlfriend Kylie (fake name) in community college 7 years ago. We became really close friends and started dating 2 years later. At the time she wanted to be a nurse which was great. She was really passionate about it, and I fully supported her. I ended up transferring to a 4 year university and earning my MBA. Kylie supported me emotionally the entire time through school which I’m grateful for. Kylie’s parents ended up cutting her off financially, because of her spending habits. She ended up taking a year off to work to help her with her bills. In the meantime I invested all my savings, time, and energy into a startup platform with my best friend in the automotive industry. Earlier this year we were bought out for a life changing amount of money. We were both kept on as consultants with a high paying salary as well. Kylie had kept her job at the jewelry store this entire time. After the buyout she told me she was handing her 2 weeks in. I offered to pay for her school and expenses. At first she was excited to go back and earn her nursing degree. I ended up purchasing a condo for us to live in (big step up from our apartment) close to her school. Over the weekend we were talking, and she threw out the fact that she wasn’t sure about wanting to go back to school, and that she could be a stay at home wife (we’re not married). I didn’t say anything in the moment because I wasn’t sure on how to respond. Part of what attracted me to her in the first place was her ambition. It just doesn’t sit right with me that she quit her job and career goals after I came into money. Her shopping/spending has also gone up. She’s been looking at new cars. I could be overreacting, but something just doesn’t seem right. I still love her and want it to work out, but I don’t like this new side of her I’m seeing. \n\nThanks in advance ",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.949999988079071,
  "domain": "self.relationship_advice",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "stopprocrastinating",
    "bulletjournal",
    "declutter",
    "minimalism",
    "selfimprovement",
    "college",
    "bipolar",
    "schizophrenia",
    "selfcare",
    "Meditation"
  ]
}