{
  "_meta": {
    "retrieved_2nd_on": 1731504033
  },
  "all_awardings": [],
  "allow_live_comments": false,
  "approved_at_utc": null,
  "approved_by": null,
  "archived": false,
  "author": "justacreatureinspace",
  "author_flair_background_color": null,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "author_flair_template_id": null,
  "author_flair_text": null,
  "author_flair_text_color": null,
  "author_flair_type": "text",
  "author_fullname": "t2_9lbycrz7",
  "author_is_blocked": false,
  "author_patreon_flair": false,
  "author_premium": false,
  "awarders": [],
  "banned_at_utc": null,
  "banned_by": null,
  "can_gild": false,
  "can_mod_post": false,
  "category": null,
  "clicked": false,
  "content_categories": null,
  "contest_mode": false,
  "created": 1731374425,
  "created_utc": 1731374425,
  "discussion_type": null,
  "distinguished": null,
  "domain": "self.adhdwomen",
  "downs": 0,
  "edited": false,
  "gilded": 0,
  "gildings": {},
  "hidden": false,
  "hide_score": false,
  "id": "1gp8zoh",
  "is_created_from_ads_ui": false,
  "is_crosspostable": true,
  "is_meta": false,
  "is_original_content": false,
  "is_reddit_media_domain": false,
  "is_robot_indexable": true,
  "is_self": true,
  "is_video": false,
  "likes": null,
  "link_flair_background_color": "#0dd3bb",
  "link_flair_css_class": "",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Tips & Techniques "
    }
  ],
  "link_flair_template_id": "60558698-9fcb-11eb-8f30-0e679ec7f105",
  "link_flair_text": "Tips & Techniques ",
  "link_flair_text_color": "dark",
  "link_flair_type": "richtext",
  "locked": false,
  "media": null,
  "media_embed": {},
  "media_only": false,
  "mod_note": null,
  "mod_reason_by": null,
  "mod_reason_title": null,
  "mod_reports": [],
  "name": "t3_1gp8zoh",
  "no_follow": true,
  "num_comments": 178,
  "num_crossposts": 0,
  "num_reports": null,
  "over_18": false,
  "permalink": "/r/adhdwomen/comments/1gp8zoh/living_with_adhd_is_so_hard_sometimes_heres_my/",
  "pinned": false,
  "pwls": null,
  "quarantine": false,
  "removal_reason": null,
  "removed_by": null,
  "removed_by_category": null,
  "report_reasons": null,
  "retrieved_on": 1731374441,
  "saved": false,
  "score": 1513,
  "secure_media": null,
  "secure_media_embed": {},
  "selftext": "Disclaimer: I am on meds now that also help, but they help about 20% of my symptoms. These are things I do on top of meds. \n\nI consider myself to have pretty severe ADHD. Im 24 now and only just now able to feel like I’m not going to fail miserably at life. I grew up with parents who are likely undiagnosed as well, the house was always trashed and full of hoarding level clutter. As I’ve tried to adjust to being an adult, it’s so hard to break out of over 20 years of bad habits on top of the chemical imbalance going on in my brain. Anyways, here’s some tips besides “use a to-do list” and “give yourself an award when you finish something” \n\n- Drink tap water instead of bottled. Full honesty here: on an average week I brush my teeth 3-5 times. I wish I could do it daily. I hate when my teeth feel dirty. But it’s so damn hard.  I drink tap water as much as I can for the fluoride. I do use a filter for taste, but not one that removes the fluoride. I attribute this to my teeth being okay despite my shit hygiene. \n\n- It’s not your responsibility to save the environment if your mental health is suffering. Are paper plates and plastic forks bad? Sure. But my 10 forks a week is a drop in the water compared to the McDonald’s down the street. When times are rough and I can’t keep on top of anything I use: paper dishes, plastic utensils, foil baking pans, slow cooker liners, and disposable plastic takeout containers I bought in bulk online. I have real dishes I try to use, but when my sink isn’t even visible under all of the dirty dishes, I have to do something else. \n\n- Track things with several different methods. I track my budget and bills with an excel spreadsheet, a physical calendar book, and on Google calendar. It’s a lot harder to forget about things when I’ve got several methods. \n\n- Throw shit away. Yeah, anti-consumerism is great and contributing to landfills is bad. But I threw away 3 trash bags full of clothes because I told myself for months to years I would do something with them. They were shitty clothes with bleach stains and holes and not good enough to even donate. There are way better things I could have done with them, but the thing is I never did and I wasn’t going to. \n\n- Do things weird. I want to start working out, but the gym gives me a lot of anxiety no matter how much people try to convince me no one cares about other people at the gym. So I go and do the things I’m comfortable with: walk on the treadmill, use the one leg extension machine that I know how to use, and stretch. Then I come home and use some dumbbells to do the rest of my workout that I’m too embarrassed to do at the gym. Is it the most effective workout? No, but it’s better than nothing. \n\n- Clean in the tiniest of chunks. I literally split my kitchen counter into 3 sections and only do one at a time. \n\n- Buy a bottle of wrinkle remover spray and throw your clean clothes in baskets and be done. Do I have hangers and a closet? Yes. Sometimes I have the energy to hang everything up. But I also have a dedicated spot in my closet with my “clean clothes” baskets. \n\n- Buy multiples of things. I have like 40 pairs of underwear, 30 wash clothes, 15 bath towels etc. It works best for me. \n\n- Remember there are other people out there like us. I have trouble remembering to brush my teeth, sometimes I forget to take a shower for a week, I’ve had to throw away moldy dishes many times, my bedsheets barely get changed, I’m 17k in credit card debt, I’ve failed college chemistry 4 times, once because I forgot I was taking the class. But I’ve met friends and coworkers who struggle with the same things. This sub is great for feeling “normal” too. \n\nThese are the main things I do that help me. If anyone else has unconventional or uncommon tips to share, that would be great too! \n",
  "send_replies": true,
  "spoiler": false,
  "stickied": false,
  "subreddit": "adhdwomen",
  "subreddit_id": "t5_31aao",
  "subreddit_name_prefixed": "r/adhdwomen",
  "subreddit_subscribers": 377100,
  "subreddit_type": "public",
  "suggested_sort": null,
  "thumbnail": "self",
  "thumbnail_height": null,
  "thumbnail_width": null,
  "title": "Living with ADHD is so hard sometimes. Here’s my list of things I do that help me survive",
  "top_awarded_type": null,
  "total_awards_received": 0,
  "treatment_tags": [],
  "ups": 1513,
  "upvote_ratio": 0.9900000095367432,
  "url": "https://www.reddit.com/r/adhdwomen/comments/1gp8zoh/living_with_adhd_is_so_hard_sometimes_heres_my/",
  "user_reports": [],
  "view_count": null,
  "visited": false,
  "wls": null,
  "alternative_subreddits": [
    "selfimprovement",
    "DecidingToBeBetter",
    "DoesAnybodyElse",
    "self",
    "offmychest",
    "rant"
  ],
  "varied_title": "Living with ADHD is so hard sometimes. Here’s my list of things I do that help me survive",
  "varied_selftext": "Disclaimer: I am on meds now that also help, but they help about 20% of my symptoms. These are things I do on top of meds. I consider myself to have pretty severe ADHD. Im 24 now and only just now able to feel like I’m not going to fail miserably at life. I grew up with parents who are likely undiagnosed as well, the house was always trashed and full of hoarding level clutter. As I’ve tried to adjust to being an adult, it’s so hard to break out of over 22 time of bad habits on top of the chemical imbalance going on in my brain. Anyways, here’s some tips besides “use a to-do list” and “give yourself an award when you finish something” - Drink tap water instead of bottled. Full honesty here: on an average week I brush my teeth 3-5 times. I wish I could do it daily. I hate when my teeth feel dirty. But it’s so damn hard. I drink tap water as much as I can for the fluoride. I do use a filter for taste, but not one that removes the fluoride. I attribute this to my teeth being okay despite my shit hygiene. - It’s not your responsibility to save the environment if your mental health is suffering. Are paper plates and plastic forks bad? Sure. But my 10 forks a week is a drop in the water compared to the McDonald’s down the street. When times are rough and I can’t keep on top of anything I use: paper dishes, plastic utensils, foil baking pans, slow cooker liners, and disposable plastic takeout containers I bought in bulk online. I have real dishes I try to use, but when my sink isn’t even visible under all of the dirty dishes, I have to do something else. - Track things with several different methods. I track my budget and bills with an excel spreadsheet, a physical calendar book, and on Google calendar. It’s a lot harder to forget about things when I’ve got several methods. - Throw shit away. Yeah, anti-consumerism is great and contributing to landfills is bad. But I threw away 3 trash bags full of clothes because I told myself for months to years I would do something with them. They were shitty clothes with bleach stains and holes and not good enough to even donate. There are way better things I could have done with them, but the thing is I never did and I wasn’t going to. - Do things weird. I want to start working out, but the gym gives me a lot of anxiety no matter how much people try to convince me no one cares about other people at the gym. So I go and do the things I’m comfortable with: walk on the treadmill, use the one leg extension machine that I know how to use, and stretch. Then I come home and use some dumbbells to do the rest of my workout that I’m too embarrassed to do at the gym. Is it the most effective workout? No, but it’s better than nothing. - Clean in the tiniest of chunks. I literally split my kitchen counter into 3 sections and only do one at a time. - Buy a bottle of wrinkle remover spray and throw your clean clothes in baskets and be done. Do I have hangers and a closet? Yes. Sometimes I have the energy to hang everything up. But I also have a dedicated spot in my closet with my “clean clothes” baskets. - Buy multiples of things. I have like 40 pairs of underwear, 30 wash clothes, 15 bath towels etc. It works best for me. - Remember there are other people out there like us. I have trouble remembering to brush my teeth, sometimes I forget to take a shower for a week, I’ve had to throw away moldy dishes many times, my bedsheets barely get changed, I’m 17k in credit card debt, I’ve failed college chemistry 4 times, once because I forgot I was taking the class. But I’ve met friends and coworkers who struggle with the same things. This sub is great for feeling “normal” too. These are the main things I do that help me. If anyone else has unconventional or uncommon tips to share, that would be great too!"
}