{
  "id": "1g06dis",
  "title": "My wife goes to sleep at 9pm every day and it's killing our marriage",
  "selftext": "My wife claims she needs to sleep at least 12 hours a day to feel well-rested. This was something that I thought was an exaggeration while we were dating, but after we moved in together I quickly realized was 100% true.\n\nMy wife works a remote job from home, which means that she wakes up at 9am every morning, just barely enough time for breakfast before she clocks in at 9:30. She works 8 hours plus a mandatory 1-hour lunch break (where she speed eats her lunch and goes back to work asap). That means she clocks out at 6:30pm. She makes a point to shower every day, and since she has no time to do it in the morning, she does it after work. That usually means that she's done with everything at around 7:15.\n\nBy this time, I've already arrived home and begun preparing dinner. She usually joins me to give me a hand, and we normally begin eating at around 8. After finishing eating and cleaning up, it's usually about 20 minutes to 9, where my wife will finally decide to partake in one of her hobbies (usually reading), or watch or play something with me. This is the best part of my day. However, this doesn't ever last long enough, since by 9pm my wife will invariably claim she's tired and needs to go to bed.\n\nThis means that I get around 15 to 20 minutes per day of hanging with my wife, which I do not feel is enough.\n\nBut this is only one of the many issues this creates:\n\n- She pressures me to go to bed at the same time she does, claiming it would be weird otherwise for a married couple, and that me not doing so is the reason we don't have much sex. I have tried to disprove her theory by going to bed at 9pm as well and, sure enough, she's always too tired or minutes away from falling fast asleep. We're falling into a dead bedroom and I believe that resentment might be setting in.\n- I get sick if I go to bed that soon after dinner. I have a crappy stomach and my digestion will almost stop if I go to bed after eating a meal. Terrible reflux as well.\n- I just don't want to go to bed at 9, period. 9 is the time of my day where I'm finally free from responsibility and can wind down and do what I want. I don't want to wait for the weekend to be able to do that. I don't want to be miserable for 5 days a week, only to try and squeeze a few hours of fun in-between all the chores that need to be done.\n- About weekends: she keeps her sleep routine. This means that late night outings are out of the question, unless a rare surge of energy happens. There is also not that much time for fun, because the weekend is usually when we tackle the huge backlog of chores that accumulated during the week.\n- About communication: I've tried to communicate to my wife that I *need* to be awake between at least 9-10:30 so I can do stuff I enjoy. I tell her that if she needs sleep, then she at least needs to be okay with the idea that I'll be in the living room doing something else. She has a few strong ideas about this, which leave me frustrated: she believes that there are no such things as night owls and early birds, and that sleep patterns are 100% controllable. She also claims she doesn't need to adjust hers, as she's convinced she sleeps a healthy amount of time and that everyone else should be doing the same as her.\n\n\nI often tell her that she pretty much sleeps and works. That's all she does. She has ADHD and hyper focuses on her work, but her productivity is subpar, meaning she usually takes much longer than normal to complete her tasks (probably due to her struggles with attention). This is a common source of anxiety for her. I also believe she might be burned out, as again, she does nothing else in her awake time but work.\n\nAt this point I'm at a loss on what to do. I just don't want to lose the love of my life and best friend to what I consider an incompatible sleep pattern.",
  "score": 4124,
  "num_comments": 675,
  "subreddit": "offmychest",
  "author": "Odd-Acadia-1435",
  "created_utc": 1728519691,
  "url": "https://reddit.com/r/offmychest/comments/1g06dis",
  "is_text_post": true,
  "rank": 20
}