{
  "_meta": {
    "retrieved_2nd_on": 1733074729
  },
  "all_awardings": [],
  "allow_live_comments": false,
  "approved_at_utc": null,
  "approved_by": null,
  "archived": false,
  "author": "Thick_Ticket_7913",
  "author_flair_background_color": null,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "author_flair_template_id": null,
  "author_flair_text": null,
  "author_flair_text_color": null,
  "author_flair_type": "text",
  "author_fullname": "t2_757s5xli",
  "author_is_blocked": false,
  "author_patreon_flair": false,
  "author_premium": false,
  "awarders": [],
  "banned_at_utc": null,
  "banned_by": null,
  "can_gild": false,
  "can_mod_post": false,
  "category": null,
  "clicked": false,
  "content_categories": null,
  "contest_mode": false,
  "created": 1732945115,
  "created_utc": 1732945115,
  "discussion_type": null,
  "distinguished": null,
  "domain": "self.adhdwomen",
  "downs": 0,
  "edited": false,
  "gilded": 0,
  "gildings": {},
  "hidden": false,
  "hide_score": false,
  "id": "1h35plm",
  "is_created_from_ads_ui": false,
  "is_crosspostable": true,
  "is_meta": false,
  "is_original_content": false,
  "is_reddit_media_domain": false,
  "is_robot_indexable": true,
  "is_self": true,
  "is_video": false,
  "likes": null,
  "link_flair_background_color": "#ea0027",
  "link_flair_css_class": "",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Medication & Side Effects"
    }
  ],
  "link_flair_template_id": "387715ca-3324-11ef-b920-fa3135939f44",
  "link_flair_text": "Medication & Side Effects",
  "link_flair_text_color": "light",
  "link_flair_type": "richtext",
  "locked": false,
  "media": null,
  "media_embed": {},
  "media_only": false,
  "mod_note": null,
  "mod_reason_by": null,
  "mod_reason_title": null,
  "mod_reports": [],
  "name": "t3_1h35plm",
  "no_follow": true,
  "num_comments": 213,
  "num_crossposts": 0,
  "num_reports": null,
  "over_18": false,
  "permalink": "/r/adhdwomen/comments/1h35plm/diagnosed_on_monday_at_the_age_of_33_met_with_my/",
  "pinned": false,
  "pwls": null,
  "quarantine": false,
  "removal_reason": null,
  "removed_by": null,
  "removed_by_category": null,
  "report_reasons": null,
  "retrieved_on": 1732945129,
  "saved": false,
  "score": 3188,
  "secure_media": null,
  "secure_media_embed": {},
  "selftext": "So, I was officially diagnosed on Monday with ADD, and the doctor prescribed Concerta for me. She said that if it worked, it would be like putting glasses on - suddenly, I’d be able to read, and things would be more in focus. But that analogy isn’t enough. It’s too small.\n\nI saw my therapist on Friday, and she asked what it’s been like for the past four days being on medication. Do I think it’s working and what evidence do I have that it’s working.\n\nThe glasses analogy just isn’t enough. It’s not just like putting glasses on - it’s like putting glasses on, and someone also turned the lights on in the room. They turned off the strobe light, stopped blasting different kinds of music on six different stereos, made the marching band go away and got all the chaotic crazy rabid cats to sit down. And then, I can see that three of the cats weren’t even mine, and one was a raccoon.\n\nSomeone turned all the TVs off. They stopped flipping the room upside down all the time. I feel like I’ve been stuck in a maze my whole life - trying to catch these rabid cats - I knew where I was supposed to be going and how to get there, but someone kept moving all the walls. I’ve spent my whole life chasing my tail. And now, the maze is just… gone. It’s a level playing field. I can see what’s happening and what’s going on and what obstacles are coming.\n\nEven small things have changed. I notice that I’m hungry before I’m starving to the point of passing out. I know I need to pee before I’m so desperate I have 30 seconds before I wet myself. I realize I’m a little thirsty and need a drink, instead of going an entire day without drinking anything and then having to chug two liters of water because I’m on the brink of dehydration.\n\nSuddenly, I can just do these things—without getting distracted, without getting caught up in the maze and lost six times on side quests.\n\nBeing medicated for ADD is completely life-changing.\n\nMy therapist said she had never heard such a detailed, powerful, visual description of what it’s like when the medication works; that it must be totally exhausting to deal with all of that all of the time and no wonder I’m a ball of anxiety and have depression. No wonder I’m a total control freak and no wonder I can’t delegate things and let people help; I have no idea what’s going on! I’m constantly fighting a losing battle and so when I give up trying to control everything, I sink into a hopeless pit of despair because why bother? I never win - I never get anywhere no matter how hard I try. And she cried. And I cried. ",
  "send_replies": true,
  "spoiler": false,
  "stickied": false,
  "subreddit": "adhdwomen",
  "subreddit_id": "t5_31aao",
  "subreddit_name_prefixed": "r/adhdwomen",
  "subreddit_subscribers": 383318,
  "subreddit_type": "public",
  "suggested_sort": null,
  "thumbnail": "self",
  "thumbnail_height": null,
  "thumbnail_width": null,
  "title": "Diagnosed on Monday at the age of 33. Met with my therapist yesterday. Made her cry.",
  "top_awarded_type": null,
  "total_awards_received": 0,
  "treatment_tags": [],
  "ups": 3188,
  "upvote_ratio": 0.9900000095367432,
  "url": "https://www.reddit.com/r/adhdwomen/comments/1h35plm/diagnosed_on_monday_at_the_age_of_33_met_with_my/",
  "user_reports": [],
  "view_count": null,
  "visited": false,
  "wls": null,
  "alternative_subreddits": [
    "self",
    "selfimprovement",
    "DecidingToBeBetter",
    "offmychest",
    "rant"
  ],
  "varied_title": "Diagnosed on Monday at the age of 33. Met with my therapist today. Made her cry.",
  "varied_selftext": "So, I was officially diagnosed on Monday with ADD, and the doctor prescribed Concerta for me. She said that if it worked, it would be like putting glasses on - suddenly, I’d be able to read, and things would be more in focus. But that analogy isn’t enough. It’s too tiny. I saw my therapist on Friday, and she asked what it’s been like for the past four time being on medication. Do I think it’s working and what evidence do I have that it’s working. The glasses analogy just isn’t enough. It’s not just like putting glasses on - it’s like putting glasses on, and someone also turned the lights on in the room. They turned off the strobe light, stopped blasting different kinds of music on six different stereos, made the marching band go away and got all the chaotic crazy rabid cats to sit down. And then, I can see that three of the cats weren’t even mine, and one was a raccoon. Someone turned all the TVs off. They stopped flipping the room upside down all the time. I feel like I’ve been stuck in a maze my whole life - trying to catch these rabid cats - I knew where I was supposed to be going and how to get there, but someone kept moving all the walls. I’ve spent my whole life chasing my tail. And now, the maze is just… gone. It’s a level playing field. I can see what’s happening and what’s going on and what obstacles are coming. Even small things have changed. I notice that I’m hungry before I’m starving to the point of passing out. I know I need to pee before I’m so desperate I have 30 seconds before I wet myself. I realize I’m a little thirsty and need a drink, instead of going an entire day without drinking anything and then having to chug two liters of water because I’m on the brink of dehydration. Suddenly, I can just do these things—without getting distracted, without getting caught up in the maze and lost six times on side quests. Being medicated for ADD is completely life-changing. My therapist said she had never heard such a detailed, powerful, visual description of what it’s like when the medication works; that it must be totally exhausting to deal with all of that all of the time and no wonder I’m a ball of anxiety and have depression. No wonder I’m a total control freak and no wonder I can’t delegate things and let people help; I have no idea what’s going on! I’m constantly fighting a losing battle and so when I give up trying to control everything, I sink into a hopeless pit of despair because why bother? I never win - I never get anywhere no matter how hard I try. And she cried. And I cried."
}