{
  "id": "1fyjp4x",
  "title": "Actual Conversation I had with admin today: buying stuff for the class.",
  "subreddit": "Teachers",
  "author": "GlassCharacter179",
  "created_utc": 1728337790,
  "score": 12097,
  "num_comments": 633,
  "permalink": "/r/Teachers/comments/1fyjp4x/actual_conversation_i_had_with_admin_today_buying/",
  "url": "https://www.reddit.com/r/Teachers/comments/1fyjp4x/actual_conversation_i_had_with_admin_today_buying/",
  "selftext": "After a long training about how to differentiate based on state test scores. We are supposed to only use state test scores for differentiation, and look up each learning standard then divide in groups based on that:\n\nMe: Ok, but a lot of students just click through the test as fast as possible. Their scores don't reflect their actual ability, just their boredom with the test\n\nAdmin: Offer a pizza party after school for the kids who do well\n\nMe: Ok, where do I send the bill for the pizzas?\n\nAdmin: You could do cookies instead.\n\nMe: Ok, where do I send the bill for the cookies?\n\nAdmin: Cookies are really cheap at Costco.\n\nMe: Ok, Who is paying for the cookies and my Costco membership? ",
  "link_flair_text": "Humor",
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9700000286102295,
  "domain": "self.Teachers",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "CasualConversation"
  ],
  "varied_title": "Actual Conversation I had with admin recently: buying stuff for the class.",
  "varied_selftext": "After a long training about how to differentiate based on state test scores. We are supposed to only use state test scores for differentiation, and look up each learning standard then divide in groups based on that: Me: Ok, but a lot of students just click through the test as fast as possible. Their scores don't reflect their actual ability, just their boredom with the test Admin: Offer a pizza party after school for the kids who do well Me: Ok, where do I send the bill for the pizzas? Admin: You could do cookies instead. Me: Ok, where do I send the bill for the cookies? Admin: Cookies are actually cheap at Costco. Me: Ok, Who is paying for the cookies and my Costco membership?"
}