{
  "id": "1fz4b9r",
  "title": "I teach English at a university. The decline each year has been terrifying. ",
  "selftext": "I work as a professor for a uni on the east coast of the USA. What strikes me the most is the decline in student writing and comprehension skills that is among the worst I've ever encountered. These are SHARP declines; I recently assigned a reading exam and I had numerous students inquire if it's open book (?!), and I had to tell them that no, it isn't... \n\nMy students don't read. They expect to be able to submit assignments more than once. They were shocked at essay grades and asked if they could resubmit for higher grades. I told them, also, no. They were very surprised. \n\nTo all K-12 teachers who have gone through unfair admin demanding for higher grades, who have suffered parents screaming and yelling at them because their student didn't perform well on an exam: I'm sorry. I work on the university level so that I wouldn't have to deal with parents and I don't. If students fail-- and they do-- I simply don't care. At all. I don't feel a pang of disappointment when they perform at a lower level and I keep the standard high because I expect them to rise to the occasion. What's mind-boggling is that students DON'T EVEN TRY. At this, I also don't care-- I don't get paid that great-- but it still saddens me. Students used to be determined and the standard of learning used to be much higher. I'm sorry if you were punished for keeping your standards high. None of this is fair and the students are suffering tremendously for it. ",
  "score": 25114,
  "num_comments": 3872,
  "subreddit": "Teachers",
  "author": "HighlightMelodic3494",
  "created_utc": 1728405706,
  "url": "https://reddit.com/r/Teachers/comments/1fz4b9r",
  "is_text_post": true,
  "rank": 1,
  "varied_title": "Teaching English at a University: A Disturbing Academic Descent",
  "varied_selftext": "I work as a professor at a collegiate institution on the east coast of the USA. What truly astonishes me is the precipitous decline in student writing and comprehension abilities that ranks among the most abysmal I've ever witnessed. These are DRAMATIC declines; I recently administered a reading assessment and numerous students inquired if it's an open-book exam (?!), and I had to inform them that, no, it absolutely isn't...\n\nMy students fundamentally don't read. They anticipate being able to submit assignments multiple times. They were utterly stunned at essay grades and requested if they could resubmit for improved scores. I told them, unequivocally, no. They were profoundly surprised.\n\nTo all K-12 educators who have endured unfair administrative pressure demanding higher grades, who have suffered through parents screaming and berating them because their student didn't excel on an exam: I'm deeply sympathetic. I operate at the university level precisely to avoid dealing with parents, and I don't. If students fail-- and they most certainly do-- I simply do not care. Not at all. I experience zero disappointment when they perform poorly and I maintain the standard high because I expect them to rise to the challenge. What's absolutely mind-blowing is that students CATEGORICALLY DON'T EVEN ATTEMPT. At this, I also remain indifferent-- I'm not compensated exceptionally well-- but it still profoundly saddens me. Students once were driven and the standard of learning was substantially more rigorous. I apologize if you were penalized for maintaining your academic standards. None of this is equitable and the students are suffering immensely as a consequence."
}