{
  "id": "1gdk3r2",
  "title": "my husband doesn’t know I’m about to divorce him",
  "subreddit": "TrueOffMyChest",
  "author": "ImportantAudience610",
  "created_utc": 1730060029,
  "score": 8212,
  "num_comments": 591,
  "permalink": "/r/TrueOffMyChest/comments/1gdk3r2/my_husband_doesnt_know_im_about_to_divorce_him/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1gdk3r2/my_husband_doesnt_know_im_about_to_divorce_him/",
  "selftext": "This has been my plan for 6 years. Throwaway account for obvious privacy reasons, this is by far the craziest thing I’ve done and I can’t believe I suffered all these years staying with this man just so I can survive financially\n\nThe start of our marriage was wonderful. We had two babies. After the second pregnancy he cheated on me with a very close family member. He gave me a lazy apology and on top of that he complained about my body. He also told me I was built like a refrigerator mind you I was four months postpartum at the time.  I secretly saw a family lawyer, to sum it up for you I would be screwed leaving him. We only had $25k jointed and that being split up is basically nothing for me. No martial properties. I didn’t have a job. I was a SAHM. I applied for hundreds of jobs during the time and couldn’t find employment anywhere so leaving was a bad decision for me financially speaking especially with 2 small babies. Also, alimony and child support wasn’t going to be enough for me to live off of or survive with two babies with \n\nSo I let him believe that I forgave him and I continued being his wife\n\nHe still cheated on me after I found out he cheated on me with my cousin. He also had a one night stand with a random girl he met when he was out one night. I got so mad, I cheated back on him out of anger, he never found out I cheated though at least I’m smart about it unlike him\n\nDuring the time in our marriage, I worked on getting my independence back. My husband paid for my trade school it was a very expensive program but he paid for everything\n\nWe moved and we bought a house with his income. He grew his money too during all this time. So he made far more money now than he did when I originally wanted to leave him. I started working just 2 weeks ago. I haven’t filed for divorce yet. He has no idea of my plans. I’m excited. I finally get to leave him after 6 almost 7 years. Now I can walk away with at least $200k and we have martial assets now like the house and the car he also paid off for me. Now I have my education and my own career. I been working on my weight loss. I lost 66 pounds he paid for my tirezepatide. I had a breast reduction and a breast lift. I look amazing, I don’t doubt I’ll probably get remarried eventually. Everything in my life is FINALLY set and going the right way ",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9399999976158142,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "NoStupidQuestions",
    "DoesAnybodyElse",
    "self",
    "offmychest",
    "rant",
    "confession",
    "CasualConversation"
  ],
  "varied_title": "my husband doesn’t know I’m about to divorce him",
  "varied_selftext": "This has been my plan for 8 year. Throwaway account for obvious privacy reasons, this is by far the craziest thing I’ve done and I can’t believe I suffered all these years staying with this man just so I can survive financially The start of our marriage was wonderful. We had two babies. After the second pregnancy he cheated on me with a very close family member. He gave me a lazy apology and on top of that he complained about my body. He also told me I was built like a refrigerator mind you I was four months postpartum at the time. I secretly saw a family lawyer, to sum it up for you I would be screwed leaving him. We only had $25k jointed and that being split up is basically nothing for me. No martial properties. I didn’t have a job. I was a SAHM. I applied for hundreds of jobs during the time and couldn’t find employment anywhere so leaving was a bad decision for me financially speaking especially with 2 small babies. Also, alimony and child support wasn’t going to be enough for me to live off of or survive with two babies with So I let him believe that I forgave him and I continued being his wife He still cheated on me after I found out he cheated on me with my cousin. He also had a one night stand with a random girl he met when he was out one night. I got so mad, I cheated back on him out of anger, he never found out I cheated though at least I’m smart about it unlike him During the time in our marriage, I worked on getting my independence back. My husband paid for my trade school it was a very expensive program but he paid for everything We moved and we bought a house with his income. He grew his money too during all this time. So he made far more money now than he did when I originally wanted to leave him. I started working just 2 weeks ago. I haven’t filed for divorce yet. He has no idea of my plans. I’m excited. I finally get to leave him after 6 almost 7 years. Now I can walk away with at least $200k and we have martial assets now like the house and the car he also paid off for me. Now I have my education and my own career. I been working on my weight loss. I lost 66 pounds he paid for my tirezepatide. I had a breast reduction and a breast lift. I look amazing, I don’t doubt I’ll probably get remarried eventually. Everything in my life is FINALLY set and going the right way"
}