{
  "id": "1gajl7q",
  "title": "I accidentally pushed my company's CEO and spilled coffee on him on my first day.",
  "subreddit": "jobs",
  "author": "WizardCROCY",
  "created_utc": 1729713067,
  "score": 9177,
  "num_comments": 395,
  "permalink": "/r/jobs/comments/1gajl7q/i_accidentally_pushed_my_companys_ceo_and_spilled/",
  "url": "https://www.reddit.com/r/jobs/comments/1gajl7q/i_accidentally_pushed_my_companys_ceo_and_spilled/",
  "selftext": "\nToday was my first day at my new job.\n\nI enter the office reception desk at 7:40 am, I see a guy, early 30's, blue suit, brown shoes, talking to the receptionist. \n\nI had laptop bag, flowers, and some decorations in another bag flowers in one hand and I had my coffee cup in the other hand.\n\nI was so focused on watching my coffee cup that I wasn't looking in front of me, I walked right into that guy, making him lean over the reception counter and spilled my coffee over his back. I can't tell you",
  "link_flair_text": "Office relations",
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9700000286102295,
  "domain": "self.jobs",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "self",
    "offmychest",
    "rant",
    "CasualConversation"
  ],
  "original_title": "I accidentally pushed my company's CEO and spilled coffee on him on my first day.",
  "original_selftext": "Today was my first day at my new job.\n\nI enter the office reception desk at 7:50 am, I see a guy, early 30's, blue suit, brown shoes, talking to the receptionist. \n\nI had laptop bag, flowers, and some decorations in another bag flowers in one hand and I had my coffee cup in the other hand.\n\nI was so focused on watching my coffee cup that I wasn't looking in front of me, I walked right into that guy, making him lean over the reception counter and spilled my coffee over his back. I can't tell you how embarrassing that was!\n\nThe guy turned around and looked at me with his eyes wide open. I was continuously apologizing, he just said that it's fine. Then he asked me: you're the new hire, right? I said yes. He replied with: welcome to the company and have a good day, then left. \n\nThen the reception said that the guy I spilled coffee on is the CEO. I was about to start crying, I was super embarrassed and scared.\n\n1 hour later, I got a call on my desk from reception saying go to the CEO's office after 2 hours. I don't have words to explain how scared I was during this 2 hours, I didn't even decorate my workplace because I thought I'll be fired.\n\nI went in the office, shook his hand and sat down in front of him. There was already a cup of coffee ready for me, he said: 'Go ahead, coffee's for you; you couldn't enjoy the morning one. Don't worry about the morning, it happens, I understand that you were in a rush and probably anxious about your first day. Forget about it, all's good. Welcome to the firm.\n\nAnd then we talked for an hour or so. Awesome place, I'll love working here.",
  "minimally_varied": true,
  "variation_date": "2025-08-12 11:33:08",
  "varied_title": "I accidentally pushed my company's CEO and spilled coffee on him on my initial day.",
  "varied_selftext": "Yesterday was my initial day at my new job. I enter the office reception desk at 7:40 am, I see a guy, early 30's, blue suit, brown shoes, talking to the receptionist. I had laptop bag, flowers, and some decorations in another bag flowers in one hand and I had my coffee cup in the other hand. I was so focused on watching my coffee cup that I wasn't looking in front of me, I walked right into that guy, making him lean over the reception counter and spilled my coffee over his back. I can't tell you"
}