{
  "id": "1g6o54p",
  "title": "My (M44) Wife (F44) is spiraling hard due to an obsession with the subreddit r/loveafterporn. how do I gently tell her that she has a problem and it is effecting the relationship? ",
  "selftext": "First of all, r/loveafterporn is not a hate sub, this is not open season to go on there and start abusing and harassing the people that use it. It is a safe space for the spouses of addicts and a very important community on this website. This isn't about them. **DO NOT HARRASS THEM.**\n\n  \nalso, advise telling me to divorce my wife will be ignored. This is a rough patch but I love her and will do so until the day I die\n\n  \nso a little about me, I met my wife 24 years ago. I have always been a loner and a LLM or Low Lobito Male. I didn't make this any sort of secret when we got together. I am also demi sexual meaning I really can only be sexual with people I have a huge bond with. (and before anyone asks, there is nothing medically wrong with me. My testosterone levels are fine, I work out and eat right. I have friends and hobbies. and most importantly to this story, I don't look at porn)\n\nanyway I like to have sex about once a week, sometimes every 2 weeks. Sometimes I initiate sometimes she does. I personally like to be overwhelmed with passion right before doing it. I consider it a special occasion and not something that is done every day. When I met I explained this to my wife and not only did she agree  but she found it very romantic.\n\nSo its been a good two decades since then, We have been through ups and down but we stick together. that was until she made a reddit account. about a month after that she approached me about having a look through my phone and I said sure why not. I didn't give it any mind. a bit later she asked to put Truple on it (for those that don't know this is a monitoring app that takes screenshots of what you are looking at) This struck me as odd and I asked about it and she said she was feeling insecure lately and wanted it. perhaps stupidly i didn't push the issue further and just agreed. I barely used my phone anyway so who cares.\n\nI really started to hear alarm bells when she started getting much more sexual, she wanted to try kinks she never had any interest in before, she bought sexy cloths and began to cling to me throughout the day. I would still turn her down but instead of it being nothing suddenly she would just stop talking to me for a day or only make dinner for herself and say that she \"forgot\" to make me any. I also noticed she appeared to be glued to her phone all the time, everyone is always on there phones so the fact that I noticed this should show how excessive it was. I only got glances but she would either looking a Truple or reddit.\n\nobviously her odd behavior caused the bedroom to dry up. I'm like some kind of sensitive fish that needs a certain PH level to get going so this disruption in out life made me lose interest in initiating which further worsened the problem. \n\nAround a month ago I started to finally demand some kind of explination as to what was going on. I heard that people sometimes change like this when they get brain tumors so I was genuinely worried that there was something seriously wrong with her. She then lashed out at me saying she \"knew\" and that she knows she isn't enough anymore. It was very heated as now I thought she was accusing me of cheating. and she sort of was?\n\nThis is admittedly an educated guess on how the timeline went, I asked her before but she tends to shut down before telling me too much. First I believe she found r/DeadBedrooms on the \"most popular\" page while scrolling and found a couple that was a bit like us (with a LLM) and learned that if a man isn't constantly trying to have sex with you and making comments it means that his sexual energy must be, as she put it; \"going somewhere else\". due to my sexuality she knows for certain that I'm not cheating physically, we also live in a very small town and I work out of our garage. but a certain comment said that if he isn't sexual with you he is 100% a porn addict and linked to r/loveafterporn. that when she learned how to spot the addiction and i had (all the telltale signs) I asked her what the signs were and she said she didn't owe a gaslighter an explination\n\nI immediacy asked to see her phone and she said no and said I should sleep on the couch until i'm (ready to come clean). unfortunately for her, I know her reddit username and was only asking to be cordial. I look at her recent posts and comment history and was sickened. Her post on r/loveafterporn started off sane but then spiraled out of control with commentors egging her on with stuff like (you don't need evidence if you feel it in you gut). It was insane. My wife has always had a level of anxiety and this space she has found appears to have ignited her biggest insecurities. I then found the post that insinuated that she was going to leave me if I didn't fess up soon (to the great calibration of the commentors) which scared the shit out of me and for the first time I felt that my marriage was in real danger.\n\nThe next day I admitted to her that I read her post history and said we need to go into consoling. She agreed but for the wrong reasons and said she already found a CSAT in the area that specializes in porn addiction.\n\nI lost my cool, I demanded to know how the fuck I could possibly be looking a porn if I demi sexual, have Truple and are basically in line of sight at all times to which she replied that I could be looking at it while taking a poop by getting around Truple in some complicated way. We yelled back and fourth and I decided to stay at a friends for the night from which i am now writing on his computer.\n\nI have no fucking idea what to do, everything I say is turned around on me as (classic addict gaslighting). I really want to save this. please help",
  "score": 2433,
  "num_comments": 256,
  "subreddit": "relationship_advice",
  "author": "Ok-Mud-7756",
  "created_utc": 1729273554,
  "url": "https://reddit.com/r/relationship_advice/comments/1g6o54p",
  "is_text_post": true,
  "rank": 63
}