{
  "id": "1gelcbg",
  "title": "I am HIV positive and it’s ruining my life. ",
  "selftext": "I (30 F) found out I have HIV a couple of months ago. It was completely devastating to me. My ex and I had broken up the month before. We had an open relationship and I was completely in love with a fwb I had. When I was diagnosed, that fwb was understandably very scared. We had had a lot of unprotected sex over two years. He got tested and was fine. But he said we shouldn’t have sex for a while. But I know what that means. I’m still trying to get over that. I know he didn’t love me back but all I wanted was to be with him. I was happy just sleeping with him. I felt blessed and privileged because I considered him to be absolutely perfect and he was so amazing in bed. I really didn’t want to lose him. He’s still around. He replies to my messages. He never messages me though. And there’s no flirting anymore. I’m really struggling to get over him. \n\nI recently went on a trip and met a guy at a bar. I kissed him but stopped myself from sleeping with him. We were texting about how we should sleep together. He said I was hot. He was in to me. It seemed we were gonna be sexually compatible. I was proud of myself for trying to get over fwb. And I really miss having regular sex. Today we were talking about how it had to happen. So I knew it was time to tell him. I told him I was HIV positive and that I was undetectable and I cannot transmit it. I also gave him an out and told him I would understand if he wasn’t interested anymore. He said he was sorry I had to deal with that and that he was fine with it as long as he couldn’t get it. I was happy about that. When I was first diagnosed, I really thought no one would ever touch me again. Sex is very very important to me. I was stoked that this guy was okay with this and I thought “okay, if he’s okay with it, other people will be too”. A little bit later, I noticed he blocked me. I really wish he was just straight up about it. It hurt. Now I’m back to thinking I can’t have sex anymore. \n\nThe timing really sucks. I am single for pretty much the first time ever. I just moved into my first place alone. I desperately wanted to be promiscuous. \n\nI can’t talk to many people about my situation and I really did just need to get it off my chest because I’m upset. I’ve had to deal with so much recently and I don’t know how I’m coping anymore. I’m sad. \n\n\n",
  "score": 2088,
  "num_comments": 504,
  "subreddit": "TrueOffMyChest",
  "author": "meganndragonfruit",
  "created_utc": 1730172361,
  "url": "https://reddit.com/r/TrueOffMyChest/comments/1gelcbg",
  "is_text_post": true,
  "rank": 95
}