{
  "id": "1ftc36t",
  "title": "My daughter tried three times to end her life and I'm giving up mine to care for her",
  "selftext": "I'm so tired. My (58f) daughter ((22f) is five weeks out from nearly killing herself. Third attempt. A bottle of vodka and a 90 day supply of antidepressants. She had seizures and was in the ICU on a ventilator for two days. I'm grateful she's alive.\n\nMy husband (61stepfather) and I live seven states away. I called an ambulance after a panicked text from her boyfriend (22m). Got the next plane I could get. She was released to my care after a week. She's now on new meds and supervised 24/7. She and I are living in her studio apartment which is crammed to the gills with two beds, and an excessive amount her clothing, shoes, and craft supplies. I have ALL medications locked in a safe. I've removed all the scissors, razors, and knives. I literally sleep on the only set of car and door keys. There have been two nights where she's wanted to hurt herself. I don't sleep those nights.\n\nGot her a base of Ketamine infusion therapy. Been taking her to see both chemical dependency and mental health therapy. Been handing her the new meds she's on and watching her take them.\n\nShe has been diagnosed bipolar and with treatment resistant depression. She also has a history of cutting. If I left and went home today she would stop meds and not be alive in a week. She tells the crisis team she doesn't want to be alive but she doesn't have a plan so they won't admit her. They told me to keep doing what I'm doing.\n\nHusband and I are all in. We will do whatever it takes to support her. We are not rich. We are paying her bills (rent, car insurance, phone, electric). I don't work, and husband is on disability insurance income. I'm so damned lucky to have his love and support. He needs my help because he's had severe health and mobility problems for almost four years now. \n\nThis whole thing is killing me by inches. I want to go home. I don't want to take her away from her friends and her boyfriend. They have been immensely supportive. She's been mostly compliant, but I know she thinks I'm her jailer. She can't hold a job because she's an unreliable employee. She's never been able to fully pay her own way. So her staying in her apartment is unrealistic. She spends all her time on her bed on the phone (social media) and texting with her boyfriend. She barely tolerates me. But today she's speaking to me in full sentences so that's an improvement.\n\nI feel like I'm useless. My daughter is an incredibly smart, kind person with a lifetime ahead of her that she just can't see yet. Losing her would...well I cannot go there. I know with the right treatment she can live a healthy life. But I can't force her to want it. Please don't tell me I'm a great mother because if I were she wouldn't be in this spiral.  Thanks for letting me get this out.",
  "score": 2819,
  "num_comments": 165,
  "subreddit": "offmychest",
  "author": "imadoggomom",
  "created_utc": 1727745314,
  "url": "https://reddit.com/r/offmychest/comments/1ftc36t",
  "is_text_post": true,
  "rank": 43
}