{
  "id": "1gc9xh6",
  "title": "My hard-earned ADHD tips",
  "selftext": "Thought I'd post the tricks I've developed to manage my ADHD. I'm managing pretty well at the moment. Pre diagnosis I'd want to end myself like 70 % of the time and now I'm down to like 10 %. I now know this was mostly burnout. It must also be noted that I'm now on medication (been about four years). Absolute game changer. Cannot recommend enough. I use it mostly for getting out of bed and doing emails.\n\nTips:\n\n* Bullet journaling. This is a modified bullet journal but pretty much buy a notebook, write down all the stuff you have to do that day. Cross out tasks. Next day, look at previous days tasks. Any which aren't completed get put on today's list (and crossed from previous page). I also use this for meetings/important instructions. You keep a table of contents at the front (and put page numbers on each page) to refer back to. This has helped so much. People don't mind you writing down instructions in meetings - it makes you look diligent. If I have a comment during someone's presentation I write it down for the end so I don't have to worry about forgetting it. They don't have to be pretty but I like stickers so it makes me more likely to use it if I decorate.\n\n\n* Magnesium glycolate supplements stop the medication headaches. General vitamin supplements help. I'm trying fish oil now to see if that does anything.\n\n\n* When I get burnout I start getting physically ill - headaches, sneezing, etc. I'm lucky to have a flexible job. I take a day to \"work from home\". I sit in a dark room and sleep. I refuse to feel guilty about this. I'm plenty productive the rest of the week so no one ever notices. This has majorly helped my working life because burnout *absolutely wrecks* me for like a month. \n\n\n* For boring stuff like showering, and I am very bad at showering consistently, I indulge in fancy products. I'm really into scented stuff so I will get something I really want to try. This makes me want to shower. \nSomeone tell me if they know something good for tooth brushing cos I suck at that too. \n\n\n* For tasks if it takes under five minutes I will do it immediately as soon as I think of it. \n\n\n* For tasks I desperately do not want to do I bargain with myself. I don't need to do all the dishes, I'll tell myself I'll just put three in the dishwasher. Once I start the task I usually just finish it, but if I only do three that's okay.\n\n\n* I accept that I'm just going to do tasks slowly or imperfectly. That's alright. \n\n\n* I have a laundry hamper for dirty clothes and a laundry hamper for clean clothes. Better than clothes on the floor or piled on a chair. Also bless whoever it was who said to get a mesh bag for socks and undies to sort them out before washing. That's an awesome tip. \n\n\n* I have a spot for my keys. My keys always go in the spot. Occasionally they get lost, but after repetitively putting them in the spot it's now habit. \n\n\n* Every time I leave the house I say \" wallet, phone, keys\" and pat each to check I have them. This eventually became a habit and I lock myself out less.\n\n\n* I installed a keypad that auto locks on my front door. Now I don't lock myself out ever. \n\n\n* I have trackers on my keys. I have find my phone on. I have a wallet built into my phone case. I lose my wallet way less now.  I cannot figure out how to stop losing umbrellas. Someone please tell me. \n\n\n* I have a robot vacuum because I hate cleaning. Strong reccomend. \n\n\n* I eat huel because I hate eating, particularly when I'm focused at work. I try to ignore the tech bro branding. Also chobani yogurt drinks. Anything that I don't have to assemble or heat up. For some reason the microwave is my kryptonite. Even eating chips is better than nothing.\n\n\n* I bring a water bottle into work and sit it on my desk. I actually drink water if it's there. \n\n\n* Exercise helps :( I find it hard to stick to a routine and I hate the gym. However I like walking. I also like Pokémon go. \n\n\n* DBT helped me heaps with sitting with uncomfortable feelings. There's free courses online. \n\n\n* I have impulse buy money set aside for my weekly budget. If I have the money for it I just buy it. However, my rule is it has to sit in the cart for a day. \n\n\n* Cheese, popcorn, yogurt, pickles, seaweed snacks and prosciutto (?) are good alternatives to the endless snacking on sour straps that I used to do. I'm not a paragon of health but I'm not eating a bag of minties a day either. \n\n\n* If I'm angry and upset and depressed I do the following in order : eat something. Drink water. Sit in a dark room and snooze. That usually fixes it.\n\n\nPlease add your own tips!",
  "score": 2232,
  "num_comments": 284,
  "subreddit": "adhdwomen",
  "author": "dabennett",
  "created_utc": 1729905628,
  "url": "https://reddit.com/r/adhdwomen/comments/1gc9xh6",
  "is_text_post": true,
  "rank": 77
}