{
  "id": "1gdfn8u",
  "title": "A guy was going to fight my dad in a road-rage incident and didn't see me in the passenger seat. His behavior changed real quick once I got out of the car and charged him. ",
  "subreddit": "TrueOffMyChest",
  "author": "uSedRx7",
  "created_utc": 1730048470,
  "score": 7879,
  "num_comments": 157,
  "permalink": "/r/TrueOffMyChest/comments/1gdfn8u/a_guy_was_going_to_fight_my_dad_in_a_roadrage/",
  "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1gdfn8u/a_guy_was_going_to_fight_my_dad_in_a_roadrage/",
  "selftext": "We were on a narrow street so only one car could pass at a time. Suddenly a car tries to exit a parking lot and go in our direction. She stops and is blocking our path. We can't go back as we would need to reverse the whole length of the street.\n\nThen this guy comes out from the parking lot on foot and asks if there is a problem here. My dad assumed he was some onlooker trying to see if everything is okay so he got out of the car and explains the situation. \n\nThen this guy goes over to the car that is blocking our way, tells the woman to not move and then comes over to my dad and asks him \"What are you gonna do about it?\"\n\n Turns out it's the brother of the woman in the car blocking our way...\n\nMy dad is standing in a defensive position with his car door in between him and this guy. Meanwhile I'm in the front seat just in shock that this is happening. This guy is taller than my dad so he crouches by a bit, puts his hand on his knees and looks at my dad with this serious look on his stupid face as if to say \"You can't do anything\"\n\nAt this point I can't believe this is happening and lower my head in disbelief. That's when I hear a BANG and I thought that this guy hit my dad.\n\nThis primal anger came over me and I quickly exit the car and start yelling at this dude. He was skinny but tall. I was taller than him, I weight 108kg (238lbs) and have been going to the gym for the past year.\n\nThis guy went from trying to fight to immediately backing up as I started charging him while yelling. He started explaining himself to me while walking backwards, like I was his teacher and he was in trouble. Started telling me that my dad swore at his sister and that he was defending her. It was hilarious that he was lying to me because I was right there and my dad never swore.\n\nMy dad ran over and stopped me from going any further and kept telling me to calm down as this guy was walking away from us. \n\nI saw this look of fear in his face when I got out and started yelling. I am a very introverted and peaceful person I don't think I have scared anyone before this point.\n\nThis guy was 100% looking to fight my dad, that bang I heard was him kicking the car door luckily he didn't hit or injure my dad. I'm glad I was there.\n\nAnd the lady blocking our way also backed up once I got out although she was screaming profanity at us the whole time. After that we just got in the car and drove off.\n\n\n\n",
  "link_flair_text": null,
  "over_18": false,
  "spoiler": false,
  "stickied": false,
  "upvote_ratio": 0.9700000286102295,
  "domain": "self.TrueOffMyChest",
  "is_self": true,
  "is_video": false,
  "is_original_content": false,
  "media": null,
  "preview": null,
  "alternative_subreddits": [
    "stopprocrastinating",
    "bulletjournal",
    "declutter",
    "minimalism",
    "selfimprovement",
    "college",
    "bipolar",
    "schizophrenia",
    "selfcare",
    "Meditation"
  ]
}