{
  "id": "1g6i17k",
  "title": "Diagnosed at 28. Found a letter my mother wrote me at 8 years old telling me I needed to take responsibility for myself",
  "selftext": "Hi all, I have gained so much strength and validation and tips and joy from this space so thank you for having me.\n\nTL;DR is the title, ramblings below\n\nTW: emotional neglect\n\nGrowing up there were weeks of silent treatment or screaming and not much healthy conversation, which meant that a lot of the communication was through handwritten notes. I’ve recently come across a plethora of incredibly upsetting notes I’d written my parents asking for help and support because I was scared and sad and lost and didn’t know who to turn to for help. Sadly they were not ever emotionally available to really see me or hear me, so I turned inward and became the parent for my younger siblings because I didn’t want them to ever feel the loneliness and suffering I felt. \n\nOf course, I also had ADHD which no parent or teacher supposedly noticed or supported me with, and it went undiscovered until I crashed and burned at 28. I’ve been confronting the grim truth that is growing up as the parentified eldest daughter in a toxic household rife with emotional neglect and abuse.\n\nThen I read this letter my mother wrote me at age 8 through the lens of all I’ve learnt about my ADHD brain and how I think and feel and process. Of course baby me was struggling to concentrate, keep away from distractions, give all of my attention, not doodle, not forget everything I learned etc.\n\nAll these things I still struggle with immensely to this day, and these words sting me so hard still. I can‘t imagine writing these words down and delivering it to your child who is struggling so hard, telling them they are giving ‘silly excuses’ for not being able to function at the ‘acceptable’ level. It is so, so cruel. This is very tame compared to most letters and notes my mother wrote me, and they came in addition to lengthy screaming matches and arguments about my laziness and disorganisation, because I simply wasn’t trying hard enough.\n\nI read this now and at least know I am not an imposter here and I really have struggled much more than neurotypical folk. I wish I could go back through time and tell baby me that I was not a bad person or a failure, but that I was failed by those charged with providing me care and support. It is still hard and I still don’t quite believe myself when I say I am good enough. But I am here and I am trying and I hope that some of you will relate and feel less alone ❤️‍🩹\n",
  "score": 2153,
  "num_comments": 440,
  "subreddit": "adhdwomen",
  "author": "824824824",
  "created_utc": 1729258014,
  "url": "https://reddit.com/r/adhdwomen/comments/1g6i17k",
  "is_text_post": true,
  "rank": 88
}