{
  "id": "1g3xl0h",
  "title": "How do I (36F) tell my husband (39M) that I don’t want to celebrate my birthday with him? ",
  "selftext": "\nMy husband’s birthday was just a few days ago. I wanted to take him out to dinner and he said he just wanted a lowkey birthday at home, so I respected his wishes. We have been married for 3 years and together for 7. We have two children 2 and 3 years old. In the past years I’ve always tried my best to make him feel special on his birthday. Baking his favorite cake, made his favorite meals, did a surprise bday celebration one year, have decorated the house, and got him presents. His parents and siblings Don’t do anything for his birthday and always act like it’s any other day. His own dad forgot his bday this year and I had to call him to remind him. \n\nFor this birthday, I got his favorite coffee and donuts when he woke up. Had baked two apple pies per his request the night before with my sister after working a full work day and taking care of my kids (he works nights and isn’t home till 9:30-10) I Had balloons downstairs and his presents from me and the kids waiting to be ready when he walked downstairs.  Everything was going well the morning of his birthday. We got home that afternoon and I stared to get a really bad headache. I’m under a lot of pressure and get headaches often. I’m the main caretaker of my children, home, and I work full time in a very difficult and demanding job. My husband tries to help, but always uses his commute and work as an excuse. Anyways, he asked me what was wrong and I told him my head was hurting badly. He was so upset and said “wow, even on my birthday I have to deal with your bullshit” threw a tantrum, then everything went downhill from there. \n\nMy 3 year old wasn’t listening during lunch so my husband took him up to his room slammed the door shut, and started yelling at him and I ran up there to rescue my son and told my husband not to ever yell at him like that. I was already in semi tears bc of his response to my headache and then my husband told me in front of my 3 year old “I hate you, yelled and said I want a divorce” then things escalated very badly. I didn’t care it was his birthday anymore and I was so overwhelmed with sadness so I left. A few hours pass by and I tell my husband let’s just have pizza and pretend for the kids since they were so excited to sing happy birthday etc. He then proceeds to tell me this is the worst day of his life & he’s the saddest he’s ever been in his life and that I left to punish him & I didn’t make him feel special. At this point his birthday doesn’t even matter since he said all those terrible things to me. \n\nMy birthday is coming up in 2 weeks and I just don’t want to do anything with him at all. I promised myself to focus on my health for this birth year and stop putting my energy into him since he doesn’t give me the energy I feel I deserve. How can I communicate to him the reasoning behind why  I don’t want to spend my birthday with him this year? ",
  "score": 2149,
  "num_comments": 275,
  "subreddit": "relationship_advice",
  "author": "ChemicalWoodpecker89",
  "created_utc": 1728959619,
  "url": "https://reddit.com/r/relationship_advice/comments/1g3xl0h",
  "is_text_post": true,
  "rank": 91
}